
new Song("አለሁ በለኝ እና ", "EbenzerF", "በመጎብኘትህ ውስጤን ጎብኘው\nበመገኘትህ በለኝ አለሁድምፅህ ሲርቀኝ እፈራለሁ \nያላንተ ውዴ ውስጤ ባዶ ነውተናገረኝ ጌታ ያሻህን\nተናገረኝ አንተ የወደድከውን\nድምፅህን እንድቀድሞው ልስማ  ብቻ ካንተ ጋር ልስማማ\nእንዳላፍር ልቤ በስርዓትህ ይቅና\nየቃልሀን ማስተዋልን ስጠኝናቀኑን ሁሉ ህግህ ትዝታዬ ይሁን\nያስተምረኝ መንገድህን የቀናውንህግህ ለእግሬ መብራት ለመንገዴም ብርሃን ይሁን*4\nበብርሃንህ ብርሃንህን አያለሁያሰብክልኝም ቦታ እደርሳለሁ\nመገኘትህ ልቤን ደስ ደስ ይለዋል\nጉብኝትህ ነፍሴን እጅግ ያረካታልጠረንህም እንደ ናርዶስ ሽቶ ነው\nመኖርህን በዚያ ነው የምለየው\nውዴ ሆይ የት ነው ያለኧው*2እስካገኝህ/ እስኪነጋ ድረስ እፈልግሃለሁ\nውዴ ሆይ የት ነው ያለኧው\nአሰማኝ ድምፅህን አሳየኝ ፊትህንከጎኔ አትለይ አትራቅ ካጠገቤ\nድምፅህን ልስማውና/ አለሁ በለኝና ከዚያ ይረፍ ልቤ\n"),

