INSERT INTO `lyric` (`_id`, `lyric_title`, `lyric_album_id`, `lyric_actual_lyric`, `lyric_is_fav`) VALUES  (NULL,'ለአይኖቼ መኝታ','kehulu1','ለአይኖቼ መኝታ ለሽፋሽፍቶቼም እንቅልፍ
ለጉንጮቼም እረፍት አልሰጥም አልሰጥም
የሱስ ከብሮ እስከማይ በኢየሩሳሌም ላይ
ወደ ምንጣፌ አልጋ አልወጣም አልወጣም
ለኢየሱሴ ስፍራ
ለያእቆብ አምላክ ማደርያ
እስከማገኝ ድረስ እስከማገኝ ድረስ /2/

በቀንም በሌሊት እርሱን አስባለሁ
በበጎዬም ሥራ እጄን አበረታለሁ
የኢየሱስን ማደሪያ ሁሌ ቀድሳለሁ
ለአይኖቼ መኝታ አልሰጥም እተጋለሁ
አምላኬን ዘወትር አገለግለዋለሁ

ጌታዬ አንተው ነህ- አምላኬ አንተው ነህ
ጸሎቴን መለስከው- እንባዬን አበስከው /2/

ለኢየሱስ ከመዘመር ወደኋላ አልልም
ለጉንጮቼም ዕረፍት ለምንጊዜም አልሰጥም
አምላኬን በእውነት እስከማየው ድረስ
ለክብሩ አዜማለሁ ኢየሱስ እስከሚነግስ
እንባዬን አፈሳለሁ ሁሉጉዜ ለኢየሱስ
ጌታዬ......

ከድካሜ አርፌ በብርታት ተሞልቼ
እንባዬን ኢየሱስ አብሶ ከአይኖቼ
የምስጋና ዜማ የእልልታ ድምጽ ሰፍቶ
አያለሁ አይቀርም ማደሪያውን ሞልቶ
አያለሁ አይቀርም ኢየሱሴ ከብሮ
ለአይኖቼ.....
',0),(NULL,'ብዙ ነው ምስጋናው ብዙ','kehulu1','ምስጋና እልልታ ክብር የእርሱ ነው /2/
በሰማይ መቅደሱ ብቻውን ላለው /2/
አምልኮና ስግደት የሚቀበለው /2/
ኧረ ይኸ እግዚአብሔር እንደ እሱ ማን ነው? /2/
ብዙ ነው ምስጋናው ብዙ
ብዙ ነው አምልኮው ብዙ
በሰማይ መቅደሱ /2/

በተዘጋ ቤት በሐዘን ኑሮ
ተስፋ በሌለው ያለሽ በሮሮ
እፍኙን ዱቄት ባርኮልሽ
የረሃቡን ዘመን ያሳለፈሽ
ከግራ ከቀኝ እረዳት ጠፍቶ
መኖርሽ እንኳን በሰው ትረስቶ
የማይረሳ አምላክ ከላይ አየሽ
በምህረቱ ተጎበኘሽ
ባርኪው ነፍሴ የወደደሽን 
በተአምራት ያሳለፈሽን /2/

ኦ ነፍሴ ሆይ እግዚአብሔርን ባርኪ 
ምስጋናውንም ከቶ አትርሺ /2/

የጥበብ ሁሉ ምንጭ የሰው ልጅ ዕረፍት/2/
ከኃጥያት እስራት የተፈታበት /2/
መሸሸጊያ አምባ የማምለጫ አለት /2/
አይጥልም አይተውም ከተማመኑት ከታመኑበት


ኦ ነፍሴ ሆይ እግዚአብሔርን ባርኪ
ምስጋናውንም ከቶ አትርሺ/2/
ኃጥያትሽን ይቅር ብሏል ደዌሽንም እርሱ ፈውሷል
ከጥፋትም ከልሎሻል ምህረቱን አብዝቶሻል

መራራውን ጣፋጭ አድርጎልሽ
የተዘጋው በር ተከፍቶልሽ
ምህረቱ በዝቶ ታስበሻል
ነፍሴ አመስግኚው በእርሱ ታይተሻል
እንደ አይኑ ብሌን ተጠንቅቆልሽ
ቀድሞ እየወጣ ከፊት ከፊትሽ
የጠላትን ደጅ ጌታ አውርሶሻል
በአምላክሽ ሥራ ዛሬ ቆመሻል
አመስግኚው ነፍሴ ጌታሽን 
አስቀድሞ የወደደሽን /2/

ነፍሴ አክብሪው ኢየሱስ ወዶሻል
ታላቅ ኃይሉን አሳይቶሻል
ለዘለአለም በማይለወጥ
አስሮ ይዞሻል በፍቅር ገመድ/3/
',0),(NULL,'ይገባዋል ምስጋና','hosana1','ይገባዋል ምስጋና እንዲህ ላደረገው
ይገባዋል እልልታ ይህን ላደረገው
ከገመትነው በላይ ሰራልን ኢየሱስ
ሁሌም በእኛ መሃል ከፍ ብሎ ይንገስ /2/

ያሳደደን ያ ጠላት በባህር ውስጥ ሰጠመ
ክንዳችንም በኃይሉ በዘይቱ ለመለመ
ታሪካችን በጌታ በኢየሱስ አማረ
ሥራችንን ሰርቶልን በሕይወታችን ከበረ /2/

የሃዘን የለቅሶ ወራት እንደ ዋዛ አለፈ
ጠላታችን አፈረ ስራው ሁሉ ከሸፈ
ባህሩ ተከፈለ እኛም በድል ተጓዝን
ይኸው በፊቱ ቆመን በደስታ እንዘምራለን /2/

ይጠፋሉ ስንባል ዛሬም አለን በሕይወት
ታሪክ ተለወጠና ምድርንም ሞላናት
በኢየሱስ ሁሉ አልፎ የመከር ጊዜ መጥቷል
በደስታ ተለውጦ ሐዘናችን ተረስቷል /2/

አዲስ ቅኔ ልንቀኝ በገና አንስተናል
እኛም በዘመናችን ታምራቱን አይተናል
ማዕበሉን ገስጾ በውሃ ላይ ሲያራምድን
በክንዱ ተደግፈን አለፍን በድል መንገድ /2/
',0),(NULL,'አምልኮዬን ስጨማምር','hosana1','አምልኮዬ ስጨማምር ምስጋናዬ ስጨማምር
እልልታዬ ስጨማምር ሽብሸባዬ ስጨማምር
የከበደኝ ሸክም ከኔ ተወገደ
በቤቴ ውስጥ የአምላኬ ሰላም ሆነ
ያስጨነቀኝ ሸክም ከእኔ ተወገደ
በቤቴ ውስጥ የኢየሱስ ሰላም ሆነ

አምልኮዬ /ዝማሬዬ ኃይል ጉልበት አለው
ደጋግሜ ኢየሱስን ላክብረው
አልቆጥብም ፍጹም አልሰለችም
አዲስ ቅኔ መቀኘት አልተውም /2/

ሲዘመር/ ሲመለክ በእልልታ በሆይታ
ኢያሪኮ ቅጥሩ ተመታ
ተረበሸ የጠላት መንደር
በምስጋና ኢየሱስ ሲከብር   /2/

ምስናዬ/ዝማሬዬ ነው የጦር እቃዬ
እዘምራለሁ እስኪከበር ጌታዬ
አመጣለሁ/አበዛለሁ አዳዲስ ምስጋና
ድል የማገኘው ያን ጊዜ ነውና     /2/
',0),(NULL,'ጻድቅ በእምነት ይኖራል','hosana1','ጻድቅ በእምነት ይኖራል /2/ በእምነት ይኖራል
አይደነግጥም አይረበሽም አይጨነቅም እህህ
ወደ ፊት እንጂ ወደ ኋላ አይሄድም
ወደ ፊት እንጂ ወደ ኋላ አያይም እህህህ

በለስ ባታፈራ በእምነት ይኖራል /2/
ቢበዛ መከራ በእምነት ይኖራል /2/
በረሃብም ዘመን በእምነት ይኖራል /2/
ያውቀዋል አምላኩን በእምነት ይኖራል /2/

ምድር ብትናወጥ በእምነት ይኖራል /2/
ተፈጥሮ ቢለወጥ በእምነት ይኖራል /2/
እግዚአብሔር ቢያከብረው በእምነት ይኖራል /2/
ደግሞም ቢያዋርደው በእምነት ይኖራል /2/

የመጣው ቢመጣ በእምነት ይኖራል /2/
ቢያገኝ ወይም ቢያጣ በእምነት ይኖራል /2/
ልቡን እያጸና በእምነት ይኖራል /2/
በንጹህ ምስጋና በእምነት ይኖራል /2/

ውጥኑ ቢበላሽ በእምነት ይኖራል /2/
ከኢየሱስ ቤት ሳይሸሽ በእምነት ይኖራል /2/
ብድራቱን አይቶ በእምነት ይኖራል /2/
              በተስፋ ተሞልቶ በእምነት ይኖራል /2/
',0),(NULL,'ሃሌሉያ','hosana1','ዝናው በምድር ላይ ከፍ ከፍ ብሏል
የኃያሉም ጉልበት ለእርሱ ተንበርክኳል
እግዚአብሔር ከሰማይ ድምጹን አሰምቷል
በፊቱ በድፍረት ከቶ ማን ይቆማል?

ሃሌሉያ /2/ ኦ ሃሌሉያ /2/
እግዚአብሔር ነገሰ ይበሉ 
የምድር ፍጥረታት በሙሉ
እግዚአብሔር ነገሰ ይበሉ
ታናናሾችና ታላላቆች ሁሉ 
አሜን ይበሉ

ተራሮች ኮረብቶች ለእርሱ ይሰግዳሉ
አምላክ ነው እያሉ ዝቅ ዝቅ ይላሉ
እግዚአብሔር ኃያል ነው ሁሉንም ይገዛል
ሕያዋን ፍጥረታት እርሱን ያመልኩታል

ኪሩቤል ሱራፌል እልፍ አእላፍ መላዕክት
ቅዱስ ነህ እያሉ ወድቀው የሚሰግዱለት
በክብሩ ዙፋን ላይ ተቀምጦ ላለው
አምልኮና ስግደት ክብርን እንስጠው

አረ እስቲ ማን ነው እግዚአብሔር ተናግሮ
አልፈራሁም የሚል የቃሉን ድምጽ ሰምቶ
ክብሩ ከሰማያት ከፍ ከፍ ብሏል
ምስጋናውም ምድርን በሙሉ ሸፍኗል
',0),(NULL,'ጽዮን ተነሺ ዘምሪ','hosana1','ጽዮን ተነሺ ዘምሪ /3/
እልል እልል በይ /3/
አምላክሽ አስቦሻል /2/ አስቦሻል
ኢየሱስ አልተወሽም /2/ አልተወሽም

የሐዘን የስደት ዘመን አልፎልሻል
እግዚአብሔር እንባሽን ከአይንሽ አብሷል
በጌጠኛው ልብስሽ ተነሺ ዘምሪ
የአምላክሽን ምህረት ለአለም ተናገሪ /2/
አብሪ አብሪ ተነሺ አብሪ በዙሪያሽ ተመልከቺ
እነዚህ ሁሉ ተሰብስበው ይመጣሉ ወደ አንቺ /2/

በእግዚአብሔር ሥራ ልብሽ ይደነቃል
አስፊልን ይሉሻል ጽዮን ሆይ በዝተናል
እነዚህን ሁሉ ማንስ ወለደልኝ
ትያለሽ ተደንቀሽ ማን አሳደገልኝ /2/

አብሪ አብሪ...

በተራሮች አናት ላይ ኢየሱስ አስቀምጦሻል
ሰው ሁሉ በአንቺ መሸሸግ ይመርጣል
የናቁሽ በሙሉ ወደ አንቺ ይመጣሉ
ከእግርሽ ሥር ገና ወድቀው ይሰግዳሉ /2/

አብሪ አብሪ....
ጽዮን ተነሺ...

አብሪ አብሪ....
',0),(NULL,'ተሻገርኩኝ','hosana1','ስንቱን አልፌ ነው በቤትህ መኖሬ
ስንቱን አልፌ ነው በፊትህ መቆሜ /2/
ማዕበሉን ተሻግሬ ተራራውን ወጥቼ
የማልችለው በአንተ ተችሎ
ቆሜአለሁ ይኸው ጸንቼ /2/
ተባረክ አዎ ተባረክ ተባረክ
ሌላማ ቋንቋ እኔ የለኝም
ተመስገን ነው እንጂ የሱስ ለዘለአለም /2/

ያ ክፉ ጠላቴ እንዳለው ቢሆንማ /2/
ያኔውኑ በጠፋው ነበረ ጸሎቴም ባልተሰማ /2/
ነገር ግን/ በፍጹም አልሆነም እንደ ልቡ ምኞት
ኢየሱስ ተዋጋልኝ ሆነልኝ ጉልበት /2/
ተሻገርኩኝ አሻገርከኝ ኢየሱስ በአንተ ሁሉ ሆነልኝ
ዘመናትን/አመታትን በአንተ አለፍኩኝ አዲስ ምዕራፍ ተከፈተልኝ /2/

ወጥመዱ ሲሰበር እኔም አመለጥኩኝና /2/
በረድኤቴ አምላክ በኢየሱስ እንባዬን ታበሰና /2/
ዛሬ ፊቱ ቆሜ ምስጋናን ሰዋለሁ
ድምጼን ከፍ አድርጌ እባርከዋለሁ /2/
ተባረክ ተባረክልኝ /2/ ኢየሱሴ/ ውድዬ ከፍ በልልኝ /2/

ጠላት በአይኑ እያየ እሄዳለሁ በከፍታ /2/
ከምንም የማላስተያየው አለ እኮ የእኔ ጌታ /2/
እግዚአብሔር ክብሬ ነው ተስፋ አድርጌዋለሁ
አንዳች ሳይጎድልብኝ በቤቱ እኖራለሁ /2/
ስንቱን  ....
ባህሩን ስመታ ለሁለት ተከፈለ /2/
እኔም በውሃ ውስጥ አለፍኩኝ ኢየሱስ ከጎኔ ስላለ /2/
አንበሶች አልበሉኝ በሰላም አደርኩኝ
ትእዛዝ ከላይ ወጥቶ እኔም አመለጥኩኝ /2/
ተሻገርኩኝ አሻገርከኝ ኢየሱስ በአንተ ሁሉ ሆነልኝ
ዘመናትን/አመታትን በአንተ አለፍኩኝ አዲስ ምዕራፍ ተከፈተልኝ /2/
ተባረክ ተባረክልኝ /2/ ኢየሱሴ/ ውድዬ ከፍ በልልኝ /2/
',0),(NULL,'አንተ የእኔ ጌታ','hosana1','አንተ የእኔ ጌታ /2/ ኦ የእኔ ጌታ
አንተ የእኔ ኢየሱስ /2/ ኦ የእኔ ኢየሱስ

በዙፋንህ ላይ ጸንተህ አለህ
ዘመኔ ይቆጠር አንተን ሳከብርህ /2/

አለማትን በቃልህ ፈጠርህ
ሁን እንዳልከው ሁሉ ሆነልህ
መርጨሃለሁ ለእኔ አለኝታዬ
በቃ ወድጄሃለሁ ተስፋዬ

ለዘመንህ ፍጻሜ የለህ
 አታረጅ አትቀየርም ያው ነህ
የሰላም ንጉስ ነህ ኢየሱሴ
አንተን ብቻ መረጥኩኝ ለነፍሴ

አንተ የእኔ ነህ የእኔ የግሌ
አላሳንስም የአንተን ዝማሬ
ልገዛልህ በፊትህ ልንበርከክ
በመላ ኃይሌ ውዴ ተመለክ /2/
',0),(NULL,'ሊያበቃ','hosana1','ሊያበቃ ደረሰ የዘመን ፍጻሜ
ቀን ሳለ ለመሄድ ተዘጋጅ ወንድሜ
ያለህን አጽንተህ ጠብቀው
ኢየሱስን ልትገናኘው ነው /2/

ኢየሱስ አይቆይም በቶሎ ይመጣል
አልዘገይም ብሎ በቃሉ ተናግሯል
ሁሉ እስኪዘጋጅ ወዶ ይታገሳል
በቀን ወይ በሌሊት ድንገት ይገለጣል /2/

ባስቀመጥህ ስፍራ አምላክህን ጠብቀው
በጎ ታማኝ ባሪያ ሁንለት ልባም ሰው
የሕይወትን አክሊል ከእጁ ልትቀበል
ሃይማኖትህን ጠብቅ እሩጫህን ፈጽም /2/

በመክሊትህ ትጋ ራስህን አዘጋጅ
ኢየሱስ ሊመጣ ተቃርቧል ከደጅ
መንሹ በእጁ ነው አውድማውን ያጠራል
የተዘጋጁትን ከእርሱ ጋር ይወስዳል /2/

ሐሜት ጥል ክርክር ከውስጥህ አውጥተህ
ወደ ሰርጉ ግብዣ ነጩን ልብስ ለብሰህ
በበጉ ፊት ልትቆም ቀኑ ቀርቧልና
ተዘጋጅ ወንድሜ መብራትህን ያዝና /2/

ና ቶሎ ና ማራናታ አሜን
ና ቶሎ ና ማራናታ
ና ቶሎ ና የእኛ ጌታ /2/
',0),(NULL,'አንድ ነው','hosana1','ለማይረሳው ሕያው ለሆነው
በልባችን ዙፋን ለተቀመጠው
ለንጉሱ /4/

ይሁን ምስጋና ይሁን ይሁን ሙገሳ ይሁን
ይሁን እልልታ ይሁን ይሁን ውዳሴ ይሁን /2/

ነገስታት ሲሾሙ ሲሻሩ ኃያላን ሲወድቁ ሲነሱ
ነገስታት ሲሾሙ ሲሻሩ ኃያላን ሲወድቁ ሲነሱ
የእኔ ጌታ አለ ጸንቶ በዙፋኑ
ኢየሱስ ግን አለ ከብሮ በዙፋኑ /2/
ሁሉንም ያዛል ስልጣን የሱ ነው
ብቻውን ሆኖ ነው የሚገዛው /2/
የእኔ ጌታ ....
በዙፋኑ ላይ ለተቀመጠው
እኔ አልቆጥብም እዘምራለሁ/እልል እላለሁ /2/

በቤትህ ደጃፍ በመቃንህ በአንገትህ እሰረው አርገው በእጅህ
ከባለእንጀራህ ተጫዋወተው እኔ የማውቀው አንድ ነው በለው
አንድ ነው አምላክህ/እግዚአብሔር አንድ ነው
በልብህ ዙፋን ላይ አስቀምጠው /2/

ከጥንትም ጀምሮ ልቡ ያረፈብህ
ኢየሱስ የመረጠህ አንድ ሕዝብ አንተ ነህ
ስለዚህ ተነሳ አርማህን ያዝና
ሰው ሁሉ ይረፍበት ልቡ በእርሱ ይጽና
በቤትህ .....

ለሙሴ በእሳት የተገለጠው
ዛሬም በመንፈሱ የሚመላለሰው
እስራኤል ሆይ ስማ አምላክህ አንድ ነው
አንተም አንዱን ጌታ ከልብህ እመነው
',0),(NULL,'አታፍርም አትዋረድም','hosana1','አታፍርም/አታፍሪም አትዋረድም/አትዋረጂም
የሱስን ይዘህ/ይዘሽ ፍጹም አትወድቅም/አትወድቂም

አምላኬ ትቶኛል ለምን ትላለህ?
የሱስ ካንተ ጋር ነው ለምን ትሰጋለህ?
ጊዜውን ጠብቆ ዘምበል ይላል
በፈተናም ሰአት መውጫን ያዘጋጃል

አይዞህ ጽና በርታ ልብህ አይፍራ
በመንገድህ ሁሉ የሚመራህ
የሱስ ካንተ ጋር ነው ክፉ አይነካህ
ጠላት ሊቋቋምህ ከቶ አይችልም /2/
አታፍርም.....

 መልካሙ እረኛ የሱስ አለህ
ዘወትር የማይለይ ከዙሪያህ
በእጆቹ ደግፎ ያቆመሃል
የልብህን መሻት ይሰጠሃል /2/
አምላኬ.....

 የውስጥህን ሃሳብ የሱስ ያውቃል
ሁልጊዜ ስላንተ እሱ ያስባል
በከፍታዎች ላይ ያቆመሃል
ጠላትህን ፈጥኖ ያዋርዳል /2/
አታፍርም....
አምላኬ....

የሱስ ለልጆቹ ሩህሩህ ነው
እርሱን ለሚፈሩት ፍጹም ቸር ነው
በምድረ በዳ ላይ አይጥልህም
ይረሳ ዘንድ የሱስ ሰው አይደለም /3-4/
',0),(NULL,'መዝሙሬ ይቀጥላል አምልኮዬ','hosana1','እንደ ሰባ እንቦሳ በፊቱ እዘላለሁ
እልልታ ዝማሬ አቀርብለታለሁ
ኢየሱስ ይክበር እንጂ ክብሬን እጥላለሁ
ከሆንኩትም በላይ ገና እሆናለሁ

መዝሙሬ ይቀጥላል አምልኮዬ በዚህ ብቻ መች ያበቃል
እልልታዬ ይቀጥላል ኢየሱሴ ከዚህም በላይ ይመለካል
ገና ገና እዘምራለሁ ገና ገና አመልከዋለሁ
ገና ገና እልል እላለሁ ለኢየሱሴ ክብሬን ጥላለሁ /2/

ጠላቴ ቢያስቆጣው ለእርሱ መዝሙሬ
ጭራሽ ይባስ ብዬ ጨምራለሁ ዛሬ
የእኔ ዕድል ፈንታ ክብሬና ሞገሴ
ኢየሱስ እንደሆነ ታውቀዋለች ነፍሴ
ገና ገና ....
ኢየሱሴን ለማምለክ ምክንያት ፈላልጌ
በፍጹም ሳልቆጥብ ድምጼን ከፍ አድርጌ
እሰዋለታለሁ የምስጋናን መስዋዕት
ማደሪያውን ይሙላ ያርግ ዕለት ዕለት

ጠላቴ ቢያስቆጣው ለእርሱ መዘመሬ
ጭራሽ ይባስ ብዬ ጨምራለሁ ዛሬ
የእኔ ዕድል ፈንታ ክብሬና ሞገሴ
ኢየሱስ እንደሆነ ታውቀዋለች ነፍሴ
ገና ገና ....

ከምንም ከማንም ኢየሱስ ይሻለኛል
የዘላለም እርስት ወራሽ አርድርጎኛል
ዳገት ቁልቁለቱን በእርሱ አልፌአለሁ
በዘመኔ ሁሉ እኔ አመልከዋለሁ
',0),(NULL,'ባለ ብዙ ክብር','fishbermul','ባለ ብዙ ክብር ቃልህ እንደ ብዙ ውኃ
ክብርህ ሰማያትን ምስጋና ምድርን ሞልታለች
እኛም በአንተ ፊት ለክብርህ እንሰግዳለን
ዝቅ ብለን ለክብርህ እንሰግዳለን ዝቅ ብለን /
ለክብርህ እንሰግዳለን ፊትህ ወድቀን /2/

በደመናት ክብር ትራመዳለህ
በስልጣን ኃይል ሁሉን ትገዛለህ
ክብርህ ከሰማይ ሰማያት በላይ ነው
ምስጋናህ የበዛ ኃይልህ እጅግ ታላቅ ነው /2/
ምስጋናህ የበዛ ኃይልህ እጅግ ታላቅ ነው

ኃይልህ ሲገለጥ ማን ይቆማል በፊትህ
ፍጥረት ያከብረሃል የፍጥረት ጌታ ነህ
እናመልክሃለን በሕይወት ዘመናችን
ክብር ይገባሃል ኢየሱስ አምላካችን /2/
ክብር ይገባሃል ኢየሱስ አምላካችን

ታላላቅ መላእክት በፊትህ ሲሰግዱ
ኮሮብቶች ሲቀልጡ ተራሮች ሲርዱ
የገነነው ኃይል ሲታየን ክብርህ
እናመስግን እንጂ ወድቀን እፊትህ /2/
እናመስግን እንጂ ወድቀን እፊትህ

',0),(NULL,'በመልካሙ ምክርህ ነፍሴ ተማርካለች ','fishbermul','በመልካሙ ምክርህ ነፍሴ ተማርካለች
መታመኛዋ ነህ ልትባርክህ ወዳለች /2/
ትንፋሼንና መንገዴን የያዝከው አምላኬ
አከብርሃለሁ ኢየሱስ አከብርሃለሁ
አነግስሃለሁ ጌታዬ አነግስህአለሁ /2/

በሁሉ ላይ ስልጣን ያለህ ሁሉን ስትሰራ አይቻለሁ
የከበረውን ታዋረድ ዘንድ ሁሉ በፊትህ ያነጻው
ክብር ልስጥህ የሚገባህን
ይሙላ እንግዲህ መቅደስህን /2/

በከፍታ ሰላም አድራጊ የህይወቴ መቀመሚያ ነህ
የኑሮዬን ጣዕም የያዝክ እንቅቁልሽ የማይከብድህ
የምትረዳኝ ወዳጄ ነህ
የኃይል ጉልበት ያገኘሁብህ /2/

ከቶ አልፈራም አስጨናቂ ሁሉ ነገሬ በእጅህ ነው
ብቸኛ አማራጭ አንተ ነህ ጥበቃህን ወድጃለሁ
ደስታዬንም የምታበዛ
ፍቅርህ ግሩም ጣዕም አለው ለዛ /2/
',0),(NULL,'አሳፈረው ጠላቴን ኢየሱስ','fishbermul','አሳፈረው ጠላቴን ኢየሱስ አሳፈረው
አሳፈረው ጠላቴን ጌታ አሳፈረው
አዋረደው ጠላቴን ኢየሱስ አዋረደው
አዋረደው ጠላቴን ጌታ አዋረደው

ወጥመድ ዘርግቶ ያደባብኝን
ሞቴን ፈልጎ የነበረውን
ኢየሱስ በኃይሉ አዋረደው
ሴራውን አክሽፎ ከእኔ አራቀው
አልሆንለትም ጠላቴ አፈረ
ወጥመዱ ሲሰበር ሴራውን ከሸፈ
አምላኬ ኢየሱስ ብርቱ ኃያል ነው
መቼ ለጠላቴ ጊዜ ቦታ ሰጠው

አሁንም ተዋረድ እፈር ጠላቴ
ታያለህ ደግሞ ከብሮ አምላኬ
እኔ እንደሆን አልሞት በህይወት እኖራለሁ
ለአምላኬ ክብር ገና አዜማለሁ
እዘምራለሁ አሸበሽባለሁ
በጠላቴ አናት ላይ አሁንም እቆማለሁ
የአምላኬን ሰንደቅ ከፍ አድርግና
አውለበልባለሁ በአለም ዙሪያ

ክብርን የሚገባው የሚሰገድለት
ኢየሱስ አምላክ አለኝ የምዘምርለት
ለአንተ ወድቄ ፍጹም አልሰግድም
ወደ እሳት ብጣል ክብርን አልሰጥም
አምላኬ ኢየሱስ ኃያል አምላክ ነው
ከእቶን እሳት ሲያወጣ አይቻለሁ
እፈር ተዋረድ ተቃጠል ጠላቴ
አምላኬ ሲሰራ ሲጠቀም በእኔ

በአለም ሲኖር በምድር ስመላለስ
መስዬህ እንድሆን ወደ አንተ ምመለስ
እኔ የአለም የአንተም አይደለሁም
ልዩ ዜጋ ነኝ የሰማይ ሀገር ሰው
ሰማይ ቤት አለኝ በእጅ ያልተሰራ
በአባቴ ቤት ለእኔ መኖሪያ
በምድር የምኖረው በእንግድነት ነው
አትልፋ ጠላቴ እሩጫህ ከንቱ ነው
',0),(NULL,'ማሰማሪያህ ውኃ ዳር','fishbermul','ማሰማሪያህ ውሃ ዳር እጅግ ከጥም ያረካል
ደስ እያለኝ በቤትህ እኖራለሁ በእቅፍህ
የሱስ ፍጹም ደስታዬ መንፈስህ እርካታዬ
ለንሮዬ ጣዕም ነህ ለደስታዬ ምንጭ ነህ
ኢየሱስ ኢየሱስ ኢየሱስ አምላኬ ነህ ለእኔ
ጌታዬ ጌታዬ ጌታዬ ልቤ ያረፈብህ /2/

ነፍሴን ከሞት አዳንካት
በጥላህ እያኖርካት
በክብር አስቀመጥከኝ
በመዳፍህ አኖርከኝ
ብርቱ ነፋሳት ማዕበሉ
ሊያናውጡኝ አይችሉ
የወይኑን ግንድ ይዣለሁ
አልፈራም ለምን እፈራለሁ

ኢየሱስ .....

ያለ ስጋት ያኖረኝ
እንዳልወድቅ የሚያደርገኝ
ስምህ ለእኔ ምርኩዝ ነው
በስምህ እደገፋለሁ 
ይደንቀኛል ማዳንህ
ደስ ይለኛል ሳስብህ 
ትህትናህ ስቦኛል
ፍጹም ፍቅርህ ማርኮኛል

ኢየሱስ.....

ለሚሻል ኪዳን ዋስ ሆነህ
ከራስህ አስታረቅከኝ
ታላቅ መዳንን አገኘሁ
ልቤን በደስታህ ሞላኸው
ስራህ ግሩም ነው ይደንቃል
ፍጥረት ስለ አንተ ያወራል
ሁሉ ሲያልፍ አንተ አታልፍም
መንግስትህ ለዘለአለም

ኢየሱስ.....
',0),(NULL,'ኤልሻዳይ ነህ አንተ ተመስገን','fishbermul','ኤልሻዳይ ነህና ተመስገን
ሁሉን ቻይ ነህና ተመስገን
መሃሪ ነህና ተመስገን
ኢየሱስ ሆይ እያልኩኝ ልጥራህ
አንተ የፍቅር ጌታ ነህ /2/
በመከራ ላለ መቅሰፍት ለእደባበት
አይተህ ዝም አትልም አለህ ጉልበት
እጆችህን ከችግረኛ ዘንድ
አታርቅም ጥፋትን በመውደድ
ቶሎ ቶሎ ለማዳን በርትተህ
ትቆማለህ በድንቅ አሰራርህ

የኃይል ቃል ቃልህ ፍጹም ሰላም ሆኖ
ይገለጣል በክብር ድካምን አድሶ
በታምራት በምልክት ሁሉ በመታጀብ
ያው እንደ ልማድህ እረፍት እረፍት የሚል ሽታ ይዞ
ከአርያም ካንተ ዘንድ ታዞ

ምንም ቢሆን ምንም ኢየሱስ ካንተ ጋር
ያልተወጣ የለም የትኛውም ተራራ
ችለህ እንጂ መቼ አቅቶህ ነው
የከበደ ቀንበር የሰበርከው
አይዞህ አይዞህ የሚለው ደፍረትህ
ለበጎ ነው ታይቷል ለታመነው

ጎንበስ ደግሞ ቀና ኑሮ እስኪ ቃና
አምልኮን በፊትህ ሲያበዛ ምስጋና
ቅድስና ውበት ጌጥ አድርጎ
ራስህ በመግዛት ወደ እምነት ሰርጾ
ገባ ገባ ለድል ሽልማት ለሰዋዊት ስትሰጥ በረከት
',0),(NULL,'ፍቃድህ በሰማይ እንደሆነች በላይ','fishbermul','መልካም ነው የምትስራው ሁሉ ትክክል ነው
ጥበበኛ ሆኖ በእርግጥ ለአስትዋለው
የፍቃድህ ሚስጥር በርቶለት ለአየህ
በእውነት ጌታ ኢየሱስ በሁሉ አላማ አለህ
ዘገዩ የሚባሉ በአንተ ዘንድ የዘገዩ አይደሉም
ጊዜ አለው ለነገር አንዳቻውም ያለ አንተ አይሆኑም /2/

ፍቃድህ በምድር መልካሟ ሃሳብህ ትሁን /2/
ፍቃድህ በሰማይ እንደሆነች በላይ
  እንዲሁም በምድር /2/ ትሆን /2/ 2

የትላንቱ ኑሮ ዛሬም ቢለዋወጥ
እንዳልነበር ቢሆን ተስፋን እንደማስቆረጥ
በእርግጥ ለመልካም ነው መልካምም ለብርታት
ኃላ ለነፍስ እረፍት ያመጣል ኃይል ጉልበት
ታግሶ በመቆም በምድር ፍቃድ ላይ በሚሆነው
ማሸነፍ ይቻላል ኢየሱስ ሆይ መንገድህ ንጹህ ነው /2/

መንገድና ሃሳብህ ለምርጦች ልጆችህ
ሁሉ ለበጎ ነው ስትሰራ በፍቅርህ
ካላዘዝከው ምንም ነገር በእኛ ላይ
መሆን ከቶ አይችልም በምድርም በሰማይ
ታድያ ሁሉን ችለህ እያለህ እንዴት በአንተ ስራ
መግባት ይደፈራል ልኡል ሆይ ሰው ሁሉ አንትን ይፍራ /2/
',0),(NULL,'በበረከትና እና ምስጋናም ሁሉ ላይ','fishbermul','በበረከትና ምስጋናም ሁሉ ላይ
ከፍ ከፍ ያለው ስምህ ኢየሱስ ይባረክ /2/ አሜን
በበረከትና በምስጋናም ሁሉ ላይ
ከፍ ከፍ ያለው ክቡር ስምህ ይባርክ /2/ አሜን

በኃጢአት በበደል በሞት ጥላ ሆኜ
የሚረዳኝ ጠፍቶ አንድም ሰው ከጎኔ
ጌታ ኢየሱስ ደርሰህ በስም ታደግከኝ
ኃጢአት በደሌን ሞቴንም ሻርክልኝ
ኢየሱስ ከፍ በል ከብርህ ይሰፋ ጌታ
በስምህ ታድገህ አድነህኛል እና /2/

ዛሬ በመሰውያህ በፊትህ ቆሜአለሁ
ስምህን እየጠራሁ እባርከዋለሁ
ኢየሱስ ታላቅ ነህ ከሁሉ ትበልጣለህ
በሰማይ በምድርም ያሻህን ታደርጋለህ
ተው ባይ የለህ ከልካይ ሁሉን ትሰራለህ
በእኔን በእጅህ ስራ ሙሉ ስልጣን አለህ
ስምህን ትባርከው ከፍ ታደርገው ነፍሴ
ከሞት ስላዳንካት ኢየሱስ መድህኔ

ስምህ ጌታ ኢየሱስ የሚፈስ ዘይት ነው
መልካም መዓዛ ሽታ የተቀላቀለው
የጸና ግንብ ሆኖ ደግፎ ይዞኛል
ወደ እርሱ ስለሮጥኩ ከፍ ከፍ አርጎኛል
አለቱን ታምኜ ስምህ ላይ ቆሜለሁ
ጽኑ አለት መሰረት ሆኖ አግኝቼዋለሁ
ስምህ ጌታ ኢየሱስ ዘላለም ይባረክ
እስከ ዛሬ ይዞኝ በሕይወት ስለኖርኩ
',0),(NULL,'አምልኮ ያንስብሃል','fishbermul','ምስጋና/አምልኮ/ዝማሬ ሲያንስህ ነው ያንስብሃል
ያንሰሃል ያንስብሃል /2/ ኢየሱስ/ጌታ/ኢየሱስ
ሰላሜ ሰላሜ ነህ ለእኔ /2/
እረፍቴ እረፍቴ ነህ ለእኔ /2/
ጉልበቴ ጉልበቴ ነህ ለእኔ /2/

እጅግ ተስማምቶኛል ኑሮ ካንተ ጋራ
ሰላም/ሕይወት አትርፊአለሁ አንተን መከተሌ /2/
ገንዘብ የማይገዛው ሰላም በልቤ አለ
በአንተ ረክችአለሁ ኢየሱስ ደስታዬ ነህ

በተናቀው ነገር ብርቱውን ጥለሃል
የአለምን ጥበብ ከንቱ አድርገሃል
በተናቀው ነገር ብርቱውን ጥለሃል
የኃያሉን ጉልበት ከንቱ አድርገሃል
እሳቱ ቢመጨመር ፍሙ እያስፈራኝ
የማመልከው አምላክ ኢየሱስ ቻይ ነህ ልታድነኝ

ስምህ የጸና ግንብ ወደ አንተ እሮጣለሁ
አሳዳጄ/ጠላቴን እያየ ከፍ ከፍ እላለሁ /2/
የቃልህ ሰይፍ አለኝ ምሽግ እሰብራለሁ
ኃይሌ ታናሽ ቢሆን በአንተ በርታለሁ

በእቅፍህ ካለሁ ለምን እሰጋለሁ
በሕይወት እያለሁ ሰላሜ ብዙ ነው /2/
',0),(NULL,'የቀኑ ሃሩር አያቃጥለኝም','fishbermul','የቀኑ ሃሩር አያቃጥለኝም
የሌሊቱም ቁር አያሰጋኝም
በእርሱ ተማምኜ ተቀምጫለሁ
በክንፎቹ ስር ተሸሽጌአለሁ
አምላኬ ኢየሱስ የእኔ እድል ፈንታ
የዘለአለም አምባ ለነፍሴ እፎይታ /2/

የሱስ እርዳቴ መጠጊያዬም ነው
ሞቴን በሞቱ ሽሮ ነፍሴን የተቤዠው
የዘላለም መድህን የሕይወቴ ዋስትና
መልካሙ እረኛዬ ብቻውን ገናና /2/

እግሬን ለመናወጥ ለአደጋ አይሰጠኝም
ፈተናም ሲገጥመኝ ከእኔ አይለየኝም
መውጣት እና መግባቴን ኢየሱስ ይጠበቃል
መላእክቱን ስለእኔ ዘወትር ያዛቸዋል /2/

ጠላቴ ደስ ብሎት መረቡን ዘርግቶ
ረዳታ እንደሌለኝ ሊይዘኝ አድፍቶ
ኢየሱስ ሲደርስልኝ ወጥመዱን ሰባብሮ
የከበበኝ ሁሉ ተወግደ አሳፍሮ /2/

ልዑልን መመኪያዬ ተስፋ አድርጌዋለሁ
በቀንም በሌሊት ወደ እርሱ እጮሃለሁ
ክብሩንም በሩቅ በአይኔ ብቻ አያለሁ
ያዋጣኛል ኢየሱስ አጥብቄ ይዤዋለሁ /2/
',0),(NULL,'መኖር ፈቅጃለሁ በእቅፍህ','fishbermul','መኖር ፈቅጃለሁ በእቅፍህ
መራራው ህይወቴን አጣፈጠው ቃልህ
እንደ አንተ ለእኔ ኢየሱስ አላገኝም
የልቤ ወዳጅ ነህ እንድትርቀኝ አልወድም /2/

ለጊዜው ያለውን ክብር ሞገስ ትቶ
ተከተለህ ሙሴ ብድራቱን አይቶ
ለእኔንም ካቆምከኝ ካኖርከኝ በሕይወት
ሰው መሆን እሻለሁ ለጽድቅ ለበረከት

ፍቅርን ልትገልጽልኝ ስለእኔ ሞተሃል
ሁሉ በእጅህ እያለ የሌለው ሆነሃል
ካንተ ወዴት ልሂድ ኢየሱስ ነህ መድህኔ
የውስጤ አዋቂ ክብሩ ወዳጅ የኔ

ስቅበዘበዝ ሳለሁ አንተ ባታገኘኝ
በጨለማ ነበርኩ ተስፋም አልነበረኝ
ዛሬ ልከተልህ ሁሉን ልተውና
አለማ ሆነልኝ መንገዴ እንዲቀና

በሕይወቴ አንተን እኔ አረካለሁ
የመድሃኒት ጌታ አንተን አግኝቻለሁ
ለደስታዬ ምክንያት ለነፍሴ መጽናናት
ሃይሌን የምታድስ የህይወቴ ጉልበት

መሸሸጊያ የሆንከኝ በስምህ የጋረድከኝ
በመከራዬ ጊዜ የረዳኸኝ
ጌታዬና አምላኬ ክበርልኝ /4/
',0),(NULL,'የዘንባባ ዝንጣፊ','EbenzerM1','የዘንባባ ዝንጣፊ ይዘን
በከብሮ በእምብልታ ታጅበን
አፋችንን በምስጋና ሞልተን
እንገባለን ወደ መቅደስህ
  እንገባለን ወደ ማደሪያህ /2/

በጽዮን ውስጥ ላንተ ምስጋና ይቀርባል
ከነፍሳችን ፈቃድ አምልኮ ይገባሃል
የሱስ ራርተህልን ቀንበራችን ወድቆ
የከበደን ሸክም ክፉ ከኛ ርቆ
ደስታ ተሞልተን ዘንባባ ይዘን
እልል እያልን ልናመልክህ መጣን /2/

ነገስታት ሃያላን ፊትህ እየወደቁ
አንተን ያመልኩሃል እየተደነቁ
እኛም በተራችን ይህ እድል ገጥሞን
እንዘምራለን በመቅደስህ ገብተን
ጣናችንን ይዘን ከርቤ ጨምረን
 እንሰዋልሃለን መሰውያህን ዞረን /2/

የምድር ፉጡራን ስጋ ለባሽ ሁሉ
ለታላቅነትህ ክብራቸውን የጣሉ
ይገዘሉህ ጌታ መድህናችን የሱስ
ዝፋንህም ይድመቅ በህይወታችን ንገስ
ይግዛን መንፈስህ ለዘለአለም
   አፍቃሪ ወዳጅ እንዳንተ የለም /2/
',0),(NULL,'እነሆ ሰማይ','EbenzerM1','ሰማይ ዙፋንህ ነው ምድር የእግሪህ መርገጫ
ታላቅ ገናና ነህ የማይወስንህ ስፍራ
የሱስ ሆይ ክብርህን እኔም አይቻለሁ
ብርቱ ነህ አምላኬ እወድስሃለሁ

እነሆ ሰማይ ከሰማያት በላይ ያለው ሰማይ
ሊይዝህ የማይችል የአብረሃም አምላክ ሆይ
እኔ የሰራሁልህ ቤት ታድያ ምን ያህል ያንሰሃል
ለዘለአለም ክብር ሞገስ ላንተ ይሁን

ብቻህን ነግሰሃል በሰማይ በምድር
በሞገስ ተከበህ በዝና በክብር
የምስጋናን ዘውድ ተጭነህ ተቀምጠሃል
በረከት ሃይል ጥበብ ውዳሴ ይገባሃል

ዘመን የማይለውጥህ ጊዜ የማይሽርህ
በሰማይ ዙፋን ላይ ጸንተህ የምትኖር
ድካም የማያውቅ ሁሌም የበረታ
አልፋና ኦሜጋ የሱሴ ሃያል ነህ

ተራሮች ኮረብቶች በፊትህ ይዘላሉ
ፍጥረታት በሙሉ በመራድ ያመልካሉ
ወንዞች ሸሎቆዎች የሚያጨበጭቡልህ
ክብር ውሰድ ውዴ እኔም ልገዛልህ
',0),(NULL,'ስምህ መዳኛዬ ነው','EbenzerM1','ስምህ ከስሞች በላይ ነው የሱስ
ሃይልህ ከሃይላት በላይ ነው
ስምህ ከስሞች በላይ ነው
   ሃይልህ ከሃይላት በላይ ነው /2/

ከስም ሁሉ በላይ ታላቁን ስምህን
ከሃይላትም የሚበልጥ ገናናው ሃይልህን
ከመላእክት እጅግ የሚበልጥ ስምህን
ወርሰሃል ይዘሃል የሱስ ስልጣንህን

ስምህ ስምህ ስልጣን አለው ስምህ
ሃይልህ ሃይልህ ወደር የለው ሃይልህ
ሰማይም ምድርም ያሉ ፍጥረት ሁሉ
ለሚደንቀው ስምህ ይንበረከካሉ
ለመዳን የሚሆን የሚጠራ ስምህ
የሱስ እኮ ነው ለዘለአለም
ስምህ መዳኛዬ ስምህ መዳኛዬ /4/

ሽባ የሚተረትር እውሩን የሚያበራ
አንካሳ የሚያዘልል ታምር የሚሰራ
ለሰው ልጆች መዳን የተሰጠ ስምህ
ኢየሱስ ብቻ ነው ሌላ አዳኝ የለም

ስምህ ስምህ መድሃኒት ነው ስምህ
   ሃይልህ ሃይልህ ሁሉን ገዢው ሃይልህ /2/

ለሃጥያት ስርየት የሚገባ ስምህ
ለቅዱሱ መንፈስ ሙላት የሚሆን
በአለም ዙርያ ሁሉ የሚፈለግ የትም
ከየሱስ ስም በቀር ሌላ ስም የለም

ስምህ ስምህ ብቸኛ ነው ስምህ
ሃይልህ ሃይልህ ወሰን የለው ሃይልህ
በሰማይ በምድር ያሉ ፍጥረት ሁሉ
ለሚደንቀው ስምህ ይንበረከካሉ
ለመዳን የሚሆን የሚጠራ ስምህ
የሱስ እኮ ነው ለዘለአለም

ስምህ መዳኜ /4/
',0),(NULL,'ማን አለኝ','EbenzerM1','ኢየሱስን የሚመስለው ኧረ ማን ነው
መድሃኒቴን የሚተካው የትኛው ነው
በወጀቡ መሃል ለእርሱ መንገድ አለው
    በሞት ጥላም ብሄድ መታመኛዬ ነው  /2/

ማን አለኝ እንደ የሱሴ
    ማን አለኝ ኧረ እንደ የሱሴ /2/

አለኝ እኔ የምጽናናባት የምመካበት
ሁሉን የሚችል መደገፊያ የምደገፍበት
ነፍሴን ከሞት ጥፋት ያዳነ ጽኑ አምባዬ
የሱስ ሆኖ እኔ አርፌለሁ ማርፊያዬ /2/

የሰላም አምላክ ሰላሜ ነው ምን ያስፈራኛል
በእርሱ ጥላ እኖራለሁ ምን ያሰጋኛል
ሰቆቃዬን ከልቤ አርቆ ደስታን ይሞላ
አለኝ አምላክ የሚሆነኝ ጥላ ከለላ /2/

ጌታዬ ኢየሱስ የህይወቴ ተስፋ
የመዳኔ ትርጉም ከልቤ አልጠፋ
ተክሎኛል በቤቱ ህይወቱን ልኑረው
  ሌላ እኮ የለኝም ድጋፌ ህልም ነው /2/

ለዘወትር የሚሸከመኝ መቼ የማከዳኝ
መጎዳቴ የማይወድልኝ ሚንከባከበኝ
አለኝ ብዬ የምኮራበት ጋሻ መከታ
   ኢየሱስ ነው ለዘለአለም የኔ አለኝታ /2/
',0),(NULL,'ስሜ በሰማይ ነው','EbenzerM1','የምትማከተኝ ተሟጋች ስማ
የምትከሰኝ ከሳሼ ስማ
የማይበገር ተስፋ ያለኝ
   ከንቱ ነው ልፋትህ የምነጠቅ ነኝ /2/

ስሜ በሰማይ ነው /2/
አገሬ ሰማይ ነው /2/ 2

በሰማይ ነው /2/ ሰማይ ነው /2/

ለመጣል ብትጥር ጥራሽ ልትገድለኝ
ልታጠፋኝ ጓግተህ ገሃነብ ልትሰደኝ
አሳብህ ውጥንህ አልሰመረምና
እንግዲህ ምን ትሆን ስሜ ላይ ነውና

ምኞትህ ለኔ ቢሆን መጥፎ
ጌታዬ ከልሎኛል አቅፎ
የሚወስደኝ እስከ ውብ አገሬ
   ተስፋ ቁረጥ ወግድ ከመንደሬ /2/

እባብና ጊንጡን ርገጥ ተብያለሁ
የልጅነት ስልጣን ስሙን ታትሜያለሁ
ጠላቴ ልትረግመኝ ከቶ አትችልምና
እገባለሁ ጽዮን መርቆኛልና

መርገሜ ደሙ አንከባልሎ
በድካሜ መንፈሱ አይሎ
እደርሳለሁ የተስፋዬን ምድር
   የሱስ ሆኖ ለኔስ የእሳት ቅጥር /2/

ያስብከው አለማህ ቀረብህ ጠላቴ
ስለተቀየረ ህይወት ማንነቴ
ወደ ሰማይ ልበር ተዘጋጅቻለሁ
የቃል ኪዳን ልጅ ነኝ መንግስቱን ወርሳለሁ
',0),(NULL,'ሊመጣ ያለው','EbenzerM1','ሲገለጥ ተከብሮ ጽዮን
አጅበው መላእክት ሰፍረው
ኩሩቦች እየዘመሩ
ሱራፌል እየበረሩ
የእስራኤልን መጽናናት
ደመናዎች ከበውት
ይመጣል እንሄዳለን
አብረነው እንነግሳለን

ሊመጣ ያለው ይመጣል
ኢየሱስ ይገለጣል
በክብር አጅበው መላእክት
ከጽዮን ከተፍ ይላል
የወጉት ሁሉ ያዩታል
ዋይታቸውን ያቀልጡታል /2/

ቅዱሱ ከፋራን ተራራ
ይወርዳል ብርሃን እያበራ
ዘንዶውን ይበቀልልናል
ለርስቱ እኛን ይዋጀናል
እርሱን ነው የምንጠብቀው
አሻቅበንም የምንናየው
ብድራቱ ሊመልስልን
የህይወት አክሊል ሊሸልመን

ድቅድቅ ጨለማ አህዛብን
ጭጋግ ደማና አለምን
ሸፍነው ደፍነዋት ምድርን
በህውከት ሲተኩ ሰላምን

ሰይፍ ሲሳል ለጥፋት
ክፉውም ሲሮጥ ለውድቀት
እኛ ግን እናመልጣለን
ከእርሱ ጋር እንከብራለን

በሰማይ ትልቅ ደስታ ይሆናል
በምድርም እልልታ ይቀልጣል
አእዋፍት ይዘምራሉ
ቅዱሳን ሃሴት ያደርጋሉ

መለከቶች ሲነፉ
ሰዎችም ለፍርድ ሲሰለፉ
በእጣችን ከፊቱ እንቆማለን
በደስታ እንፈነጫለን
',0),(NULL,'ያልተደረሱ','EbenzerM1','ያልተደረሱ ያልተዳሰሱ
ያልተደረሱ ያልተዳሰሱ
አዳዲስ ምድሮችን እንደርሳለን
ለነፍሳት በቅናት እንሰብካለን
የመዳኑ ወንጌል እናውጃለን
አለምን በሙሉ እንወርሳለን /2/

በቅናቱ እሳት ተይዘን ወጥተናል
ወንጌሉን ለመስበክ ቆርጠን ተነስተናል
የሚያግደን የለም በፍጹም አንቆምም
ባቢሎን ሳትወድቅ እኛ አንመለስም

ማፍረሻ ይዘናል የቃሉን ሞዶሻ
ትእዛዝ ተሰጥቶናል ድንበሯን መውረሻ
የምን መዝለፍለፍ ነው የምንስ መዛል
የባቢሎንን ሰፈር ደርምሰን ሳንጥል /2/

ገና ብዙ አህዛብ ጎርፈው ይመጣሉ
እውነትም እግዚአብሔር አንድ ነው እያሉ
በጣኦት አምልኮ ከአማልክት ጋጋታ
ሲያርፉ እናያለን በጌቶቹ ጌታ

ኢዛቤል ጉድሽ ነው መጣንብሽ በቃ
መሰውያሽ እንዲፈርስ ዛቻሽ እንዲያበቃ
ነፍሳት እንዲያመልጡ ጣኦትሽን ጠልተው
የኤልያስ አምላክ የሱስ በርቶላቸው

ማፍረሻ ይዘናል የቃሉን ሞዶሻ
ትእዛዝ ተሰጥቶናል ጣኦትሽን ማፍረሻ
በዚያ ጨካኝ ሃይል በነ ኢዩ መንፈስ
ዛሬም ተነስተናል ስራሽን ለማፍረስ /2/

የስራው ጊዜ ነው ለእግዚአብሔር ሰአቱ
ምርኮ የሚያጎርፍበት የመከር ነው ወቅቱ
ጽዮን ደስ ይበልሽ አምላክሽ ተነስቷዋል
ምድሪቱን በፊትሽ አሳልፎ ሰጥቷል
',0),(NULL,'ስለ ጽዮን','EbenzerM1','ስለ ጽዮን ዝም አልልም
ስለ ዮሩሳሌም ጸጥ አልልም
ጽድቋ እንደ ጸዳል መዳኗ እንደ ፋና
ዝናዋ እንደ ናስ ሸላልሜ እስክ ወጣ ድረስ  /2/

አላት ኢየሱስ ህያው በሆነው ቃሉ
ማለላት ኢየሱስ በማይሻር ቃሉ  /2/

አታፍሪም እና አትፍሪ
አትዋረጂም እና አትደንግጪ
በጽድቅ ቀኝ እደግፍሻለሁ
እንዳትጠፊ እቆምልሽአለሁ /2/

የማታውቂውን ዘመን አመጣለሁ
ከለመንሽው በላይ አደርጋለሁ
ጽዮን ትውልድሽን እባርካለሁ
  ያልለመንሽውን በረከት አስገኝልሻለሁ /2/

ጥማትሽንም ከምንጬ አረካለሁ
ባዶነትሽን በነፍሳት እሞላለሁ
በሰው ልብ ያልታሰበውን እሰራለለሁ
  የክብሬን ጸዳል ባንቺ ላይ አበራለሁ /2/

በዙሪያሽ ባሉ ሁሉ ላይ ትነግሺያለሽ
በኮረብታዎችም ከፍ ብለሽ ትታያለሽ
ከሩቅ ነገስታት ክብርሽን ያመጣሉ
አህዛብ ደግሞ ዝናሽን ያወራሉ  /2/
',0),(NULL,'የሰራዊት አምላክ','EbenzerM1','የሰራዊት አምላክ አቤቱ መልሰን
ፊትህንም አብራ እኛም እንድናለን /2/ 2
በደልን ይቅር በል ስጋ ለባሾች ነን
ርስትህን አትጣ ለባእድ አትስጠን
ደምህን ተመልከት ለኛ ያፈሰስከውን
በመስቀል ላይ ሞተህ ዋጋ የከፈልከውን

በደምህ የተገኘን ቅዱስ ህዝቦችህ ነን
እባክህን የሱስ ሆይ ትተህ አትለፈን
ዘንበል በል ወደኛ በምህረት አይኖችህ
መልሰን ጌታ ሆይ ለምርኮ በጎችህ

በአንድ ተስፋ ድነን መንፈስህ ጠጥተን
በአንድ ሐይማኖት የቆምን ያንተው ልጆች ነን
ርስትህን ለመውረስ ለጽድቅ የተጠራን
የማይናወጥ መንግስት የተጠበቀልን

የኋለኛው ዝናብ መብረቅ እስኪሆን
እንተጋለን እኛ በአንድ ልብ ሆነን
የቀደመውን ፍቅር ያባቶቻችንን
እንሻለን አሁን አብራው ፊትህን
',0),(NULL,'እንደ ሙሴ','EbenzerM1','ባህርን የሚከፍል ሰንሰለትን የሚበጥስ
እሳት የሚያወርድ አባውን የሚያለብስ
ያ የነ ኤልያስ የነ ሙሴ የነብያት
መንፈሱ ይነሳ በአስራ አንደኛው ሰአት
በዚህ ዘመን        /2/

እንደ ሙሴ በትሩን ይዣለሁ
የአለምን ባህር እከፍላለሁ
እንደ ኤልያስ ተነስቻለሁ
የወንጌሉን እሳት አነዳለሁ /2/

እኔማ ባለሙሉ ስልጣን
እኔማ የጌታ/የኢየሱስ/ ልጅ ሆኜ
እኔማ እረማመዳለሁ
እኔማ ጸጋውን ይዣለሁ /2/

የነሲዳቅ የነሚሳቅ የአብዲናጎ አምላክ
የእሳቱን ብርታት ያጠፋህ ሃያሉ ኢየሱስ
ዛሬም እንደ ቀድሞ ዘመን በክብሩ ተስቷል
ያ የጥንቱ አንዱ አምላክ ሁሉንም ይወርሳል

ያኔ በወረደው መንፈስ ድንቃድንቅ ተደርጓል
በከተማ በገጠሩ ወንጌሉ ተስብከዋል
አሁን በዚህ ዘመን ደግሞ አገር ይወለዳል
የሙሴ በትር በእጄ ነው ባህር ይከፈላል

የመንፈስ ቅዱስ መብረቅ ከሰማይ እንዲወርድ
ሃይል ከላይ እንደ ዝናብ ወርዶ እንዲቀጣጠል
ወንጌሉ በአለም በርቶ ጨለማው እንዲገለጥ
የአባቶቼ አምላክ የሱስ ብቻውን ይመለክ
',0),(NULL,'የጸሎቴ መልስ','EbenzerM1','የጸሎቴ መልስ ቢዘገይ
ሁሉም እንደአሰብኩት ባይሳካ
ነገሬ ስምረት ባያገኝ
ምኞቴ በምሉ ባይሞላልኝ
‘ጠብቃለሁ ‘ጠብቃለሁ /3/
    ‘ጠብቃለሁ ደጁን እጠናለሁ   2

‘ጠብቃለሁ ‘ጠብቃለሁ
ደጁን  እጠናለሁ
ደጁን  እጠናለሁ
ለደካማው ብርታት ሃይል ከእርሱ ነው
ለተጠማም ህይወት እርካታ ቤቱ ነው
የመዳኔን አምላክ ተስፋ አደርገዋለሁ
ቢዘገይም እንኳን እርሱ እጠብቃለሁ
ቢዘገይም የሱስ ቤቱን እቆያለሁ

ዘወትር ሳልደክም አምላኬ ሆይ እያልኩ
ሌተቀንም ሳላርፍ ሁልጊዜም እንደጮህክ
ምንም መልስ ባጥ አንዳችም ባላገኝ
እኔስ እቆያለሁ አምላኬ እስኪያየኝ
እኔስ እቆያለሁ የሱስ እስኪጎበኘኝ

ያቀድኩት እቅዴ ውጥኔ በሙሉ
ያለምኩትም ህልሜ ያሰብኩትም ሁሉ
ፈጽሞ ባይረባኝ ብኩን ሆኖ ቢቀር
እኔን አይለየኝም ከየሱሴ ፍቅር
እኔን አይለየኝም ካ‘ንዱ አምላኬ ፍቅር

እወደዋለሁ የኔን ጌታ
አከብረዋለሁ ሁሌ በእልልታ
ወድጄውአለሁ ለዘለአለም
ህይወት የሆነኝ እንደ እርሱ የለም /2/ 3
',0),(NULL,'ድል ነሳ','EbenzerM1','ድል ነሳ የይሁዳ አንበሳ
ድል ነሳ የሱስ ተነሳ
መቃብሩን ፈነቃቀለው
   ድንጋዩን አንከባለለው /2/

የሰይጣን ሃሳብ እቅዱ ግምቱ
እኛን የራሱ ሊያደርግ የቤቱ
ነው እና ሴራው ምኞት ብልሃቱ
በትንሳኤው ሃይል ተረፍን በሞቱ
ድል ነሳ ድል ነሳ ድል ነሳ
የይሁዳ አንበሳ

ሞት ሆይ መውጊያህ ኧረ ወዴት ነው
ሲኦል ዛቻህ ወዴት አረግከው
ሞትን የሚውጥ የጽዮን ጀግና
ጌታ ኢየሱስ ተነስቷልና
ድል ነሳ ድል ነሳ ድል ነሳ
የይሁዳ አንበሳ

ሞት ይይዘው ዘንድ ከቶ አልቻለም
የጨለማው ሃይል አላጨለመው
በቀለበቶች ፍጹም ቢታተም
የትንሳኤው ሃይል ረታ ሁሉንም
ድል ነሳ ድል ነሳ ድል ነሳ
',0),(NULL,'እኔማ ምን አለኝ','EbenzerM1','አንተ ነው የሰጠኸኝ ቃልና ዜማውን
አንተው ነህ የቀባኸኝ ቅዱስ ቅባትህን
አንተ ነው ያስታጠክከኝ የወንጌል እውነትህ
አንተ ነው የመራኸኝ የብርሃን መንገድህ

እኔማ ምን አለኝ /የሱስ/አባ /4/
ሁሉ ካንተ ሆኖ
ረክቻለሁኝ /3/  2

የሱሴ ብትወደኝ ነው ለዚህ መታደሌ
ከአለም ተለይቼ ለክብርህ መዋሌ
በሰማዩ ስፍራ አብሬህ መኖሬ
ከምኔም አይደለም ሞገሴና ክብሬ

ማንም ባይገምተኝ እዚህ ይደርሳል ብሎ
ተጥዬ ብቆይም ገና ያኔ ድሮ
ስፍራ እንኳን ባይኖረኝ ሳልታሰብ ብቀር
ታውቀኝ ነበር ለካስ ልታበቃኝ ለክብር

ታሪክን የምትለውጥ ድንቅን የምትሰራ
ፍጽሙም የማትዋሽ ቃልህን የምታበራ
የታመንከውን ልኡል ለምስኪን ምትራራ
ልጅህ አደረግከኝ አቤት ያንተ ስራ
',0),(NULL,'ገነነ ምህረቱ','Elfu3','ገነነ ምህረቱ በኔ ላይ  /2/
ገነነ ምህረቱ በኔ ላይ  /2/
በዛልኝ ምህረቱ በኔ ላይ  /2/
 በዛልኝ ምህረቱ በኔ ላይ /2/ 
አስደናቂ ፍቅሩን ሊያሳይ  
ገነነ ምህረቱ በኔ ላይ  /3/
ደካማን ማገዙ ሊያሳይ  
ገነነ ምህረቱ በኔ ላይ /3/
በመከራውም ቀን አምላኩ የሰማው 
የያቆብ አምላክ ስሙ ያቆምው 
ማነው አረ እንደኔ ምህረት የበዛለት 
በሃጢያቱ ፋንታ ፍቅሩ የመጣለት 

በቸርነት አመታትን ያቀዳጀ
ከሃጢያቴ በደሙ ሀይል እየዋጀ
ያቆመኝ አምላክ ትልቅ
የረዳኝ አምላክ ትልቅ
የያዘኝ አምላክ ትልቅ ኦሆሆ ትልቅ

አበዛው ምህረቱን በኔ ላይ 2
አበዛው ምህረቱን በኔ ላይ 2
አበዛው ፍቅሩን በኔ ላይ 2
አበዛው ፍቅሩን በኔ ላይ 2

አስደናቂ ፍቅሩን ሊያሳይ አበዛው ምህረቱን በኔ ላይ 
አበዛው ምህረቱን በኔ ላይ 2
ደካማን ማገዙ ሊያሳይ አበዛው ፍቅሩን በኔ ላይ 
አበዛው ፍቅሩን በኔ ላይ 2

ከጽዮንም ጠናሁ እረዴት ተላከ
በምድረ በዳዬ ምህረት ተሰበከ
የደረቀው በትር አቆጠቆጠና 
ካሉት ጋር እንዳለ የሱስ ቆጠረና
 
በቸርነት አመታትን ያቀዳጀ
ከሃጢያቴ በደሙ ሀይል እየዋጀ
ያቆመኝ አምላክ ትልቅ
የረዳኝ አምላክ ትልቅ
የያዘኝ አምላክ ትልቅ ኦሆሆ ትልቅ
ክፉ እንዳይመጣ ተከለከለና
በየሱስ ብርቱ ስም ታዞ ተገዛና
በምትኩ ሂወት ተፈቀደለት 
ሰላምና ደስታ መጣ ወደኔ ቤት

በቸርነት አመታትን ያቀዳጀ
ከሃጢያቴ በደሙ ሀይል እየዋጀ
ያቆመኝ አምላክ ትልቅ
የረዳኝ አምላክ ትልቅ
የያዘኝ አምላክ ትልቅ ኦሆሆ ትልቅ
',0),(NULL,'አለው ሕዝብ እግዚአብሔር','Elfu3','አለው ሕዝብ እግዚአብሔር-አለው 
 አለው ሕዝብ እግዚአብሔር-አለው 
የኔ የሚለው 
በደሙ የገዛው
 አለው ሕዝብ እግዚአብሔር-አለው

በዋዘኞች ወንበር የማይቀመጥ
ወንጌሉን በምንም የማይሸቃቅጥ
ጨለማ አስጨልሞ በድፍረት የምንድ 
ሀጥያትን በጭራሽ የማያበባብል

አለው ሕዝብ እግዚአብሔር /4/
አለው ሕዝብ አለው ሕዝብ /2/
 አለው ሕዝብ እግዚአብሔር /4/

በሬ ለምለሙን ሳር እንደሚጨርስ
የጠላቱን ደጃፍ በድል የሚወርስ
አላማ የያዘ ታላቅ ሰራዊት
በአምላኩ የሚጓደድ በጠላቱ ፊት

የሱስ የተበዠው አፍስሶ ደሙን
ያየው ዘር ይኸ ነው ከነፍሱ ድካም
ታላቁ እግዚአብሔር ነውና እድል ፈንታ
በተስፋ የሚጠብቅ የመዳኑን ጌታ
',0),(NULL,'እኔ ነኝ','Elfu3','እኔ ነኝ ህይወት - አለ ኢየሱስ
እኔ ነኝ መንገድ - አለ 
እኔ ነኝ እውነት - አለ ኢየሱስ
እኔ ነኝ ሰላም - አለ

ወደ እርሱ የሚመጣ - ማንም የተጠማ
በፍቅሩ ይረካል - ላይኖር በጨለማ
ይታወጅ ለፍጠረት - የሰላም
የዘለአለም ሕይወት - ይዟልና በእጁ
ይዟልና በእጁ /4/

ተጨንቃ የነበረችውን ነፍስ አይሆንባትም ጨለማ
ኢየሱስ ሕይወት ይዞ መጥቷል ድምጹን ለሚሰማ

አንተ ሸክም የከበደህ ና ይለሀል ሊያሳርፍህ
በደጅ ቆሞ ያንኳኳል ብትከፍትለት ይገባል
',0),(NULL,'በዙፋንህ ተቀምጠሃል','Elfu3','ኦ በዙፋንህ በማደሪያህ ተቀምጠሃል
ኦ ማህተሙን ትፈታ ዘንድ ይገበሃል
ኦ በዙፋንህ በማደሪያህ ተቀምጠሃል
ኦ መጽሀፉን ትወስድ ዘንድ ይገበሃል

ይገበሃል ይገበሃል ይገበሃል ይገበሃል /2/

ስምህ ለዘለአለም አለም
ይባረካል በቀን በቀን
ትውልድ አለም የሚያወራው
ዘመናት የማያስረጀው

የመንግስትህ ግርማ ክብር
የጸና ነው ለዘለአለም
በሞጎስህ የምታስፈራ
ያከብርሃል የእጅህ ስራ

ታላላቆች ታናናሾች
ባርያዎችህ የሚፈሩህ
በሰማያት በዙፋንህ
ኢየሱስ አንተን ሲያከብሩ

ሀሌሉያ ክብርህ ይብዛ
ንገስ ሁሉን የምትገዛ
ትልቁን ሃይል ይዘሃል
ይገበሃል ታርድሃል

የወደቁ ተነስተዋል
የደከሙ በርትተዋል
ላቃተው ሆንከው ምርኩስ
ተማማነ አንተን ሲይዝ

ለሰው ሁሉ የተናቀ
ግን በደዌ የደቀቀ
የፍቅርህን ስፋት ጥልቀት
ማን ሊገልጸው በምን ቃላት
',0),(NULL,'ተራራው ዝቅ ይበል','Elfu3','ተራራው ዝቅ ይበል ስርጓጎጡ ይሙላ
የልቤን ሰገነት ለየሱስ እንዲመች
ተራራው ዝቅ ይበል ስርጓጎጡ ይሙላ
ልቤ እና ህይወቴ ላንተ እንዲመች

የተቀመጥኩበት የክብሬ ወንበር
አያስፈልገኝም በቃ ይሰበር
የተቀመጥኩበት የክብሬ ወንበር
አያስፈልገኝም አሁን ይሰበር
አሁን ይሰበር በቃ ይሰበር
አሁን ይሰበር በቃ ይሰበር

የቁጣ ልጅ ነበርኩ ከፈጣጠሬ
አምላኬ ወደኸኝ አከበርከኝ ዛሬ
የንግስና ልብሴን ክብሬንም አውልቄ
እሰግድልሃለሁ በፊትህ ወድቄ

ወረድ ልበል ካለሁበት
ለሚገባ ክብር ስግደት
በዙፋንህ ለተቀመጥከው
እኔ እሰግዳለሁ

የሱስ ግባ ወደ ገነቴ
ሁሌ ላንተ ክፍት ነው ቤቴ
እንዲያምርልህ የልቤ አዳራሽ
ና የኔ ፈዋሽ

ተንዶ ይውረድ የልቤ ተራራ
በትህትና ስሄድ እኔም ካንተ ጋራ
በምትሰራበት ቀን ገንዘብህ እሆናለሁ
ምስክርህ ሆኜ ስራህን አወራለሁ

መንገዴ በፊትህ እስትንፋሴ በእጅህ
ልቤን ለውጥና ለክብርህ አበጃጀህ
ከመስዋእት ይልቅ ከሰባውም አውራ
መገኘት ደስታ ነው ከህዝብህ ጋራ
',0),(NULL,'አለም ሳይፈጠር','Elfu3','ገና አለም ሳይፈጠር
ያሰብክልኝ ያየህልኝ ይሄ ነበር
አስገረመኝ መውደድህ 
ኧረ እንዴት ብዬ የሱስ ላክብርህ

 ኧረ እንዴት ብዬ ላክብርህ /2/
 ኧረ ምንስ ብዬ ላክብርህ /2/

ከጨለማ ወደ ሚደነቅ ብርሃን ስትጠራኝ
አለም ሳይፈጠር ነበር ያኔ ያወቅከኝ
ያየኽልኝ ልኖረው ያለውን ታላቅ ተስፋ
ድንቅ መዳን አግኝቼአለሁ ባንተ ክብርህ ይስፋ

ገብቻለሁ በእውነተኛው በር
ላልናወጥ ላልደናገር
ከምሰማው አይኔ ከሚያየው
ሕይወት ማለት ለኔ የሱስ ነው /2/

በስምህ የሐጥያቴን ስርየት ስቀበል
ለርስትህ ተከፋይ አድርገህ ስትጠራኝ
ይገርመኛል መመረጤ መታሰቤ ባንተ ፍቅር
አይገባኝም ነበረ ለኔ ይሄ ክብር

አረ እንዴት ብዬ ላክብርህ /2/
 አረ ምንስ ብዬ ላክብርህ /2/
',0),(NULL,'ይኸው መታሰቢያ','Elfu3','ይኸው መታሰብያ ለምህረቱ
በህይወቴ በዝተዋል ደግነቱ
ንጉሴ ኢየሱስ ደስ ይበለው
ልቤንም በፊቱ አፈሳለሁ
 ንጉሴ ኢየሱስ ደስ ይበለው 
የለኝም ለእርሱ ምሰስተው

ላምጣለት ቅኔ ላብዛ ምስጋና
አምላክ ነውና
ጌታ ነው ክብር የሚገባው
የማመልከው /2/
ጌታ ነው /4/ ጌታ ነው /4/

ከሃጥያተኞች ሳለሁ አንደኛ
ግን የሚወደኝ አገኘሁና
ነፍሱ ተይዛ በነፍሴ ፍቅር
ተበዥኝ የሱስ ቆምኩኝ በክብር
 ነፍሱ ተይዛ በነፍሴ ፍቅር
ተበዥኝ የሱስ ቆምኩኝ በክብር

ያ የገዘፈው ተራራዬ
ተንዶ ወድቋል በጌታዬ
ያ የገዘፈው ተራራዬ
ተንዶ ወድቋል በጌታዬ
ቀና ብያለሁ በምስጋና
እቀኛለሁኝ በበገና
 ቀና ብያለሁ በምስጋና
እቀኛለሁኝ በበገና

ኦሆ በበገና /3/ 
አምላክ ነውና
ኦሆ በበገና /3/
 ጌታ ነውና

ጉዙፍ ቀንበሬ ሰባብሮ ጣለው
እውነትም የሱስ የኔ ጌታ ነው
እኔና ቤቴ እሱን መረጥን
ደግነቱንም ስላበዛልን
 እኔና ቤቴ እሱን መረጥን
ደግነቱንም ስላበዛልን

መስማት በጀሮ ሰምቼ ነበር
ስለ ኢየሱስ ብዙ ሲነገር
ሁሉን ያደርግ ዘንድ እንደሚቻለው
ዛሬ ግን በአይኔ እኔ አይቻለሁ
 ሁሉን ያደርግ ዘንድ እንደሚቻለው
ዛሬ ግን በአይኔ እኔ አይቻለሁ

ኦሆ በበገና /3/ አምላክ ነውና
ኦሆ በበገና /3/ ጌታ ነውና
',0),(NULL,'አምንሃለሁ','Elfu3','አላምንም ሃሳቤን 
አላምንም ስጋዬን 
አላምንም ፈቃዴን 
   አላምንም ምኞቴን /2/

የአብርሃም አምላክ አምንሃለሁ
የይስሃቅ አምላክ አምንሃለሁ
የያእቆብ አምላክ አምንሃለሁ
  የአባቶቼን አምላክ አምንሃለሁ /2/

እኔ አምንሃለሁ /3/ 
አምንሃለሁ አምንሃለሁ 
እኔ አምንሃለሁ /3/ 
አምንሃለሁ አምንሃለሁ

እጣ ያማረ ገመድ ወደቀ በክብር ቦታ
ተጓደድኩብህ ተመካሁብህ የኔ ጌታ
ወዳጅ ሆንክልኝ ፍጻሜ ተስፋ የማገኝበት
በእኔነቴ ላይ ዘለአለም ክበር ንገስበት

አምላክነትህን እያደናነቁ  ኦሆ ሆ
የተስፋ ቃልህን ጸንተው የጠበቁ  ኦሆ ሆ
አሸናፊ ሆነው በድል አልፎዋል ኦሆ ሆ
ፍጻሜቸውን ከሩቅ አይተዋል  ኦሆ ሆ

ሰማይ ከምድር ከፍ ከፍ ብሎ እንደሚርቅ
የሱስ ሃሳብህ እጅግ እሩቅ ነው ከሃሳቤ ይልቅ
ተደላድዬ በፈቃድህም እኖራለሁ
የሱስ አምላክ ነህ ሳልጠራጠር አምንሃለሁ

እንደ ቀደምት እንደ አባቶቼ  ኦሆ ሆ
የእምነቴን እራስ አንተን ተመልክቼ ኦሆ ሆ
ውስጤ እየታደሰ ዘወትር በመንፈስህ ኦሆ ሆ
ጉዞ ጀምሬአለሁ ወደ አንተ መቅደስ ኦሆ ሆ

ገና አለማት ሳይፈጠሩ ያሰብከኝ
ላልሰናከል በጽኑ አለት ያቆምከኝ
ስለዚህ ባንተ ታምኜ አልፈራም እላለሁ
ከምንጮችህም በደስታ ውሃ እቀዳለሁ

ምንም ነገር የለም ከኔ የሰወርከው ኦሆ ሆ
የሰማዩን ብርሃን በልቤ አበራኸው ኦሆ ሆ
የተደገፍኩብህ ጽኑ መሰረቴ ኦሆ ሆ
በደምህ ታጥሬ እኖራለሁ በእረፍትህ ኦሆ ሆ
',0),(NULL,'ሀይልህ ብዙ ነው','Elfu3','ሃይልህ ብዙ ነው ጠላት ቢዋሽም
ስራህ ግሩም ነው አትሳሳትም
በምድር ሆነ በሰማይ
የሱስ ብቻ የበላይ
በምድር ሆነ በሰማይ
የሱስ ብቻ የበላይ

ግሩሙን ትልቁን ሃይል ይዘህ
የምትኖር በዙፋንህ ጸንተህ
ምትገዛ ሃይላትን ስልጣናትን
በደምህ የዋጀህ ሕዝብህን
ስምህም ለጠላቶችህ
ሲገለጠ ሃያሉ ክንድህ

የማያከብርህ የማይፈራህ ማን ነው
ኢየሱስ ሞገስህ ልዩ ነው  /2/

አምላክ ቢባል አምላክ
ጌታ ቢባል ጌታ
ንጉስ ቢባል ንጉስ
የእኔ ኢየሱስ ግሩም ድንቅ
ጠላትንም የሚያደቅ
ብርቱ ሃያል ነው ገናና
  ክብር ለእርሱ ምስጋና  /2/*

ግሩም ነህ ከሰው ልጆች ይልቅ
በምክርህ ሁሌ የምታስደንቅ
አንዳችም የማይታጣህ
በብርታት እና በሃይልህ
የፍጥረት ጅማሬ መድረሻ
መጀመሪያ እና መጨረሻ
መላእክት ቀንና ሌሊት
አይደክሙም ሲያመጡ ስግደት /2/
',0),(NULL,'ተነስ በገና','Elfu3','ለሉኡል የዜማ እቃዬን አነሳለሁ
ለንጉስ የዜማ እቃዬን አነሳለሁ
ተነስ ማሲንቆ ኦ ሆ
ተነስ በገና  ኦ ሆ
ልዘምርለት አዲስ ምስጋና /2/

ምስጋና ምስጋና ኦ ሆ 
ይሽተት ማደሪያው ኦ ሆ
ሰርክ ከመስዋእት ኦ ሆ
ያርግ አምልኮው  ኦ ሆ
ቢዘመር ቢዘመር ኦ ሆ
የማይልቅ ውለታ ኦ ሆ
ዘለአለም ይኖራል ኦ ሆ
   የንጉስ እልልታ  ኦ ሆ /2/

ልሰዋ ምስጋና ኦ ሆ
ልቀኝለት ቅኔ ኦ ሆ
እሱን በመባረክ ኦ ሆ
ይለፍ ዘመኔ ኦ ሆ

ለሞገስ ለክብሩ ኦ ሆ
ለታላቅነቱ  ኦ ሆ
ይገባዋል ስግደት ኦ ሆ
ለአምላክነቱ ኦ ሆ /2/

የንጉስ ምስጋና የንጉስ ክብር
የንጉስ እልልታ የንጉስ መዝሙር /4/
በላይ በላዩ ላይ እስኪ ልጨምር
ደግሜ ደግሜ እስኪ ልጨምር
',0),(NULL,'የማይመቸውን','Elfu3','የማይመቸውን ይመቻል ብሎ
የማይገባውን ይገባዋል ብሎ
የማይሆነውንም ይሆናል ብሎ
የማይበቃውንም ይበቃል ብሎ
የሚጠራ በማዳኑ
አለ በዙፋኑ

ሰው ፊትን ያያል እግዚአብሔር ልብን
አሻግሮ ያየዋል ያውቃል ነገውን
ኢየሱስ ሲፈቅድ እሱ ሲያይማ
አሳዳጁ ይሆናል የወንጌል አርበኛ

ከፍ ያሉትን ዝቅ ያደርጋል
ዝቅ ያሉትን ከፍ ያደርጋል
እግዚአብሔር እግዚአብሔር ነው
   ፍርዱ ሁሌ ጽድቅ እውነት ነው /2/

አሰራሩ ግሩም ድንቅ አደራረጉ
እርሱን የመረጡ በፍጹም አይሰጉ
ለክብሩ መንግስት ልጆች ሊሆኑለት
እራሱ ይመርጣል ማንም አይመርጥለት

ካለመኖር ወደ መኖር
ካልነበረ ወደ ነበር
ሕይወት ሰጥቶ ማሻገር
ይህ ነው ድንቁ እግዚአብሔር

ርቀው የነበሩ ዝሬ ግን ቀርበዋል
ተጥለው የነበሩ ዛሬ ተነስተዋል
የሱስ በመንፈሱ ያሰማመረው
የሚያገለግለው ሰራዊት አለው
',0),(NULL,'በይ በርቺ','Elfu3','በይ በርቺ በርቺ ነፍሴ በርችልኝ /4/
የሚያደክመው አያድክምሽ
የሚጎትተው አይጎትትሽ
የዘራሽውን የምታጭዲበት
የፈለግሽውን የምታይበት
ጊዜው ደርሰአል

የጥፋቱ ጽዋ ሞላ እና ፈሰሰ
ፍጥረት በምድር ላይ እጅግ ረከሰ
አንቺ ግን ከአምላክሽ ከኢየሱስ ተስማሚ
ስፍራሽን ሳትለቂ በእምነትም ቁሚ /2/

ያ የተናቅሽበት ዘመን ሊያልፍ ነው
የጠበቅሽውንም ልትገናኝው  /2/

ማራናታ አንተ የነፍሴ ጌታ
ማራናታ አንተ የእኔ ጌታ
                 ቶሎ ና                      /2/

ለኢየሱስ ሙሽራ የተዋብሽ ሆነሽ
ልብስሽን በደሙ አጥበሽ አንጽተሽ
ሀዘን ቢሆን ጩኸት ወይ ደግሞ ስቃይ
ከእንግዲህ አይሆንም ነፍሴ ቀና በይ /2/

ስትዝዪ ሲደክምሽ ኑሮ ሲከብድሽ
ጌታዬ ወይ ናልኝ ማራናታ እንዳልሽ
አንቺም እንደ ቸኮልሽው አምላክሽ ቸኩሏል
ወደ እረፍት ሊወስድሽ ሊያሳርፍሽ ጓግቷል /2/*

በርቺ አሁን ነፍሴ ቀኑ ደረሰልሽ
በመላእክት ታጅቦ ኢየሱስ ሊመጣልሽ/2/*
',0),(NULL,'ሙሽራ ሙሽሪት','Gedion3','እንኳን ደስ ያላችሁ /4/
ሙሽራ ሙሽሪት /4/
እንኳን ደስ ያላችሁ ደስ ያላችሁ /2/
ለቅዱስ ጋብቻ ያበቃችሁ
እንኳን ደስ ያላችሁ ደስ ያላችሁ /2
እግዚአብሔር ቤት የሰራላችሁ

አሸብሽቡለት
ተባረክ በሉት
     እልልታ ስጡት /2/*

1. ከጠላታችሁ ቀስት አመለጣችሁ
ተሰበረ ወጥመድ ደስ ይበላችሁ
ሐዘን መከራችሁ ተረሳ ዛሬ
ነፍሳችሁ ትላለች እልልታ ዝማሬ

2. አንድ አደረጋችሁ ማን ሊለያችሁ
ቤታችሁን ሰራው አይፍረስባችሁ
ጣልቃ የሚገባው እርሱ ብቻ ነው
ያውም ሊያቆነጀው ሊያሰማምረው

3. እዚህ ያደረስከን ኧረ እኛ ማነን
ማዕረግ አሳየኸን ስለወደድከን
በሉ አሸብሽቡ ይብዛለት ምስጋና
ኢየሱስ ከፍ ሊል ይገባዋልና

ኢየሱስ ከፍ ይበል /4/
',0),(NULL,'እንኳን አመለኩት','Gedion3','ቤቴን ሰራው አሳምሮት
ብዬ እዘምራለሁ ምን ተስኖት /2/*

እውነትም ምን ተስኖት
ኧረ እንኳን አመለኩት
እንኳንም አመለኩት /2/*

ምን ተስኖት ከስንቱ ሞት አውጥቶኝ
ምን ተስኖት እንድኖር ፈቀደልኝ
ምን ተስኖት እስከዚህ አራመደኝ
ምን ተስኖት ከፍ አድርጎ አቆመኝ

ምን ተስኖት ጀምሮት ራሱ ጨረሰው
ምን ተስኖት እንዳለኝ ለብቻው ሰራው
ምን ተስኖት ትልቁን ትንሽ አረገው
ምን ተስኖት አቅሙን ልኩን ነገረው

ምን ይሳነዋል ምን ያቅተዋል /2/

ምን ተስኖት ይችላል ብዬ ሳመልከው
ምን ተስኖት ስኮራበት ቆይቻለሁ
ምን ተስኖት ሁሉ አምሮ አይቻለው
ምን ተስኖት ዛሬ ብዙ አወራለው

የለም ሚሳነው የሚያስቸግረው /2/
',0),(NULL,'እልል','Gedion3','እልል እልል እልል /4/
በጋብቻችሁ ከበረ ጌታ
ይዘመርለት ይድመቅ እልልታ /2/

እግዚአብሔር አምላክ ቤታችሁን ሰርቶት
አሳረፋችሁ ጸጋውን ልኮት
መልካም በማድረግ የሚመስለው የለም /2/*
በጎ ስጦታ አያልቅበትም

ተራራው ሜዳ ሆኖ ደልዳላ
ተራመዳችሁ በድል ጎዳና
ሰባራው ጌታ ከፊት ወጣና
አንደበታችሁ አለ ምስጋና /2/*
እልል እልል እልል /4/

ምስክር ሆኖ ሃያሉ ጌታ
ቃል ኪዳናችሁ እንዳይፈታ
አጸናላችሁ አንድ አረጋችሁ
ሰላማችሁን ወደደላችሁ /2/*
እልል እልል እልል /4/
',0),(NULL,'ሰማን','Gedion3','የወንድ ሙሽራና የሴት ሙሽራ ድምጽ
ሰማን በቤተክርስቲያን
የብዙ ደስታና የብዙ እልልታ ድምጽ
ሰማን በቤተክርስቲያን
እንዲህ የባረክኸን ክበር እግዚአብሔር
እንግዲህ ያሳመርከን ንገስ እግዚአብሔር /2/

ስለበዛ የልጆችህ ሰላም
በየቀኑ እልልታ ይሰማል
እኛም ይኸው ደስ ደስ ብሎን
ለስጦታ ክብር አመጣን

ክብር አመጣን አመጣን አመጣን /2/

ያኔ ድሮ አልቅሰን ነበር
ጎበኘኸን አንተ እግዚአብሔር
ሙሹራና ሙሹሪት ቆመዋል
በምስጋና መቅደስ ተውቧል

መቅደስህ ተውቧል እጅግ ደምቋል /2/

ለሰው ልጆች ካረከው በጎነት
መች ጎደለን ስንኖር በአንተ ቤት
ቅባትህን ስትጨምርበት
ህይወታችን እንዲህ አማረበት

እንዲህ አማረበት አማረበት አማረበት /2/
',0),(NULL,'ደምግባት ሐሰት','Gedion3','ደምግባት ሐሰት
ሐሰት /2/
ከንቱ ውበት
ውበት /2/
እግዚአብሔርን የምትፈራ ሴት
እርሷ ምስጉን ናት /2/*

ብልህ ሴት ማን ያገኛታል
ውድ ናት ልብ ያርፍባታል
ለባልዋ ዘውድ ኩራት ናት
አያፍርም ሞገስ ስላላት

ቆንጆና ውበትም ጠፊ
ጤዛ ነው ቶሎ ረጋፊ
መልካም ሴት መልካም ጓደኛ
በለጠች ልብ አላትና

ፈጣሪ ጌታን ማክበር
የህይወት ልዩ ምስጢር
ጥበብ ነው ትልቅ መዝገብ
ትርፍ ነው ከኖሩበት
ቤት ንብረት በውርስ ይገኛል
ከአባቶች ይተላለፋል
የመንፈስ የልብን ክፍተት 2/
ቁሳቁስ አይችልም መሙላት
',0),(NULL,'ቤቱን አደመቀው','Gedion3','ቤቱን አደመቀው ክብርህ /4/
ጨለማዬን አባረረው ብርሃንህ

ባገኘሁት በእጄ ባለኝ
በሰጠኸኝ እርፍ አልኩኝ
ባልበላ እንኳ እጠግባለሁ
አይጠማኝም እረካለሁ

ገንዘብና ወርቅ አልማዝ
አቃታቸው ሰው ማገዝ
ክብርህ ብቻ ሲመጣ ነው
ምስጢር ሁሉ ሚገለጠው

አላሳንስም ዝማሬዬን
አላሳንስም ሽብሸባዬን
አላሳንስም አምልኮዬን
አላሳንስም እልልታዬን /2/*
እዘምራለሁ ልቤ ጨካኝ ነው

ገና ገና አመልከዋለሁ
ልቤ ጨካኝ ነው /4/
አመልከዋለሁ
',0),(NULL,'እንግዳው ተዓምረኛ','Gedion3','እርሱን መስሎን እድምተኛ
ቆጠርነው ከሰው ተራ
ጠራነው እንዲመጣ
የሚጠጣው አለቀና
ስንረበሽ አየንና
አዲስ ታሪክ አሳየና

እንግዳው ተአምረኛ
አይደለም እድምተኛ
ኢየሱስ ተዓምረኛ /2/*
አይደለም እድምተኛ

ውሃውን ቀየረው ስናይ እኛ
ምን እንዳረገበት ብቻ እንጃ
በጣም ይጣፍጣል ስንጠጣው
ይህንን ችሎታ ከየት አመጣው

እንደዚህ ያለ ተዓምረኛ
እንዴት ይቆጠራል ከሰው ተራ
እጅግ የከበረ የተፈራ
በጨላለመበት የሚያበራ

ከሰዎች ጋር ተቀላቀለና
ተቀመጠ በአንድ ገበታ
የሚለይበት ሰአት ደረሰ
ጌትነቱን ሰራና አሳየ

በረከቱ የማያልቅበት
ያመለከው የማያፍርበት
ተአምራቱ የማያልቅበት
ያመለከው የማያርፍበት
የሌለውን ያለ አድርጎት /2/*
እኛም አይተን መሰከርንለት
',0),(NULL,'እኔ የሚያምርብኝ','Gedion3','መዝሙር ይዤ መጣሁ
እንካ ተቀበለኝ /2/
ስትከብርልኝ ነው
እኔ የሚያምርብኝ
እንዲህ የሚያምርብኝ
እልልታ ይኸው ጭብጨባ /2/*
ዝማሬ ይኸው ሽብሸባ

ማንም ሳይገፋፋኝ ሳያስገድደኝ
ላዜምልህ ቆምኩኝ ምህረትህ ስቦኝ
መልካምነትህን እመስክራለሁ
በወገኖች መሀል ክበር እልሃለሁ

ይኸው አምጥቻለሁ ተቀበል ያለኝን
ምንም ባይመጥነው ያንን ውለታህን
ከገጠመኝ ሁሉ በላይ ነህ ትልቅ ነህ
ኮርቼብህለሁ ውዴ ታስመካለህ

የህይወቴን ትርጉም ኑሮ ምታጣፍጥ
አንተ ነህ ኢየሱስ ታሪክ የምትለውጥ
በብርሃንህ ብርሃንን አየሁኝ
በድል ጎዳና ላይ እራመዳለሁኝ

ዛሬ አማረብኝ ተቀይሮ ነገር
ይህንን ማዕረግ ማን አስቦ ነበር
የወሰንክልኝን በረከት ስቀበል
እልልታ ነው እንጂ እንዴት ዝም ልበል
',0),(NULL,'የፍቅር ቤት','Gedion3','በላያችሁ ይረፍ የጌታ በጎነት
በቤታችሁ ይለፍ የጌታ በረከት
የደስታ ቤት ይሁን የሰላም
የፍቅር ቤት ይሁን የሰላም /2/*

1. መረቅናችሁ እንዲህ ብለን
ተባረኩ ሰላም ሁኑልን
ተስማሙና በአንድ ሃሳብ
እስቲ ሁኑ በፍቅር ልብ

ተሳስባችሁ ተዛዝናችሁ
ስትኖሩ ተከባብራችሁ
በመንገዳችሁ እርሱ ቀድሞ
ያግዛችኋል ተአምር ሰርቶ

እንዳታዝኑ ቢጎድላችሁ
አባታችሁ አለላችሁ
ጓዳችሁን በደንብ ያውቃል
ተማመኑ ያኖራቸኋል

የእርሱ ጸጋ ይበቃችኋል
እረፍታችሁ ይሻላችኋል
በጸጥታ በእርጋታ
ያቆያችሁ ይኼ ጌታ /2/*
',0),(NULL,'የደስታ ቀን','Gedion3','ዛሬ የደስታ ቀን ሆኖልኛል እኛ
እግዚአብሔር መልካም አድርጎልናል
ይበሉ ሙሽሮች ያሰሙ ምስጋና
የረዳቸው ጌታ ይገባዋልና /2/*

ጋብቻን የሰራው ሃያሉ ፈጣሪ
ለሰው የሚራራ መከታና መሪ
እንዲህ አደረገ ሁሉን አበጃጀው
ምላሽ ስለሌለን ከፍ ከፍ እናርገው

ሁል ጊዜ መልካም ደግነቱ ብዙ
አያፍሩም ጨርሶ የሱስን የያዙ
እንዴት ቸር ወዳጅ ነው ፍቅሩ የበረታ
ስለምህረቱ ሲያንሰው ነው እልልታ
የደስታ የደስታ የደስታ ቀን /2/

ይሁንለት ክብር ይነሱ ሙሹሮች
እያሸበሸቡ በእርሱ አደባባዮች
ሞገስ ሆኖላቸው ሲያቆማቸው ጌታ
እርሱን ለማሞገስ ከቶ ምን ሊፈራ
የትኛው ተቆጥሮ የትኛው ይተዋል
እንዲያው በደፈናው ተመስገን ይሻላል /2/*
',0),(NULL,'ቃል ኪዳናችሁን','Gedion3','ቃል ኪዳናችሁን ጠብቁ
ጽኑበት ተማምናችሁ ኑሩ
ክቡር ነው ጋብቻ አስቡ
ይህንን መሃላ አታፍርሱ

በእግዚአብሔር ፊት የገባችሁት ቃል
እንዴት ይታጠፋል እንዴት ይለወጣል
የረዳችሁ ጌታ እንዳያዝንባችሁ
ታማኝና ፍጹም ሁኑ እባካችሁ

ሰላም በረከት ነው በቃል ኪዳን መኖር
ቤታችሁ ይሞላል በማይጠፋ ክብር
ለብዙዎች ህይወት የሚተርፍ ጸጋ
ለችግረኛው አለ መልስ እናንተ ጋ

በማጣት በማግኘት እንዳትለወጡ
መከራ ሲመጣ እንዳትደነግጡ
አንድ ያደረጋችሁ ይሄ ታላቅ ጌታ
እርሱ ሁሉን ያውቃል ተደገፉበታ

ተሰምቷል ቃላችሁ ጽፎታል እግዚአብሔር
የተናገራችሁት ሁሉ አንድም ሳይቀር
በአንድ ሃሳብና በፍቅር ሆናችሁ
መጨረሻው ይመር ትዳር ህይወታችሁ
',0),(NULL,'እግዚአብሔር ፍቅር','Gedion3','ኢየሱስ እንደወደዳት ቤቴክርስቲያንን
ባል ደግሞ እንዲሁ አድርጎ እንዲወዳት ሚስቱን
በቅዱስ ቃል ተገለጠ የጋብቻ ምስጥር
ማሰሪያው መቋጫው ሆነና ሰላምና ፍቅር

ፍቅር እግዚአብሔር ፍቅር
ፍቅር አስተምረን ፍቅር
ፍቅር ራሱን ሰጥቶ ፍቅር /2/*

ጋብቻ ይጸናል ይቆማል ሲሰራው እግዚአብሔር
ግብዝነት በማይኖርበት በማይጠፋ ፍቅር
ይሄ ነው ፈቃዱ ለሰው ልጅ አንድ ልብ አንድ አሳብ
በተድላ እንዲኖር በደስታ እረፍቱ እንዲያብብ

አይችልም ማንም ማለያየት ጌታ ካገናኘ
አሳቡ አይከለከልም ማድረግ ከፈለገ
በሰማይ በምድር በጥልቁም ፈቃዱን የሚያሳይ
አዛኝ ነው የሚራራ ወዳጅ ከሰው ልጆች በላይ

ጋብቻ በፍቅር በአንድ ልብ
ጋብቻ ሲኖር መተሳሰብ
ጋብቻ ሲከበርበት ጌታ
ጋብቻ ሰላምና ደስታ /2/*

ክቡር ነው ጋብቻ
ክቡር ነው /2/*
',0),(NULL,'አመሰግንሃለሁ','Habtamu2','አመሰግንህአለሁ 3
አድነህኛልና ኢየሱስ /3/ እልህአለሁ

ደዊዬን ተሸከምከው
ሕመሜን ፈወስከው
የዕዳዬን ጽህፈት ከእኔ ደመሰስከው
ብሩም ወርቁም የአንተ-ሁሉ በአጅህ ነው
ምን እከፍልህአለሁ ምስጋና ብቻ ነው     /3/

ባህርና ሞላዋ - የእጅህ ስራ ናቸው
ሰማይና ምድር - ሁሉም ያንተ ናቸው
ለውለታህ ምላሽ ምን እከፍልሀለሁ
ለአንተ የምሰጥህ ምስጋና ብቻ ነው

ጌታ የሱስ ለኔ አምላኬ ነህና
    እሰዋልህአለሁ ከልቤ ምስጋና  /2/

ሽባውን ያዘለልክ - ዕውሩን ያበራህ
በሀይል በስልጣንህ - ሁሉ የሚገዛልህ
ኢየሱስ አምላኬ - የለም የሚሳንህ
ይኸው ምስጋናዬ - ለአንተ ይቅረብልህ

ስለማይነገር - ስለአንተ ስጦታ
ተባረክ ልበልህ - ክበርልኝ ጌታ
ሃሌሉያ ብዬ - ላክብርህ ላንግስህ
      እኔ ዝቅ ብዬ - ሁሌ ላወድስህ    /2/

ጌታዬ ነህና
   አምላኬ ነህና //
',0),(NULL,'አንድ ጌታ','Habtamu2','አንድ ጌታ - አንድ ሃይማኖት
አንድ መንፈስ - አንድ ጥምቀት
በሁሉ የሚኖር - የሁላችን አባት
      አንድ ነው እግዚአብሔር - አይደለም ሁሉት ሶስት  /2/

በራስ ጥበብ ሳይሆን - በስሜት በድምር
መደመር ማባዛት - ቁጥር በመጨመር
የስው ልጅ ተመለስ - ከጥፋትህ ተናገር
ተጨማሪም የለም - አንድ ነው እግዚአብሔር

ስሙን እየጠራሁ - የምጓደድበት
የሚያስመካ አምላክ ነው - ኢየሱስ የኔ አባት
በእውነት በመንፈስ - በምስጋና ቃና
ስሙን እየጠራሁ - ክብር ልስጠውና

ባርነት ነው - ልጅነት
ወይስ በመንፈስ መገኘት
የሱስ ምንድን ጎደለው
እሱ አምላክና ጌታ ነው

ሁሉም ሲረታ - የሱስ ጌታ
ሲነግስ ሲወደስ - የሱስ ንጉስ
ሲጠና ታሪክ - የሱስ አምላክ
ስላለው ምህረት - የሱስ አባት
ከአይንም ሲሰወር -  -------- መንፈስ
ሁሉ በሁሉ - ሆኗል እንደ ቃሉ

በሙሴ ህግና በነቢያት መዝሙራት
እንደተነገረው - ቃል የተጻፈለት
ያለ የነበረው - ዘለአለማዊው
አንዱ ጌታ ኢየሱስ - እርሱ ብቻውን ነው
',0),(NULL,'በእስራኤል ሰፈር','Habtamu2','በእስራኤል ሰፈር ምንድ ነው ሽብሩ
ማንም ልቡ አይውደቅ ይቅር ግርግሩ  (2)

አለሁ እኔ ዳዊት ትንሽ ብላቴናው
ለፍልስጤም ቆላፍ እኔ እበቃውለሁ (2)

የሚል ሰው ይነሳ ከመካከላችሁ
የዘመኑን ጎልያድ የሚቆርጥ አንገቱን
ቃሉን የሚያነሳ የመንፈስ መዋጊያን
ስሙ የሚጠራ የጌታ ኢየሱስን
እኔ አለሁኝ የሚል አክብሮ ወንጌሉን

አልፈተንኩትም የሳኦልን ጥሩር
ምን ያደርግልኛል ውጊያ ላይ መሽከርከር
አልፈተንኩትም የሳኦልን ጋሻ
የለመድኩት አለ የቃሉ መዶሻ (4)

ይኸው አለኝ ወንጭፍ እግዚአብሔር የሰጠኝ
የነፍሳትን ምርኮ እጄን የሚያስገባልኝ
የጠላትን አንገት የሚቆራርጥልኝ
በምርኮ ላይ ምርኮ የሚጨምርልኝ (4)

ዳዊት በዘመኑ አስከብሮት አልፏል
አሁን አደራውን ለአንተ ለኔ ሰጥቷል (2)

የጎልያድ ጥልቀቱ ግዝፈቱ ቢበዛ
በጠሮኘነቱ እኔ አልስፈራራ
በእስራኤል አምላክ በተገዳደረው
ጠጠሬን ወንጭፌ አጋድመውአለሁ (4)

በጎችን ከተኩላ ያኔ  እንዳስጣልከዋቸው
ከአንበሳና ከድብ እንደ ታደግኳቸው
ከፊቴ ለቆሞው የፍልስጤም ቆላው
ግንባሬም አልመስ ልቤ መቼም አልሰንፍ (4)
',0),(NULL,'ሊከብር ይገባዋል','Habtamu2','አክብረው ኢየሱስን ሊከብር ይገባዋል
እርሱ እግዚአብሔር ነው ከሁሉ ይበልጣል
ብቻውን በዙፋን ከፍ ብሎ ላለው
ያለ የነበረ የሚመጣው እርሱ ነው

በተራራ በሸለቆ በማግኘትም በማጣትም
እግዚአብሔር እግዚአብሔር ነው
ጌታ ኢየሱስ ኤልሻዳይ ነው
እግዚአብሔር እግዚአብሔር ነው
ጌታ ኢየሱስ ሁሉን ቻይ ነው

ስጠው ክብርን ስጠው
ስጠው ዝማሬን ስጠው
ስጠው እልልታን ስጠው
ስጠው ሽብሸባን ስጠው

ይኸን ኢየሱስን ከልብህ አምልከው
በፍጹም ነፍስህ ጌታህን ውደደው  (2)

ምንድ ነው ማጉረምረም ምክተምተም በጉዞህ
ይህን የመሰለ መዳን ተገልጦልህ
በል እንጂ ወንድሜ ተጓዝ እንጂ በርታ
ፍጻሜህ እንዲያምር የማታ የማታ

እኛ የተጠራነው ለምድሩ አይደለም
ከጭቃው ከአዳም ምንም ክብር የለም
በእምነት የአብረሃም ዘር ተብለን ተጠርተናል
በኢየሱስ ስም ጥምቀት አዲስ ዘር ሆነናል
',0),(NULL,'እያከበረ ላከበረኝ','Habtamu2','እያከበረ ላከበረኝ
እየባረከ ለባረከኝ
እኔስ ለኢየሱስ ምስጋና አለኝ
እኔስ ለአንዱ አምላክ ምስጋና አለኝ

አስር አውታር ባለው በበገና
እዘምርለት አለሁ እንደገና
አሸበሽብአለሁ በምስጋና
ለሆነው ገናና  (2)

ለእርሱ ክብር ቆሜ ብዘምርለት
ያንሳል ለኢየሱሴ መች ሲበዛበት
እጨምራለሁኝ አዳዲስ ዝማሬ
በድል አቁሞኛል አክብሮኛል ዛሬ

ስሙን ጠርቼ ስጋርከው
ጌታዬ ኢየሱስ ውዴ ስለው
ነፍሴ በሐሴት ትሞላለች
አንዱን አምላኳን ስላገኘት  (2)

ሲዝል ጉልበቴ ብርታት የሆነኝ
ከወደቅኩበት እኔን ያነሳኝ
አይዞህ አትፍራ አለሁ እያለኝ
ማን አለ እንደ እርሱ አባት የሆነኝ

አይዞህ አይዞህ አይዞህ እያለኝ
አይዞህ አይዞህ አትፍራ እያለኝ
አይዞህ አይዞህ አለሁ እያለኝ
አይዞህ አይዞህ በርታ እያለኝ

አንዱን አምላኳን ስላገች
አንዱን ጌቷን ስላገኘች  (2)
',0),(NULL,'እግዚአብሔር ሐያል','Habtamu2','እግዚአብሔር ሐያል ነው ማንንም አይንቅም
የተቀጠቀጠ ሸንበቆ አይሰብርም
   /የሚጢሰውንም ክር አያጠፋም/  2*

ይጠግናል እንጂ እርሱ መች ያፈርሳል
ንጋት ላይ ሲያቅላላ ስምን ይቀይራል  2*

ሰው ላላወቀልኝ ለችግሬ ደራሽ
ላፍታ እንኳን የማይረሳኝ አለኝ የኔ አስታዋሽ
የሚስኪኖች ወዳጅ ጸሎት የሚሰማ
በከፍታ ስፍራ የሚያቆም ከሟሟ   2 *
በከፍታ ስፍራ የሚቆም ከሟሟ

ከአይኖቼ ሲጎርፍ ሲወርድ የኔ እንባ
አብሶ አይዞህ አለኝ የሱስ ይኔ አባባ
ሰቆቃዬ በዝቶ ውስጤን ሲያስጨንቀኝ
ሰላም ላንተ ይሁን ብሎ ደረሰልኝ  2*
ሰላም ላንተ ይሁን ብሎ ደረሰልኝ

ከኔ ጋር ነው - ጥሎ የማያውቀው
ከኔ ጋር ነው - ከትቢያ የሚያነሳው
 ከኔ ጋር ነው - ከአዘቅት የሚያወጣው
      ከኔ ጋር ነው - በጭንቅ የሚደርሰው   3*
',0),(NULL,'ምህረቱ ከህይወት ይሻላል','Habtamu2','በምህረቱ የሱስ እሱ ባለ ጸጋ
የማያልቀበት ከእርሱ ለተጠጋ
ፍቅሩ ምህረቱ ፍጹም ወደር የለው
ችሮታው የጌታ ዘለአለማዊ ነው

ልጄ ሆይ እያለ የሱስ ይጣራል
እጁን ዘርግቶ ና ና ይለሀል
የምህረት ክንዱን ዘርግቶልሀል
የጌታ ምህረቱ ከህይወት ይሻላል
ከህይወት ይሻላል ከህይወት ይሻላል

በርሀብ በጥማት ብዙ ዋጋ ከፍለህ
ለእግዚአብሔር መንግስት እንድያ እንዳልተጎዳህ
ሙሽራው ሲመጣ ሳታጌጥ ባክሊልህ
ለምን ትሄዳልህ እንደ ዴማስ ሆነህ  /4/

ይብቃህ ወንድሜ ከንቱ ድካም
ወደ አለም ሄደህ ምንድ ነው ትርፍህ
ይብቃሽ እህቴ ከንቶ ድካምሽ
ወደ አለም ሄደሽ ምንድ ነው ትርፍሽ
አስተውል ወንድሜ ትንሽ ቆም ብለህ
ያልጨረስከው ጉዞ ገና እንደቀረህ
ስለዚ ተመለስ ከንቱ ጊዜ አታጥፋ
ዘይትህ ተሟጦ መብራትህ ሳይጠፋ
መብራትህ ሳይጠፋ መብራትህ ሳይጠፋ

ከክርስቶስ ፍቅር ማን ይለይል ያልከው
ሞት ነው ወይስ ስደት ብለህ የወሰንከው
ከኢየሱስ ጋራ የተጣበቅክበት
የት ሄደ ያ መንፈስ ቃል የገባህበት /4/

ተው ተው ወንድሜ  ተይ ተይ እህቴ /3/
ና ና ወንድሜ   ነይ ነይ እህቴ /3/
',0),(NULL,'ልስጥህ ክብር','Habtamu2','አለኝ ብዙ ምስጋና - አለኝ ብዙ ክብር
አለኝ ብዙ ምስጋና - አለኝ ብዙ ክብር
ለሰራዊት ጌታ - ላንተ ለእግዚአብሔር
አለኝ ብዙ ምስጋና - አለኝ ብዙ ክብር
ለሰራዊት ጌታ -  ለእግዚአብሔር

ይመታ ከበሮ ይደርደር በገና
ይመታ ከበሮ ይደርደር በገና
የአለም መድሃኒት ጌታ አንተ ነህና
ይመታ ከበሮ ይደርደር በገና
የአለም መድሃኒት ጌታ አንተ ነህና

ይኸው ስግደቴ ከዙፋንህ ስር
በብርቱ ግርማ በብዙ ክብር
በኪሩቤል ላይ ከብረህ ለምትኖር
ላንተ ለኢየሱስ ለሆንከው እግዚአብሔር

ነፍሴም ትባርክር የድልዋን ዜማ
ለውለታዋን ድምጿን ታሰማ
ላንተ የሆነውን ላንተ እሰዋለሁ
በምስጋና ቃል እጠራሀለሁ

በእጆቼ ይኸው ጭብጨባ
በእግሮቼም ይኸው ሽብሸባ
በአንደበቴ ልስጥህ ክብር
      ላንተ ብቻ ለእግዚአብሔር  / 2/

ይኸው እልልታ ልዩ ዝማሬ
ከቅዱሳን ጋር ሳመልክ አብሬ
ባመሰግንህ መቼ ይጠግብና
ብቻህን ንጉስ ጌታ ነህና

በሁሉ ሀይሌ በፍጹም ልቤ
ጥኡም ዜማዬ ላንተ አቅርቤ
ላባትነትህ ክብር ይባዝልህ
ለጌትነትህ ይሰገድልህ

ነፍሴም ትባርክህ የድልዋን ዜማ
ለውለታዋን ድምጿ ታሰማ
ላንተ የሆነውን ላንተ እሰዋለሁ
በምስጋናም ቃል እጠራሀለሁ
',0),(NULL,'በምስጋና ልቅረብ','Habtamu2','በምስጋና ልቅረብ በምስጋና  /6/

ሲከብር ሲወደስ - ደስ ይላታል ነፍሴ
በልቤ ዙፋን ላይ - የሱስ ነው ንጉሴ
ሲከብር ሲወደስ - ደስ ይላታል ነፍሴ
በልቤ ዙፋን ላይ - የሱስ ነው ንጉሴ

ይንገስ ይንገስ - ጌታ የሱስ
ይክበር ይክበር - አንዱ እግዚአብሔር
ይንገስ ይንገስ - ጌታ የሱስ
ይክበር ይክበር - አንዱ እግዚአብሔር

ቢደገፉበት ብርቱ መጠጊያ
የሱስ ጋሻ ነው የሚሆን መመኪያ
ቢታመኑበት የማያሳፍር
የድል ጌታ ነው በጠላት ሰፈር

ልዘምር ልነሳ በገናዬን ይዤ
ልዘምር ልነሳ ከበሮዬን ይዤ
ልዘምር ልነሳ ጠላትም ይፈር
ልዘምር ልነሳ ይክበር እግዚአብሔር /2/*

በገናዬን ይዤ ስቀኝ ስዘምር
አየሁት ጠላቴን ሲርድ ሲሸበር
ስራውን ለማፍረስ ይኸው ታጥቃለሁ
ጠላቴን ልበቀል ሁሌም ዘምራለሁ /2/*

ስሙን ጠርቼ ስባርከው
ጌታ ኢየሱስ ውዴ ስለው
ነፍሴ በሐሴት ትሞላለች
አንዱን አምላኳን ስላገኘች

ልዘምር ልነሳ በእውነት በመንፈስ
ልዘምር ልነሳ ጌታዬን ላወድስ
ልዘምር ልነሳ ከመላእክት ጋራ
ልዘምር ልነሳ ከሳሼ እንዳይኮራ  /2/*

በእውነት በመንፈስ ልዘምር ስነሳ
የትኛው ጠላት/ከሳሽ ነው የሚፎክር የሚያገሳ
ስሙን እየጠራሁ ቅኔ ስደረድር
መታወክ መሸበር ሆነ ጠላት ሰፈር  /2/*

ምስጋና ላንተ ነውና
አምልኮ ያንተ ነው እኮ  /2/*

የልቤ ናፍቆት የነፍሴ ስስት
ይኸው ምስጋናዬ/ አምልኮዬ ላንተ መስዋእት /2/*

የኔ ምስጋና ላንተ ነው
የኔ ዝማሬ ላንተ ነው
የኔ አምልኮ ላንተ ነው
የኔ ሽብሸባ ላንተ ነው /2/*

ላንተ ነው ላንተ ነው
',0),(NULL,'ስለእኔ','Habtamu2','ስለኔ ስለ ሐጥያቴ - ጌታዬ መስቀል ላይ ዋለ
ስለኔ በደሌ ብሎ - የሱሴ መስቀል ላይ ዋለ
እጄን ዘርግቼ ባመልከው ምን አለ
እጄን ዘርግቼ ባከብረው ምን አለ
በፍጹም ነፍሴ ብሰግድስ ምን አለ
በፍጹም ሀይሌ ብገዛስ ምን አለ /2/*

ስቀለው ስቀለው - ብለው ሲፈርዱበት
መስቀል አሸክመው እንዲያ ሲያንገላዱት
በሰፍነግ ሞልተው ሆምጣጤ ሲግቱት
ታገሰ ያ ጌታ ፍቅር ግድ ብሎት

ጸሀፍት ፈሪሳውያን - ስቀሉት እያሉ
በርባን ተሽሎቸው - ከእስር ፍቱት ሲሉ
አቤት አለማወቅ - የሰው ልጅ ስንፍና
የሚበጀንን ሳናውቅ ለክፋት ስንቀና

ለሰው ዘር በሙሉ - ሕይወቱን ታድጎ
የማዳን ራስ ቁር በራሱ ላይ አርጎ
በሞት ላይ ሞት ፈርዶ - ሕይወትን አንግሶ
በቅናት ተነሳ የጽድቅ ጥሩር ለብሶ
ስለ ቀራንዮ የመስቀል ውለታው
ባመልከው ባከብረው ብስግድም ሲያንሰው ነው
ባመልከው ባከብረው ብስግድም ሲያንሰው ነው /2/*
',0),(NULL,'አልልም ዓለት ነው','Habtamu2','አልልም ዓለት ነው - አልልም ድንጋይ
አልልም ዓለት አልልም ዓለት
ይችላል እግዚአብሔር ይችላል መስራት
አልልም ተራራ - አልልም በረሀ
አልልም ተራራ - አልልም ተራራ
ይችላል አምላኬ - ሁሉንም ሊሰራ

ደመናም ባላይ - ትንሽ ምልክት
ንፋስም ባይኖር - የሚያመላክት
ይኼ ሸሎቆ - ውሃ ይሞላል
ለጌታ ኢየሱስ ምን ይሳነዋል
ከፊቴ ባህር ድቅን ቢልም
ፈርኦን ከሃላ ቢገሰግስም

በቃ አምልጫለሁ አልመለስም
እሻገራለሁ አልደነግጥም /2/*

ቢሆን አለት ቢሆን ተራራ
ከቃሉ ጋር ነኝ ምንም አልፈራ
ቢሆን ድንጋይ ቢሆንም ጋራ
ሀያሉ ጌታ ነው ከኔ ጋራ
ቢሆን በረሀ ቢሆን ሀሩር
ውሃን ያፈልቃል ምንም ሳይኖር
ቢሆን ድንጋዬ ቢሆን ተራራ
የሱስ የኔ ነው ምንም አልፈራ

ሕዝቡን በጉዞው እርሱ እየመራው
ከፍሎ ባህሩን የሚያሻግረው
የደረቀውን የሚያለመልም
ሳይኖረ ደመና ሰጪ ዝናብን /2/*

ሚሆን ቢመስል ከበድ ነገር
የሱስ ስላለ የለም ችግር
ቢሆን ጦረኛ የሚያስፈራራ
ንጉሱን ይዤ ምንም አልፈራ
ቢገዝፍም እሱ እንደ ኔፊሊም
የሱስ እያለ ሽንፈት የለም

ለሰው የሚከብድ ቢመስልም ብርቱ
እንደ ያሪኮ ረዝሞ ቁሞቱ
እዞረው አለሁ እኔ በቃሉ
አስተማማኝ ነው የየሱስ ሃይሉ/የአምላኬ ሃይሉ /2/*

አልልም ድንጋይ ነው - አልልም ተራራ
ይችላል እግዚአብሔር ሁሉንም ሊሰራ
አልልም ሐሩር - አልልም በርሃ
የሚያፈልቅ አምላክ ነው - ከአለት ውሃ
',0),(NULL,'አንተ ምንጭ ሆይ ፍለቅ','HabtamuL1','አንተ ምንጭ ሆይ ፍለቅ እናንተም ዘምሩለት
የሕዝብ አዛውንቶች አለቆች ከቆፈሩት
የሕይወት ውሃ ወንዝ ከሚወጣበት
ጠጥተን እርካታን ከምናገኝበት

ፍለቅልን ፍለቅልን
እንጠጣለን እንጠጣለን
እንረካለን እንረካለን
ፍለቅልን ፍለቅልን
እንጠጣለን እንጠጣለን
እንረካለን እንረካለን

ቀድሞ ዋኖቻችን ከፍተው የቆፈሩት
በእንባ በጸሎት ተግተው የፈለጉት
ወይኑን ፍሬያማ እንዲሆን ያረገው
የመንፈስ ቅዱስ ሃይል የሕይወት ውሃ ነው

ውሃው እንዲይዙት ከቶ የማይችሉትን
ስንቆፍር ኖረናል ባለፈ እምነታችን
አሁን ለከንቱነት መገዛት ትተናል
የሕይወትን ውሃ ምንጩን አግኝተናል

በጌታ ኢየሱስ ስም አሁን ፍለቅልን
በአንተ ብቻ እኮ ነው የሱስ እርካታችን
በውሃ ጥም ዝለን ጠላት እንዳይነካን
ሃይልን በሚሰጠው በመንፈስህ ሙላን
አንተ ምንጭ ሆይ ፍለቅ እናንተም ዘምሩለት
የሕዝብ አዛውንቶች አለቆች ከቆፈሩት
የሕይወት ውሃ ወንዝ ከሚወጣበት
ጠጥተን እርካታን ከምናገኝበት

ፍለቅልን ፍለቅልን
እንጠጣለን እንጠጣለን
እንረካለን እንረካለን
ፍለቅልን ፍለቅልን
እንጠጣለን እንጠጣለን
እንረካለን እንረካለን

ቀድሞ ዋኖቻችን ከፍተው የቆፈሩት
በእንባ በጸሎት ተግተው የፈለጉት
ወይኑን ፍሬያማ እንዲሆን ያረገው
የመንፈስ ቅዱስ ሃይል የሕይወት ውሃ ነው

ውሃው እንዲይዙት ከቶ የማይችሉትን
ስንቆፍር ኖረናል ባለፈ እምነታችን
አሁን ለከንቱነት መገዛት ትተናል
የሕይወትን ውሃ ምንጩን አግኝተናል

በጌታ ኢየሱስ ስም አሁን ፍለቅልን
በአንተ ብቻ እኮ ነው የሱስ እርካታችን
በውሃ ጥም ዝለን ጠላት እንዳይነካን
ሃይልን በሚሰጠው በመንፈስህ ሙላን
',0),(NULL,'ከአቤል ደም ይልቅ','HabtamuL1','ከአቤል ደም ይልቅ የሚናገር
የከበረው የጌታ የየሱስ ደም
በቀራንዮ ኢየሱስ ተሰቅሎ
ለዘለአለም መንፈስ ያፈሰሰው

ከበደል ከሃጥያት ፈጽሞ ያነጻል
ከሳሽን ከመንገድ ጠርቆ ያስውግዳል
ከበደል ከሃጥያት ፈጽሞ ያነጻል
ከሳሽን ከመንገድ ጠርቆ ያስውግዳል

ህያው መንገድ የተመረቀበት
አዲስ ኪዳን የተከፈተበት
አምላካችን ፊት የምንቀርብበት
ያስታረቀን የጌታ የየሱስ ደም

ከእርኩሰት ፈጽሞ አጥርቶን
ያለነውር አድርጎ የሚያቆመን
ከሃጥያት ክስ ህሊናችን ነጽቶ
እንድናመልክ ነጻነትን ሰጥቶ

ቤተክርስቲያን የተዋጀችበት
የራሱ እንድትሆን የተገዛችበት
ለሰው ልጆች ሁሉ የከፈለው
የየሱስ ደም እጅግ የከበረው
',0),(NULL,'ምስጋና የሚገባውን','HabtamuL1','ምስጋና የሚገባውን ጌታ የሱስን
እጠራውለሁ ዘወትር በማክበር ስሙን
ሁልጊዜ ከጠላቶቼ እድናለሁ
እንደ ወፍ ከአዳኝ ወጥመድ አመልጣለሁ
በፍጹም ሰላም እኖራለሁ

ሰላምህን ለማግኘት ብዙ ተቅበዝቢዤለሁ
ለነፍሴ ጌታ እና እረኛ ነፍስን አገኘሁ
አንገቴን የደፋኝ ቀንበር ተሰባብሮልኝ
የአምላኬ ፍቃድ አውቄ አርፌአለሁኝ
ይኸው በሰላም እኖራለሁ

በምስጋና ማዳኑን አይቼዋለሁ
ያለፈው ፍጹም አልረሳም አስታውሳለሁ
ከፊቴ ያለውን ተራራ ሜዳ ይሆናል
ሸሎቆ ሁሉ ከፍ ይላል ይደላደላል
ልቤ በደስታ ሀሴት ያደርጋል

ጥበብን ከአባቶቼ ተምሬአለሁ
ጠይቄ መንገዱንም አውቃለሁ
በእምነት ጸንተው የሱስን ሲያመሰግኑ
በጠላት ሰፈር ሁሉ ላይ ሃያላን ሆኑ
ማጉረምረም ትተው ሲያመሰግኑ

ማዳንን የሚወድ አምላክ ምስጋናን ይሻል
የአንደቤቴንም ፍሬ ይፈልገዋል
ከሰባ መስዋእት ይልቅ ያስደስተዋል
መልካም ነው እሱም ማመስገን ይቀበለዋል
በምስጋና ማዳኑን ያሳይበታል
',0),(NULL,'እግዚአብሔርን የሚፈልግ ልብ','HabtamuL1','እግዚአብሔርን የሚፈልግ ልብ ደስ ይበለው
ሁሉ በእርሱ ከእርሱ ነውና የሚገኘው
እግዚአብሔርን ፈልግ ሕይወትህም ጸንታ ትኖራለች
       ለእንቆቁልሽህ መፍትኸውን በዚያ ታገኛለች      /2/

ለፍጥረት ሁሉ ፊቱን ለሚሹት
በፍጹም ልባቸው ለሚፈልጉት
የራሱን ፈቃድ በግልጽ እንዲያውቁት
የሱስ ይገኛል በትሁት ልብ ላሉት

መልካም ስጦታ በረከት ሁሉ
ከኢየሱስ ዘንድ ሁሌ ይገኛሉ
ምኞት ብቻ ግን አያሰጥህም
መፈለግ ያሻል በፍጹም ልብን

ሰላም እንዲሰፍን በመላ ህይወትህ
ውስጥህን እንዲያርፍ በየሱስ ታምነህ
መቅበዝበዝ ትተህ እፎይ እንድትል
መንገዱ ይኸው ነው ቸል የማይባል

በጾም በጸሎት ራስህን አዋርደህ
ሸክም ተሰምቶህ እንባን አፍስሰህ
ዘወትር ፈልገው ወደ የሱስ ጩህ
ታላቅን ነገር እርሱ እንዲያሳይህ
',0),(NULL,'አንተን በማወቅ','HabtamuL1','አንተን በማወቅ ከግብጽ ባርነት ነጻ ወጣን
አንተን በማወቅ ፍጹም ተለወጠ ህይወታችን
አንተን በማወቅ ሰላምህን እንደ ወንዝ ፈስሶልናል
አንተን በማወቅ ከድካም ባንተ ሃይል በርትተናል

አምላኩን የሚያውቅ ህዝብ ይበረታል
ተብሎ የተጻፈው ተፈጽመዋል
የህይወታችን ንጉስ የሱስ ሆነህ
በብርሃንህ ብርሃን እያሳየህ

የህይወታችን እራስ መኖሪያችን
መሸሸጊያ ዋሻ አለኝታችን
ካንተ ሌላ አምላክ አናመልክም
ክብርንም ላማልክት አንሰጥም

እውነት የሱስ ብቻ መሆንህን
በታላቁ ስምህ ማዳንህን
የልባችን አይኖች ተከፍተዋል
የመጥራትን ተስፋ አውቀነዋል
',0),(NULL,'በነብያቱም እመኑ','HabtamuL1','በእግዚአብሔር እመኑ ትጸኑማላችሁ
በነብያቱም እመኑ ነገሩም ይሰራላቹሃል
በእግዚአብሔር እመኑ ትጸኑማላችሁ
በነብያቱም እመኑ ነገሩም ይሰራላቹሃል

ከፍጥረት ጀምሮ ያለው አላማው
የእግዚአብሔር ሚስጢር የተሰወረው
ብዙዎች በንቀት ረግጠው ያለፉት
ለችግሮቹ ሁሉ መልሱ ይኸ ነው

ሃያላን ጠቢባን የተራመዱባት
ጠላቶቻቸውን ድል ያደረጉባት
ሴቶች ሙታናቸውን በእምነት ያስነሱባት
የባለአእምሮች ጥበባቸው ይቺ ናት

ከፋርነት እና የኩሩነት መንፈስ
የምናምንቴዎች ምልክታቸው ናት
አስተዋይን ግን ሁሉን በጥበብ ያደርሳል
ስርአትን ጠብቆ በእምነት ይጓዛል

ሙሴና ነብያት በዚህ ዘመን አሉ
በልኡሉ አምላክ ተቀብለው ያሉ
በእስራኤል ውስጥ ሆነው የሕዝቡ መሪዎች
የኢየሱስ ሃያላን ለእርሱ ተዋጊዎች
',0),(NULL,'ባንተ ይቻላል','HabtamuL1','ባንተ ይቻላል ባንተ ይቻላል
የጽዮን ጉዞ የጽድቅ መንገድ
ባንተ ይቻላል
በቅድስና የሱስ ባንተ ፊት
ፍጹማን ሆነን ለመመላለስ  /2/

አለም በእርኩሰት ተሞልታ
ድቅድቅ ጨለማ ቢውጣት
የምናየው እና የምንሰማው ሁሉ
ነፍሳችንን ቢዋጋ
የአጥፍተህ ጥፋ ዘመቻውን
ሰይጣን አላማው ቢያደርግብን
ጥቂት ዘመን እንዳለው አውቆ
ወደ ምድር በቁጣ ቢወርድም

አመጻ በአለም በርትቶ
የእውነት ፍቅር ስፍራውን ቢያጣ
ጥላቻ ትእቢት ምድርን መልቶ
ሰላም ለሰው ልጅ ርቆ ቢገኝም
',0),(NULL,'በጨዋታ የሚታገል','HabtamuL1','በጨዋታ ማሃል የሚታገል
እንደሚገባው ባይታገል
የድሉን አክሊል አያገኝም
እንደሚደክም ገበሬ አንተም
ካልለፋህ ፍሬን አታገኝም
ማስተዋል ይስጥህ ጌታ ኢየሱስ
በጊዜ ስራህን እንድትጨርስ

የምትዘራውን ነው የምታጭድው
በትጋት ይልቅ በዘራኸው
ዋጋውን ሙሉ እንዲሆንልህ
ፍሬን ደግሞ እንዲበዛልህ
እንደተሰጠህ ጸጋ መጠን
ሁልጊዜ ጨምር ትጋትህን
ካሸናፊዎች ትበልጣለህ
በእምነት ከልብ ከታገልህ

ቀኑ በከንቱ እንዳይባክን
በጊዜ ስራ የሚገባህን
አደራ ብሎ ያኖረውን
እንዳትቀብር መክሊትህን

ዳግም ሲመለስ ጌታ የሱስ
በእምነት ስትተጋ እንዲያገኝህ
የድሉን አክሊል እንዲሰጥህ
ሙሉ እንዲሆን ያኔ ደስታህ
',0),(NULL,'በመንገድህ ሁሉ','HabtamuL1','በመንገድህ ሁሉ አምላክህን እወቅ
የሱስ የሰጠህን መዳንን እንዳትንቅ
የተጠራህለትን አላማህን እንዳትስት
መሆኑን አትዘንጋ ለዘለአለም ህይወት

ኦ መዳንህ በምንም በማንም የማይለወጥ ነው
ጌታ የሱስ እስኪመጣ ባደራነት ላንተ የተሰጠው
ኦ መዳንህ በምንም በማንም የማይመዘን ነው
ጌታ የሱስ እስኪመጣ በተጠንቀቅ የምትፈጽመው

አብረሃም በስምህ በስራህ ባያውቅህ
እስራኤልም ደግሞ ባይገነዘብህ
ከመዳንህ ጋራ እንዳታገናኘው
ታላቁን ተስፋህን ያዝ እስከፍጻሜው

መለየት የሚወድ ምኞቱን ይከተላል
መልካሙንም ጥበብ ሁሉ ይቃወማል
አንተ ግን ተስፋ አድርግ ጌታ ኢየሱስን
እራሱ በእውነት የገለጠልህን

በራህ ላይ ልታዝ ስልጣን እንዳይኖርህ
ዋጋ ከፍሎልህ ነው የራሱ ያደረገህ
ፍጻሜው ይኸ ነው የተጠራህበት
ዳግመኛ ሲመለስ ለዘለአለም ህይወት
',0),(NULL,'ሰላምህ እንደ ወንዝ','HabtamuL1','ሰላምህ እንደ ወንዝ ፈሶልህ
ሁሉም ነገር ተትረፍርፎልህ
አይቀርም አንድ ቀን ታያለህ
     የሱስን ታመሰግናለህ  /2/*

መከራህን እንዳለፈ
አንድ ቀን ትረሳለህ
የነበረው እንዳልነበር
   ይቀየራል አንድም ሳይቀር /2/

የክረምቱ ወራት አልፎ
ደመናውን ንፋስ ገፎ
የጽድቅ ጸሃይ ትወጣለች
  ህይወትህን ታደምቃለች /2/

ምርኮህ ሁሉ ተመልሶ
ሃዘን ጭንቀት ተደምስሶ
ታምራቱን ታየዋለህ
   እጅህ በአፍህ ትጭናለህ /2/

የዘራኸው ይታጨዳል
በእቅፍህ ይሰጠሃል
በመጎብኘት ትጽናናለህ
  ለሌሎችም ትተርፋለህ /2/
',0),(NULL,'የአምላኩን ጦርነት','HabtamuL1','የአምላኩን ጦርነት ሚዋጋ
በጎነቱን ለመንገር የሚተጋ
የምድርን በረከት ይበላል
   የታመነ ቤት ይሰራለታል /2/*

በጥቂት ዘመኑ አምላኩን ያከብራል
የእግዚአብሔርን ሃሳብ ብቻ ያገለግላል
ከንትነቱን ትቶ ፍጻሜውን ያስባል
የከበረውን ተስፋ አሻግሮ ዛሬም ያየዋል

ምንም ታናሽ ቢሆን ዛሬ ጅማሬው
ፍጻሜው ያማረ እጅግ የበዛም ነው
የናቁት በሙሉ እፍረት ይለብሳሉ
ቤቱን ሲሰራለት አይቀርም አንድ ቀን ያያሉ

የየሱስ ቸርነት በሕይወቱ ዘመን
ይከተለዋል እስኪ ገባ ወደ ጽዮን
ከክብር ወደ ክብር ይሸጋገራል
በጸጋ ላይ ጸጋን ደርቦ ይጎናጸፋል

የከንፈሩ ፍሬ ይባረክለታል
ብዙዎችን ወደ ጽድቅ መልሶ ያስታርቃል
በመንግስተ ሰማይ ሲያበራ ይኖራል
ማለቂያ የሌለው ሕይወት የሱስ
',0),(NULL,'ኢየሱስ ብቻ ነው','HabtamuL1','እንደ ፈቃዱ እኛን የሰራው
በራሱ ምህረት ሁሉን የፈጠረው
የሱስ ብቻ ነው ሃያል
የሱስ ብቻ ነው አምላክ
የሱስ ብቻ ነው አዳኝ
የሱስ ብቻ ነው ፍቅር

በድንቅ በታምራት የታጀበ አምላክ ነው
ከጥንትም ጀምሮ ግሩም ሃይል የያዘው
በበረታው ክንዱ ሕዝቡን የታደገው
የባርነታቸው ቀንበር የሰበረው
ማን እንደ የሱስ /4/ ዘለአለም

የሚታዩትና የማይታዩትን
አለቅነት ዙፋን ሃይላት ስልጣናትን
ታላላቅን ነገር ብቻውን የፈጠረው
የሰው ልጅ ፈልጎ መርምሮ የማይደርሰው

የሱስ ብቻ ነው ሃያል
የሱስ ብቻ ነው አምላክ
የሱስ ብቻ ነው አዳኝ
የሱስ ብቻ ነው ፍቅር

የድሃ አደግ አባት የሚስኪኖች ዳኛ
ጻድቅና ቅዱስ ቅን እና እውነተኛ
ትንሳኤና ሕይወት መንገድም የሆነው
የዋህና ትሁት በምክሩ ግሩም ነው
ማን እንደ የሱስ /4/ ዘለአለም

ቃሉን ስጋ አድርጎ ወደ ምድር የመጣው
የጥሉን ግድግዳ በሞቱ ያፈረሰው
በሚያስፈራ ግርማ ዳግም የሚመጣው
በምድር ሁሉ ላይ በጽድቅ የሚፈርደው
',0),(NULL,'ከልቤ','Yesal1','ከልቤ ኤኤኤ ከልቤ አንተ አመልካለሁ
ፈቅጄ ኤኤኤ ምስጋና ላንተ እሰዋለሁ
የሱሴ ኤኤኤ ለእኔ እንዳንተ ከቶ ማን ነው
ውለታህ አአአ ከአምሮዬ እጅግ በላይ ነው (2)*

ነገሮች ተጣበው መግቢያ መውጫ አጥቼ
ፊቴ እንድትመጣ ጮሃለሁ አብዝቼ
አላሳፈርከኝም ፈጥነህ መለስክልኝ
እንቁቁሽሎቼ ኢየሱስ ፈታህልኝ

ቆይቼ አንተን የሱስ ደጅህ ጠንቼአለሁ
ዘንበል ስትልልኝ በእውነት አይቻለሁ
ምስክር ነኝ ለአንተ ለሰራኸው ስራ
ይኸው አምላኬ ምስጋናህን ላውራ

ማዳን በማይችሉ ከቶ አልታመንም
የአንተን ክብር የሱስ ለማንም አልሰጥም
ይሁን ለአንተ ብቻ ምስጋና አምልኮዬ
እኔ የምወድህ ባለውለታዬ

',0),(NULL,'ተመስገን ልበልህ','Yesal1','ተመስገን ልበልህ ተመስገን ጌታዬ
ተመስገን ልበልህ ተመስገን ጋሻዬ
ባንተ ስንቱን አለፍኩ ጥላ ሆነኸኝ ከለላዬ
ተመስገን ኢየሱስ ባለውለታዬ
ተመስገን ጌታዬ

የሕይወት ውጣ ውረድ ሲገጥመኝ መከራ
አምላኬ እርዳኝ ብዬ ስምህን ስጠራ
ከተፍ ብለህ የሱስ ስንቴ አድነኸኛል
ሀዘኔን ለውጠህ ሰላም ሰጥተኸኛል  
ከተፍ ብለህ የሱስ ስንቴ አድነኸኛል
ሀዘኔን ለውጠህ ደስታ ሞልተኸኛል  

አመጸኛ ሳለሁ ስለኔ መሞትህ
ሞትና ሲኦልን ኢየሱስ መዋጥህ
ታላቅ ነው ውለታህ ነፍሴ የማትረሳህ
  በምስጋና ዜማ ውለታህን ላውሳህ /2/

ታሪኬን ቀይረህ እዚህ አድርሰኸኛል
ስሜንም ለውጠህ እስራኤል ብለኸኛል
እጅግ ይደንቀኛል ባንተ መወለዴ
   ከፍ ከፍ ላድርግህ የሱስ በፍቃዴ /2/
',0),(NULL,'ለአምላኬ አምልኮን','Yesal1','ላምላኬ አምልኮ አቀርብለታለሁ
አዳዲሱን ቅኔም እቀኝለታለሁ
መሰውያን ሰርቼ ስሙን እጠራለሁ
    የከንፈሬን ፍሬ /የምስጋናን መስዋእት/ እሰዋለታለሁ /2/*

ከደመናት አልፎ ያርግ መስዋእቴ
ምስጋናን በዝቶለት ይክበር መድሃኒቴ
መስዋእቱን አሽትቶ ደስ ሚሰኝበት
ሲያንስበት ነው እንጂ መች ለእርሱ በዛበት
  ለአለም ለዘለአለም ክብር ይሁንለት/2/

ለኢየሱስ ፈቅጄ ምስጋናን ስሰዋ
መሰውያን ሰርቼ የእርሱን ስም ስጠራ
ልቤ ሰላም ሞልቶ ደስታ ይሰማኛል
የከበደኝ ሁሉ ገለል ይልልኛል
   ያስጨነቀኝ ሁሉ ይወገድልኛል /2/

የምስጋና ክብር እሰጣለሁ ዛሬ
ዝማሬን እያቀረብኩ የከንፌን ፍሬ
እልልታ ሽብሸባ ጨምሬ አቀርባለሁ
ንጉሴ ነውና እገዛለታለሁ
  ጌታዬ ነውና እሰግድለታለሁ /2/

ከሲኦል ላዳነኝ ከሁለተኛው ሞት
እሰዋለታለሁ በመንፈስ በእውነት
ይገባዋልና ውዳሴ ምስጋና
  ሞቴን ለዘለአለም ኢየሱስ ሽሯልና /3/
',0),(NULL,'ጸሃይና ጨረቃ','Yesal1','ጸሃይና ጨረቃ ሳይጨልሙ
ብርሃናቸውም መስጠት ሳያቆሙ
ቀን ሳለ በብርሀን ልመላለስ
በመንፈስ ቅዱስ ሃይል ወደ ሙላቱም ልድረስ
ከየሱስ ጋር ልነግስ (2)

ለሚጠፉት ነፍሳት ግድ ብሎኝ
ታሟኙ አምላኬ ሃይሉን ሰጥቶኝ
መግባት ይሻለኛል ሳይመሽ ቀኑ
ጨለማ ሳይመጣ በብርሃኑ   (2)

ይህቺ አለም ለነፍሴ አትጠቅመኝም
ለስጋዬ ብሮጥ ትርፍ የለኝም
ሰማያዊው መዝገብ ይሻለኛል
ኢየሱስን ማገልገል ያዋጣኛል (2)

በመንፈስ ቅዱስ ሃይል ተሞልቼ
እለት እለት በጸሎት ተግቼ
ዛሬ ብርሃን ሳለ ልትጋ ልስራ
   እንድነግስ በሰማይ ከእሱ ጋራ (2)

የውስጡ ሰውነቴ ታድሶ
ወደ ፍጹም ሙላት ህይወቴ ደርሶ
ይኸው ጸሎቴና ፍላጎቴ
    ኢየሱስ ሳይመጣ መድሃኒቴ (2)
',0),(NULL,'አቤቱ ድንኳንህ','Yesal1','አቤቱ ድንኳንህ ውስጥ ማን ያድራል
ድንኳንህ ውስጥ ማን ያድራል
   በተቀደሰው ተራራስ ማን ይኖራል /2/*

በቅንነት የሚሄድ ጽድቅንም የሚያደርግ
  ኢየሱስ እርሱ ድንኳንህ ውስጥ ያድራል /2/*

ብልህ እውነት የሚናገር
በአንደበቱ የማይሸነግል
ቀኑን ሙሉ አንተን የሚፈራ
ይኖራል ኢየሱስ በቤትህ ውስጥ
በተቀደሰው /በቅዱሱ/ በጽዮን ተራራ /2/
ከሃጥያት እጅጉ የራቀ
በአለም ምኞት ያልታነቀ
ባለንጀራውን ፍጹም የማይከዳ
ፍቅር ትህትናን የተሞላ
ይኖራል የሱስ ካንተ ጋራ /2/

መማለጃን የማይቀበል
ገንዘብ ባራጣ የማያበድር
በቅን የሚሄድ ጽድቅንም የሚያደርግ
አይታወክም ለዘለአለም
ይኖራል በቤትህ ውስጥ በሰላም /2/

ልቡ በትእቢት ያልታበየ
በእምነት ተስፋውም ከሩቅ ያየ
በአምላኩ ፍርድ ሁሌ ደስ የሚለው
በምስጋና ቃል የሚያከብረው
  ይኖራል ማዳኑን እያሳየው /2/
',0),(NULL,'አደንቃለሁ ስራህን','Yesal1','አደንቃለሁ ስራህን አደንቃለሁ
አደንቃለሁ ስራህን እኔ አደንቃለሁ
ብቻህን ስትሰራ ምስኪኑን ስታስበው
ታሪኩን ስትቀይር /ስትለውጥ/ 
ኢየሱስ አይቸህአለሁ
ስራህን አደንቃለሁ /2/

ምስኪን ከፋንድያ ስታነሳ
ታሪኩ ቀይረህ ድል ስትነሳ
አይተዋል አይኖቼ አወራለሁ
ኢየሱስ አንተን ብቻ አደንቃለሁ
ክብርን በምስጋና እሰጣለሁ
   ደስ እያለኝ ለአንተ ብቻ አጥናለሁ /2/*

በሰዎች ልቦና የማይታሰብ
ይሆናል ተብሎ የማይታለም
ውብ አርገህ ስትሰራው አይቸህአለሁ
ስራህን ኢየሱስ አደንቃለሁ
ሃይል የአንተ መሆኑ አውቃለሁ
ክብር ላንተ ብቻ እሰጣለሁ /2/

ሰማያት በመንፈስህ መዋባቸው
ፍጥረትህ በምድር መብዛታቸው
አቤት ስንቱን ልቁጠር ስንቱን ላውራ
ኢየሱስ ድንቅ ነው የአንተ ስራ
ገንኖ ይታይ ስምህ በአለም ዙሪያ /4/

ለእኔ ያለህ ፍቅር ይደንቀኛል
ውለታህ አምላኬ በዝቶልኛል
ጩኸቴን አድምጠህ ሰራህልኝ
እንቁቁሽሎቼን ፈታህልኝ
    ለዘለአለም ኢየሱስ ክበርልኝ /ንገስልኝ/ /4/
',0),(NULL,'ሲያቅላላ ሊነጋጋ ነው','Yesal1','ሲያቅላላ ሊነጋጋ ነው
ተስፋ መቁረጥ ለምንድ ነው
ጨለማው ብርሀን ይሆናል
በጊዜው ኢየሱስ ይሰራል
ብታምነው/ኚው/ ኢየሱስ ኤልሻዳይ ነው
የሚያቅተው የለም ሁሉን ቻይ ነው /2/*

ያእቆብ በረከትን ያገኘው
ሌሊቱን ሁሉ ታግሎ ነው
ዛሬም ድል ወንድም ያንተ ነው
ታምነህ ጸልየህ ብታየው
አይጥልህም ኤልሻዳይ ነው
   ጥንት የሰራው አምላክ ህያው ነው /2/*

የሐማን ተንኮል ገልብጦ
ለአስቴር ሞገስን ሰጥቶ
ድንቅ ተአምር ለአይሁድ የሰራ
ዛሬም አለ ከእኛ ጋራ
ተስፋ መቁረጥ ለምንድን ነው
  ኢየሱስ ለእኛ ፈውስ ነው /2/*

ለአብርሃም ቃል ኪዳን ገብቶ
ቸርነት ምህረትን ሰጥቶ
ቃሉን ፈጽሞ የታየው
እምነትን የሚያከብር ጌታ ነው
ዛሬም እኛ እርሱን ብናምነው
     በእውነት የሚሰራ አምላክ ነው /2/*
',0),(NULL,'ሀሌሉያ ሀሌሉያ','Yesal1','ሀሌሉያ /4/ ሀሌሉያ /4/
ሀሌሉያ ተመስገን
ሀሌሉያ ተባረክ
ሀሌሉያ ተወደስ
ሀሌሉያ ኢየሱስ ንገስ

እኔስ የምስጋና ቃል እሰዋልህአለሁ
ስለተደረገልኝ ተመስገን እላለሁ
እኔስ የምስጋና ቃል እሰዋልህአለሁ
ኢየሱስ ሆይ በሙሉ ሃይሌ አንተን አከብርህለሁ

ጠላቴን አዋርደህ በእግሬ አስረግጠሃል
ምህረትህ በዝቶልኝ ነፍሴን አድነሃል
የሰላምና የጤና ፈውስና በረከት
ሰጠኸኛል ኢየሱስ ላመስግንህ በእውነት /2/

ያ ታላቁ ስምህ ጽኑ ግንብ ሆኖልኝ
የጠላት ፍላጻ ስምህ መግቶልኝ
እዚህ ያደረስከኝ እኔ ማን ነኝ ኢየሱስ
ላምልክህ ከልቤ ለዘለአለም ንገስ /2/

በሰው ያልተቻለ ኢየሱስ ስምህ ችሎ
ሞት ሲኦል ተሽሮ እዳዬ ተከፍሎ
አቤቱ አምላኬ በምን ቃል ላክብርህ
 በእልልታ በሆታ ኢየሱስ ላመስግንህ /2/
',0),(NULL,'አንተ ታላቅ ነህ','Yesal1','ሃይልህ ብዙ ሲሆን
ጠላቶችህ ቢዋሹብህ
አንተ ታላቅ ነህ
ጌታዬ /ኢየሱሴ/ ሆይ 
     አንተ ግን ታላቅ ነህ /2/*

ሰማይም ይመስክር አንተ እንደፈጠርከው
በቃልህ ተናግረህ ጌታ እንዳጸናኸው
ምድርም ትመስክር አንተ እንደፈጠርካት
በጥበብ አምላኬ እንደ መሰረትካት
አቤት እንዴት ውብ ነህ
አሰራርህ ሁሉ ድንቅ ነው
ግን የአንተ ጠላቶች ብዙ ይዋሻሉ

በሰማይ ላይ ያሉ 
ብዙ ከዋክብት የሚያገለግሉህ አእላፍ መላእክት
በምድር ላይ 
ያሉ በባህር የሚኖሩ ለሰዎች እይታ የማይቆጠሩ
እንስሳ እጽዋቱ ተራራ እና ሜዳ
ማን ነበር ካንተ ጋር ኢየሱስ ስትሰራ

ክረምት እና በጋ 
ንፋሳት አየሩ ጨለማ እና ብርሃን ቀንና ሌሊቱ
የከበረውንም ሰው 
በእጅህ ስታበጀው የህይወትን እስትንፋስ ጌታ ስትሰጠው
ያላንዳች ረዳት ውብ አድርገህ ፈጠርከው
ስራህ ይመስክር ዛሬም ጠላት ዋሽቶብሃል

አንተ ታላቅ ነህ
     ኢየሱስ /ጌታ/ ታላቅ /3/*
',0),(NULL,'አወራለሁ','Yesal1','ሶስት ሺ ነፍሳት በአንዴ እንደመጡ
ኢየሱስን አውቀው እጅ እንደሰጡ
ዛሬም ለነፍሳት እመሰክራለሁ
ወንጌሉን ለአለም እኔ አውጃለሁ

አወራለሁ ስለ ኢየሱስ አወራለሁ
እናገራለሁ ወንጌሉም አውጃለሁ
ስለ ኢየሱስ የምለው አለኝ አወራለሁ
ሞቱን እና ትንሳኤውን ለአለም አውጃለሁ

በወህኒ ላሉት መፈታት ሆኖ
ኢየሱስ ብቻውን በአለም ገንኖ
ማየት እንድችል ድራሻዬን ልስራ
ፍጥረት እንዲድን ወንጌሉን ላብራ

የእውነትን ቃል ምስራች ሰምተው
የአንዱን የአይሁድ ዘር በጃቸው ይዘው
ወደ ኢየሱስ ቤት በአንዴ ይመጣሉ
ዝናውን ላውራ ለእርሱ ይሰግዳሉ

ትንሳኤና ሕይወት ኢየሱስ መሆኑ
እናገራለሁ እኔስ ወንጌሉ
አላፍርም ፍጹም እርሱ ይረዳኛል
ምርኮ አትረፍርፎ ይባርከኛል
',0),(NULL,'ባንተ ነው መዳኔ','Yesal1','ባንተ ነው መዳኔ ባንተ ነው 
ባንተ ነው
ፍጥረቴም በሃይልህ ችሎት ነው 
ባንተው ነው

የእኔ ጽድቅ የመርገም ጨርቅ ነው
በፊትህ የማቀርበው ምንድን ነው /2/*
ኢየሱስ መዳኔ በአንተው ነው
   ምስጋና ክብር ሁሉ ለአንተ ነው /2/*

ያስጨናቂውን ቀንበር ሰበርከው
የዲያብሎስን ስራ ያፈረስከው
አንተ ነህ ኢየሱስ ሞቴን የሻርክልኝ
ከዘለአለም ፍርድ ነፍሴን ያዳንክልኝ

እድፋሙ ልብሴ ተለውጦልኛል
ንጹህ የሆንከውን አስለብሰኸኛል
በምህረትህ ተገናኝተኸኛል
ኢየሱስ ጽድቄ ነህ አንተ አድነኸኛል

የሃይልህ ጉልበት የአንተ ችሎታ
በስጋ አስመጣህ ኢየሱስ የእኔ ጌታ
ሞቴ በሞትህ ተሽሯል ጌታዬ
ዛሬም ላምልክህ በአንተ ነው መዳኔ

የእዳዬ ጽህፈት በመስቀል ጠርቀህ
አንተ አስወገድከው ራስህን ባዶ አድርገህ
ሞትህ ትንሳኤ ሕይወት ሆኖልኛል
መድሃኒቴ ነህ ባንተ ደስ ብሎኛል
',0),(NULL,'እግዚአብሔርን ለሚወዱት','Yesal1','እግዚአብሔርን ለሚወዱት
እንደ ሃሳቡም ለተጠሩት
ነገር ሁሉ ለበጎ ነው ለበጎ ነው
የእግዚአብሔር ስራው ውብ /ድንቅ/ ነው /2/*

ዮሴፍም ወደ ጉድጓድ ውስጥ መጣሉ
እነዚያን ሁሉ መከራዎች መቀበሉ
በግብጽ ሃያላት ጌታ አድርጎ ሊሾመው ነው
ቤተሰቡን ከረሐብ ዘመን ሊያስርፍ ነው
የእግዚአብሔር ስራው ድንቅ ነው

ወደ ባህር ሙሴን ተጨንቀው መጣላቸው
ክፉ ነገር የሚያገኘው ቢመስላቸው
የእርሱ ፈቃድ ግን በንጉስ ቤት እንዲያድግ ነው
ሕዝቡን ከባርነት ቀንበር ሊያላቅቅ ነው
የእግዚአብሔር ስራው ልዩ ነው

ጠላቶቹ ዳንኤልን መክሰሳቸው
ወደ አንበሶች ጉድጓድ ደግሞ መጣላቸው
ዳንኤልን በባቢሎን ከፍ ሊያደርግ ነው
የሃይሉንም ብርታት ጉልበት ሊያስታውቅ ነው
የእግዚአብሔር ስራው ድንቅ ነው

ፍሊስጤሞች ጦርነትን ማወጃቸው
በጎልያድ  ድል  ለማድረግ ማቀዳቸው
ጌታ በጎ አሳብ ለዳዊት አስቦ ነው
በሳኦል ፈንታ ንጉስ አድርጎ ሊሾመው ነው
የእግዚአብሔር ስራው ልዩ ነው
',0),(NULL,'ኢየሱስ ሆይ','Yesal1','ኢየሱስ ሆይ አንተን ትላቁን አምላክ
በመንቀጥቀጥ በፍርሃት 
በማስተዋል በጥበብ የምገዛበትን
አንተን ቅዱስን አምላክ የማመልክበትን
ጸጋን ስጠኝ /2/*

ዘወትር በመንቀጥቀጥ መዳኔን ጠብቄ
ታላቅ መሆንህን ኢየሱስ ሆይ አውቄ
መኖርን እሻለሁ አንተን እየፈራሁ
አምልኮ ምስጋና ክብር እየሰዋሁ /2/

ራሴን ዝቅ አድርጌ ትእቢትን ሳላሳይ
በቤትህ እንድኖር ሆኜልህ አስተዋይ
ጸጋ ያስፈልገኛል ለአንተ የምገዛበት
  ኢየሱስ አምላኬ አንተን ማመልክበት /2/

ሃጥያት ተረከዜ እንዳልይዝ ገትሬ
እህት ወንድሞቼን ከልቤ አፍቅሬ
ዘወትር በንስሃ መዳኔን ልታጠቅ
       ልኖር ጸጋን ስጠኝ አንተን ብቻ እንዳመልክ /2/

የቃልህን ፍቺ ብርሃንህ በርቶልኝ
የመንፈስህ ፍሬ በህይወቴ በዝቶልኝ
ልጓዝ ከአንተ ጋራ እስከ ጽዮን ድረስ
ሁሉን ቻይ ነህና እርዳኝ ጌታ ኢየሱስ /2/


',0),(NULL,'ስጡት ምስጋናን','EbenzerF','በፂዮን ለሚኖር ምስጋና ይገባል
 
   እልልታ ይገባል
 ክብርም ይገባል
በፂዮን ለሚኖር አምልኮ ይገባል
 ዝማሬ ይገባል
ውዳሴ ይገባል
ስጡት ምስጋናን አይነስበት
ስጡት እልልታን አይጉደልበት
ስጡት አምልኮን ይጨመርለት
ለጌቶች ጌታ እልል በሉለት

ክብር አለን ለእርሱ የተገባ
በአምልኮ ዘይት የተቀባ 
በፊቱ ይዘን እንግባ
መልካሙ ሽቶ በፊቱ 
ይርከፍከፍ ለታላቅነቱ 
ያውደው ይሽተት መቅደሱ
ኦሆሆ በማደሪያው ኦሆሆ ይቀበለው
ኦሆሆ የምስጋና እጣን ኦሆ ለእርሱ ይሽተተው

የስጦታ ሳጥኔን እከፍታለሁ*2
ለልዑል አምልኮዬን አመጣለሁ*2
ክብር የተባለ ክብር ሞገስ የተባለ ሞገስ
ላምጣለት ለእየሱስ
ምንም አንድም ሳይቀር ልጣል ዙፋኑ ስር
ለአምላኬ ክብር

ተነስ በገናዬ ተነስ ማሲነቆዬ
ልዘምር በክብሬ ለእየሱስ ጌታዬ
ዙፋኑም ይኖራል ዘላለም በልቤ
ወድጄው እኖራለሁ በፍፁም ሀሳቤ

ልቤ ጨከነ ነፍሴም ጨከነች

ጨከነ የሱስ አምላክ ነው እያለ
ጨከነች ምስጋና ይሁን እያለች

',0),(NULL,'አለሁ በለኝ እና ','EbenzerF','በመጎብኘትህ ውስጤን ጎብኘው
በመገኘትህ በለኝ አለሁ
ድምፅህ ሲርቀኝ እፈራለሁ 
ያላንተ ውዴ ውስጤ ባዶ ነው
ተናገረኝ ጌታ ያሻህን

ተናገረኝ አንተ የወደድከውን
ድምፅህን እንድቀድሞው ልስማ
  ብቻ ካንተ ጋር ልስማማ

1)እንዳላፍር ልቤ በስርዓትህ ይቅና
የቃልሀን ማስተዋልን ስጠኝና
ቀኑን ሁሉ ህግህ ትዝታዬ ይሁን
ያስተምረኝ መንገድህን የቀናውን
ህግህ ለእግሬ መብራት ለመንገዴም ብርሃን ይሁን*4
በብርሃንህ ብርሃንህን አያለሁ
ያሰብክልኝም ቦታ እደርሳለሁ

2)
መገኘትህ ልቤን ደስ ደስ ይለዋል
ጉብኝትህ ነፍሴን እጅግ ያረካታል
ጠረንህም እንደ ናርዶስ ሽቶ ነው
መኖርህን በዚያ ነው የምለየው

ውዴ ሆይ የት ነው ያለኧው*2
እስካገኝህ/ እስኪነጋ ድረስ እፈልግሃለሁ
ውዴ ሆይ የት ነው ያለኧው

አሰማኝ ድምፅህን አሳየኝ ፊትህን
ከጎኔ አትለይ አትራቅ ካጠገቤ
ድምፅህን ልስማውና/ አለሁ በለኝና 
ከዚያ ይረፍ ልቤ
',0),(NULL,'አምላኬ','EbenzerF','ሚደላኝ ቢመስለኝ ከእቅፍህ ወጥቼ
በእጄ የነበረውን በሙሉ አጥፍቼ
ከእሪያዎች ጋራ ሆኖብኝ እራቴ
ኸረ እኔስ ናፈቀኝ ያ ጉያህ አባቴ
ደግሞ ሲሞግተኝ የለመደው ልቤ
መጥቶ ድቅን ሲል ያ ፍቀርህ በሃሳቤ
ክፍት ይለገኝና ይፈሳል እንባዬ
የገፋሁት ፍቅርሀ እቆጨኝ አባዬ
አምላኬ*3 እላለሁ
ግራ ገብቶኝ ማደርገው
ሲጨልምብኝ/ ገደል ሆኖብኝ ዙሪው
የሱሴ*3 እላለሁ
ሲናፍቀኝ ጠረንህ
መግባት ሲያምረኝ ከጉያህ

ካንተ ወዲያ ኑሮ ለኔ መች ይመቻል
ቢሞላም ባይሞላም እቅፍህ ይሻላል
የተደገፍኩበት ይደላል ያልኩት
ውሎ እያደር ሲሄድ ዛሬ አፈርኩበት

ከረገጥኩት ማዕድ ካጎረሰኝ እጅህ
በስስት በፍቅር ከሚያዩኝ አይኖችህ

ከክብር መጉደሌ ገባኝ አሁን ገና
ከእርሻዎችህ ልቃርም አንዴ ማረኝና

ከማዕረግ ቤቴ ማዶውን መውደዴ

የማተርፍ መስሎኝ ድርሻዬን መውሰዴ
ብቻዬን አስወራኝ ቢበዛ ቁጭቴ
ባሪያህ እንኳን መሆን ክብር ነው አባቴ
ዛሬ ከሩቅ ሆኜ ሳስብ ስለ ትላንት
ፀፀት አሰቃየኝ በዝቶብኝ ናፍቆት
እንደ ልጅም ባይሆን ባሪያህ አድርገኸኝ
ብቻ በቤትህ ውስጥ ካንተ ጉያ ልገኝ
    በቃኝ*2 ልመለስ
 እግሬን ከጥፋት መንገድ ልመልስ
   
እንደቀድሞው ልጅህ ባልሆን እንኳን
 ከሚያገለግሉህ እንደ አንዱ ልሁን 
 
 
',0),(NULL,'ልዩ ነው','EbenzerF','ማዕበሉ ሲበረታ ወጀብ በዝቶ ሲያናወጥ
የሚረዳ አንድም ጠፍቶ ጩኧት ለቅሶ ሲበረክት
 ድንገትም ከተፍ አለ በውሃው ላይ እየተራመደ
ነፋሱን አንዴ ሲያዘው ልቤ በእርሱ ተጓደደ

ደረሰልኝ እየሱስ ደረሰልኝ ጌታዬ
እንባን ከአይኔ ሊያብስ ማቄን ሊቀድ ከላዬ
ደረሰልኝ እየሱስ ደረሰልኝ ጌታዬ
ሸክሜን ሊያራግፍ ሊያርቅልኝ ከላዬ
ማዕበሉን ፀጥ ወጀቡን ዝም አሰኘው
በእውነትም የእኔ ጌታ እርሱ ልዩ ነው

ልዩ ነው የእኔ ጌታ/እየሱስ ልዩ ነው*2
ድንቅ ነው የእኔ ጌታ/ እየሱስ ድንቅ ነው*2

በውሃው ላይ የሚራመድ ወጀቡንም የሚያዘው
ሁሉም የሚታዘዙለት በእውነት እርሱ ከቶ ማነው
 ብዬ በልቤ ስገረም ይባስ ብሎ አስደነቀኝ
 እኔንም ደግሞ እንደርሱ በባህሩ አራመደኝ

ማዕበሉን ፀጥ ወጀቡን ዝም አሰኘው
በእውነትም የእኔ ጌታ እርሱ ልዩ ነው

ልዩ ነው የእኔ ጌታ/እየሱስ ልዩ ነው*2
ድንቅ ነው የእኔ ጌታ/ እየሱስ ድንቅ ነው*2

ችሎታው ልዩ*2
ብርታቱ ልዩ*2
ማዳኑ ልዩ*2
እየሱስ ልዩ*2
',0),(NULL,'ክብርህን ሳየው','EbenzerF','አልፈልግም ሌላ*2 እኔ አልሻም ሌላ*2
ያንተን ክብር ማየት ይበቃኛል
ከፍ ብለህ  ማየት ይበቃኛል
በውበትህ ማየት ይበቃኛል
ያንተ ክብር ያለበት እርሱ ያጠግበኛል

ኑሮ እንዲሞላልኝ አይደለም ጩኸቴ
ረጅም ዘመን መኖር ኤደለም ናፍቆቴ
ከአዕላፋት ቀን ይልቅ አንዲት ቀን በክብርህ
እሻለሁ እየሱሴ በግርማህ እንዳይህ

ክብርህን ሳየው እጠግባለሁኝ ክብርህን ሳየው
ክብርህን ሳየው እረካለሁኝ ክብርህን ሳየው
ክብርህን ሳየው እፅናናለሁኝ ክብርህን ሳየው
ክብርህን ሳየው እበረታለሁኝ ክብርህን ሳየው

ስሜ በክብር ከሚጠራበት 
ፍሪዳ ሞልቶ ከተረፈበት
ከሚኮሩት ጋር በነውራቸው
ከሚያስቀምጡኝ በከፍታቸው
ጥሬ እየቆረጠምኩ ክብርህ ባለበት
እየሱስ አየሱስ በሚሸትበት
በክብርህ ውበት ዙፋንህን ሳይ
ጥግብ እላለሁኝ በበረሃው ላይ
',0),(NULL,'አንተ ለኔ','EbenzerF','በምደራዊው ውበት ከቶ አትመዘንም
በጠቢባን እውቀት አንተ አትወሰንም
በብርና እንቁ እኔ አልመዝንህም 
ከፍ ካሉት ጋርም አላስተያይህም
አንተ ለኔ ከሁሉም በላይ ነህ*6

ትልቅ ነን የሚሉ በሙሉ ሲጠፉ
ነገስታት በዘመን ብዛት ሲቀየሩ
ሃያላን ሀይላቸው በቶሎ ሲደክም
አንተን ሚመስልህ ግን እኔ አላገኘሁም
አንተ ለእኔ ከሁሉም በላይ ነህ

2)
ውብ እንዳንተ ማነው የውበት መደምደሚያ
ክብር ከተባለ የክብር መፍለቂያ
የትልቅነት ጥግ ጫፉ ላይ ቆመሃል
ከሁሉም በላይ ነህ ክብር ይገባሃል

ይገባሃል*8
ምስጋናም ይገባሃል
አምልኮም ይገባሃል
ስግደትም ይገባሃል
ሙገሳም ይገባሃል

ለጌትነትህ ምስጋናን እሰጥሀለሁ
ለአምላክነትህ አምልኮን እጨምራለሁ
ከሀይልህ በታች እራሴን አዋርዳለሁ
ደስ እያለኝ ከልቤ አመልክሃለሁ

አመልክሃለሁ*2
አከብርሃለሁ*2
አነግስሃለሁ*2 
እወድሃለሁ*2
',0),(NULL,'መባረክን ባርከኝ','EbenzerF','ፊትህ መጥቼ አንተ ጋር
የልብ የውስጤን ላወጋህ
የምለምንህ ብዙ አለኝ
እባክህ ባዶዬን አትመልሰኝ
 መባረክን ባርከኝ ድንበሬንም አስፋው
እጅህ በእኔ ትሁን ይህን ነው የምሻው
እሻለሁ ባንተ መባረክን 
እሻለሁ ባንተ መጎብኘትን
እሻለሁ ባንተ መዳሰስን
እሻለሁ ባንተ መነካትን

በበረከትህ ና ተገናኘኝ
ካንተ ጋር ልቆይ ስትታገለኝ
ማንነቴንም ስሜን ቀይረው
እባክህ እየሱሴ ድንበሬን አስፋው

 አንድ ጊዜ ጎብኘኝ አንድ ጊዜ
 አንድ ጊዜ ዳሰኝ አንድ ጊዜ
 
አንድ ጊዜ አስበኝ አንድ ጊዜ
አንድ ጊዜ ንካኝ አንድ ጊዜ

ስትነካኝ አንተ ታፀናኛለህ 
ስትነካኝ አንተ ታበረታኛለህ
ስትነካኝ አንተ ትለውጠኛለህ
ስትነካኝ አንተ ትፈውሰኛለህ
 


ንካኝ እየሱስ ንካኝ
ንካኝ በእጆችህ ንካኝ

ንካኝ አምላኬ ንካኝ
ንካኝ እንድትፈውሰኝ/ እንድትለውጠኝ
',0),(NULL,'ከለየኸኝ','EbenzerF','ከለየኧኝ ለፈቃድህ/ ለአላማህ
ልትከብርብኝ ሆኖ ሃሳበህ
ፅኑውን ልቤን ካሸነፍከው
የፍቅርህ ባሪያ ካደረግከው
ስጋዬም ድክሞ እንዳይጥለኝ
ምበረታበት ፀጋን ስጠኝ
ፀጋ*2 በብዙ አለ አንተ ጋር
ፀጋ*2 እንዳገኝ ልቅረብ ልጠጋህ

1)
ለትልቅ አላማህ ስትለየኝ
ፈቃድህን ልትፈፅም ስትመርጠኝ
ማንነቴ ስቦህ አይደል አውቃለሁ
በታናሹ መክበር ያንተ ምርጫ ነው
በኔ ልትከብር ከወሰንክማ
በህይወቴ ካለህ መልካም አላማ
ፈቃዴን ውሰድ ያንተ አድርገው
ፀጋህን ላክልኝ ሚያበረታውን

2)ከአለም ዝናና ባለጠግነት 
የሚልቅ ክብር ባንተ መመረጥ
ለገባው እርሱ ማትረፊያው 
የክብርህ ዕቃ ለሚሆነው
ይብዛልኝ ፀጋህ በላይ በላይ
እንድበረታ ድካሜ ላይ
ስጋና አለምን የማሸንፈው
በፀጋህ ብርታት ፀንቼ እኮ ነው
',0),(NULL,'ታምኜው ወጥቻለሁ','EbenzerF','ሁሉን ጥዬ የወጣሁት አልፈልግም ብዬ
የጠራኝን ታምኜው ነው በእየሱስ ጌታዬ
ተስፋን የሰጠኝ የታመነ ነው ይፈፅመዋል
እርሱን ላመነው ምርኩዝ ላደረገው በድል ያቆማል
ታምኜው ወጥቻለሁ እርሱን ታምኜው
ሀሳቤን ትካዜዬን በአምላኬ ላይ ጥዬው

ልቡን በእርሱ ላይ ያኖረውን ሰው
መች ይተወዋል ፍፁም ሳይክሰው
ይልቅ ይተጋል ቃሉን ሊፈፅም
ሳያከናውን ጀንበር አትጠልቅም

ሚቆይ ቢመስል እንኳን እርሱ ከቶ አይረፍድበት
ሁኔታን ያሳመራል ተስፋ በቆረጡበት   
ለእኔም መታመኛዬ የዘላለም አምላክ ነው
በሞት ጥላ እንኳን ብሄድ ሁሌም ከኔ ጋር ነው

ከእኔ ጋር ስላለ *2 
አልጥልህም ብሎ በራሱ የማለ
ታምኜው ወጥቻለሁእርሱን ታምኜው
ሀሳቤን ትካዜዬን በአምላኬ ላይ ጥዬው

እግዚአብሔር መልካም ነ ው እግዚአብሔር ለእኔ*4
',0),(NULL,'ፍቅርን ስጠኝ','EbenzerF','በሰውና በመላዕክት ልሳን ብናገር
ተራራውን የሚንድ እምነት በውስጤ ቢኖር
ለድሆች ባካፍል በሙሉ ያለኝን 
ስጋዬንም ለእሳት ምሰጥ እንኳን ብሆን
ይህ ሁሉ በአንድነት ለእኔ ቢደመር
ከቶ አይጠቅመኝም ከሌለኝ ፍቅር
ፍቅርን ስጠኝ ጌታዬ ፍቅርን ስጠኝ
ፍቅርህን አብዛልኝ እየሱሴ እርሱ ነው የሚጠቅመኝ

የሁሉ ማሰሪያ የሆነውን ፍቅርን ስጠኝ
በእውነት ደስ የሚለውን ፍቅርን ስጠኝ
የሚታገስ የማይቀናውን ፍቅርን ስጠኝ
በደልን የማይቆጥረውን ፍቅርን ስጠኝ

በሀዘኑ ሳላዝን በደስታው ሳልስቅ
ሳልካፈለው የወንድሜን ጭንቅ
ላየሁት ለማውቀው ፍቅርን እየነፈግኩኝ
አንተን እወድሃለሁ እንዴት እላለሁኝ 

ለይምሰል ያልሆነ ፍቅር
በኑሮዬ አንተን እንዳስከብር
ፍፁም የሆነውን ፍቅርህን አብዛልኝ
ራስ ወዳድነትን ከእኔ አርቅልኝ

በወንድማማች መዋደድ ልበርታ
በጠላቴ ሽንገላ እነዳልረታ
ዘመኑን ልዋጀው በመንፈስ መርምሬ
ፍቅርህን ልታጠቅ ከቀድሞው ጨምሬ
',0),(NULL,'ገርሞኛል እኔ ','EbenzerF','ስራህ ግሩም ነው ፍፁም እንከን የለው
የቱን አንስቼ የቱን እተዋለሁ
የሰው አንደበት ከቶ አይገልፀውም 
የቃላት ብዛት አይጨርሰውም
አቤት ምን እላለሁ ምን እመልሳለሁ
እጄን በአፌ ጭኜ እኔ እገረማለሁ
አቤት ምን እላለሁ ምን እመልሳለሁ
ስራህን እያሁ እባርክሃለሁ
ገርሞኛል እኔ ደንቆኛል እኔ
አደራረግህ ልዩ ነው ለኔ

እኔን የሚያስገርመኝ ሁሌም የሚያስደንቀኝ የአንተ አሰራር
የደግነት ሁሉ የበጎነት አባት ፍቅር ነው ነገርህ
ባላሰብኩት ሰዓት ሁሌ እየደረስክ ታስደምመኛለህ
አቤት የኔ ጌታ ምን ብ ልግለፅህ በእውነትም ልዩ ነህ

ልዩ ነህ ጌታ የምታስደንቅ
እንቁ ወይ ከርቤን አይመጥንህም
በእርግጥ አውቃለሁ እነደማይበቃህ
ያለኝ ይኼ ነው ተቀበል እንካ

ልቤን የሞላው ምስጋና ነው ተመስገን እላለሁ
ባይመጥንህም ተቀበለው የኔ ስጦታ ነው
ኦ! ስራህ አስገርሞኛል ተገርሜያለሁ
ኦ! ስራህ አስደንቆኛል ተደንቄያለሁ

ድንቅ ነህ የሚለው ቃል ስለሚያንስብህ ሌላ ምን ልበልህ
ልዩ የሚለውም ቢሆን አንተነትህን ፍፁም አይገልፅም
ልዩ ነህ ድንቅ ነህ ደጋግሜ ብልህ እባክህ አትሰልችብኝ
የልቤን መደነቅ የነፍሴን ግርምታ እንዴት ልግለፅልህ
',0),(NULL,'ክርስትና','EbenzerF','እርዳኝ አቤቱ አንተን እንድፈራ
እርዳኝ አቤቱ እንድኖር ካንተ ጋራ
አለምና ምኞቱን ልካድና
ልኑር የእውነተኛውን ክርስትና
ክርስትና*2 ካንተ ጋር የመጣበቂያው ጎዳና
ክርስትና*2 አንተን መስሎ የመኖሪያው ጎዳና
ክርስትና*2 ህግህን የመጠበቂያው ጎዳና
 ክርስትና*2 ድምፅህን የመከተያው ጎዳና

1)
ሁሉ ሞላልኝ ፀጋ በዛልኝ ብዬ ብመካ ህይወት ሳይኖረኝ
ደዌው ቢፈወስ እውር ቢበራ በእጄ ታላላቅ ተዓምር ቢሰራ
በስምህ አጋንንት ጮኸው ቢወጡ የገሃነም ደጆች ቢናወጡ
መንገዴ በፊትህ ፍፁም ካላማረ የለፋሁት ልፋት ሁሉ መና ቀረ

አደራህን ጌታ አደራህን እየሱስ
በመንፈስ ጀምሬ በስጋ እነዳልጨርስ
አደራህን አባ አደራህን እየሱስ
በብርታት ጀምሬ በድካም እንዳልጨርስ

2)ካንተ ጋር ስኖር ስከተልህ ቀሪ ዘመኔን ላንተ ስሰጥህ
ሌላ አልፈልግም ሁሉም ይቅርብኝ መንፈስህን ድን አትውሰድብኝ
ድካም ሲጀምር መዛል ሲመጣ የቀድሞው ሀይል ዛሬ ሲታጣ
እኔን ደግፎ የሚያቆመኝ መንፈስህ እኮ ነው ሚያበረታኝ

ስጠኝ መንፈስህን ሚያበረታኝን
ስጠኝ ፀጋህን ሚደግፈኝን
እግሬን አፅንቶ ሚያራምደኝ
እስከ ፂሆንም ሚሸከመኝን

መንፈስህን በእጥፍ ጌታዬ አብዛልኝ
ዘይቴ ከማሰሮው ጎድሎ እንዳይገኝ
አንተን የማስከብር ታማኝ ባሪያ አድርገኝ
መቅረዜ እንደበራ ስጠብቅህ ልገኝ
',0),(NULL,'አንተን ብቻ እያየሁ','EbenzerF','አይኖቼን ከሚታየው ነገር አንስቼ
በሰጠኸኝ ተስፋ በእምነቴ በርትቼ
ደመናና ንፋሱን መጠበቄን ትቼ
ግራ ቀኝ ሳልል ወደ አንተ አቅንቼ
አንተን ብቻ እያየሁ በትዕግስት እኖራለሁ አንተን ብቻ እያየሁ 
  አንተን ብቻ እያየሁ እጠብቅሃለሁ አንተን ብቻ እያየሁ 
አንተን ብቻ እያየሁ ተስፋ አደርግሃለሁ አንተን ብቻ እያየሁ 
አንተን ብቻ እያየሁ በእምነት እኖራለሁ አንተን ብቻ እያየሁ 
  
አምናለሁ ሸለቆዬ ይሞላል
አምላኬ ከቶ ምን ይሳንሃል
ላታደርግ አንተ አትናገርም
አንደበትህ ሽንገላን አያውቅም
ሀሰት አትናገርም 

ከማድጋው ዱቄቱ እንኳን ቢያልቅም
ዘይቱ በማሰሮው ውስጥ ባይኖርም
ጎዶሎዬን እያየሁ አልቆዝምም
ችሎታህን አልጠራጠርም
  ተስፋን በአንተ አልቆርጥም

ቢጎድል ባይጎድል እኔ አላማርርም
ዘገየብኝ ብዬ አላጉረመርምም
ነገሬን በጊዜው ውብ ታደርገዋለህ
በትዕግስት ልጠብቅ አምላኬ ታምኝ ነህ

ለኔ ታማኝ ነህ አንተ*3
ለኔ መልካም ነህ አንተ*3
ለኔ በቂ ነህ አንተ*3
',0),(NULL,'ስራኝ','EbenzerF','ስራኝ እንደወደድከው
ስራኝ እንደፈለግክው
ስራኝ አንተ እንዳሻህ
ስራኝ እንደፈቃድህ
ህይወቴ በእጅህ ነው እንዳሻህ ልታደርገው
እራሴን በፈቃዴ ላንተ ሰጥቼሃለሁ
ስራኝና ህይወቴ ይለወጥ
ስራኝና ለፈቃድህ ልሩጥ
ስራኝና እኔነቴን ለውጠህ
ስራኝና አኑረኝ ለክብርህ

ሸክላ በሸክላ ሰሪው እጅ ከቶ ምን ስልጣን አለው
ይችላል ከወደደ ሊሰራና ሊያፈርሰው
ሲያሻው የክብር እቃ ሲያሻውም ለውርደት
ሊያደርገው ይችላል ከልካይ የለበት
እኔም ይኧው በእጅህ አለሁ
የክብርህ እቃ መሆን እሻለሁ
ሰርተህ አንተው ክበርብኝ
ልብህ በእኔ  ይረፍብኝ

አውጣው ያልተመቸህን ያላስደሰተህን
ለኔ በረከት መስሎ ሊያጠፋኝ ያለውን
አይኑር ከቶ በህይወቴ አንተን የሚያሳዝንህ
ወድ ልቤ እንዳትመጣ ከእኔ የሚያርቅህን
አውጣው ከህይወቴ ንቀልልኝ
ክፉ መርገም ከሚያመጣብኝ
ከቶ ላይረባና ላይጠቅመኝ
ከንቱ ልፋት ከሚሆንብኝ
',0),(NULL,'እየሱስ ጌታ ነው','EbenzerF','እመሰክራለሁ እየሱስ ጌታ ነው
እኔ እናገራለሁ/ አውጃለሁ እየሱስ ጌታ ነው
በከበደኝ/ በማዕበሉ ላይ እየሱስ ጌታ
ባስጨነቀኝ/ በወጀቡ ላይ እየሱስ ጌታ
ባስለቀሰኝ/ በእሳቱም ላይ እየሱስ ጌታ
ጌታ ነው የጌቶች ጌታ**5

አዋጅ በእኔ ላይ ቢወጣ በንጉስ ማህተም ቢታተም
ጌትነቱን ከመመስከር ወደ ኋላ ከቶ አልልም
በእሳት በወጀቡም ላይ ማመልከው የሱስ ጌታ ነው
የአናብስትን አፍ ይዘጋል በስሙ አጓደዳለሁ

የሞተ ቢመስል እንኳን ነገሬ ያበቃለት 
በሰው ዘንድ ተስፋ ሳይኖረው ቀን የተቆረጠለት
ለእየሱስ ከባድ የሆነ አንዳች ከቶ የለምና
ሁሉንም ያሳምረዋል ታሪክ ይገለብጥና

የአንበሳ ጉድጓድ እንኳን ቢጥሉኝ 
እየሱስ ጌታ ነው እላለሁ
የእቶን እሳቱን በእጥፍ ቢነዱት
እየሱስ ጌታ ነው እላለሁ
የሚከልለኝን እርሱን እያሰብኩ
እየሱስ ጌታ ነው እላለሁ
ተማምኜበት አንዴም ስላላፈርኩ
እየሱስ ጌታ ነው እላለሁ
',0),