INSERT INTO `lyric` (`_id`, `lyric_title`, `lyric_album_id`, `lyric_actual_lyric`, `lyric_is_fav`) VALUES  (NULL,'ትመለካለህ ከሁሉ በላይ','Aylew1','በክብርህ ላይ ክብርን ደርበህ
ከፍ ካለው በላይ ከፍ በል
ትመለካለህ ከሁሉ በላይ
የለም ሚመስልህ የሱስ ኤልሻዳይ /2/ 2

ጌታ ነህ ከሁሉ በላይ ኤልሻዳይ
እኩያ አቻ የለህም አንተን መሳይ
ዙፋንህ አይገረሰስ እስከዘላለም
በሰማይ በምድር እንዳተ የለም /2/

ስልጣኑ በሰማይ በምድር ያንተ ነው
ከእጅህ የሚወስድብህ ኧረማን ነው
ያሰብከውና የፈቀድከውን ታደርጋለህ
ተው ባይ የለህም ሚከለክልህ /2/

የክብር የምስጋና ዘውድ ተጭነህ
ጸንተህ ትኖራለህ የሱስ በዙፋንህ
ብዙ ነገስታት ከምድር ወጥቷል
ኢየሱስ አንተ ብቻህን ጸንተሃል /2/
',0),(NULL,'በበደላችን ሙታን ነበርን','Aylew1','በበደላችን ሙታን ነበርን
ይህ ታላቅ ምህረቱ አይገባን
ነገር ግን ከፍቅሩ የተነሳ
ሕይወት ሰጠን /2/ በደላችን/ሐጢአታችን 
ፍጹም ተረሳ /2/ 2

ከኢየሱስ ፍቅር ርቀን ነበር
በመስቀሉ ሞት አቀረበን
ስንጠፋ የማይወድ አምላክ
ከወድቅንበት አነሳን
ምህረቱ በዝቶልን ይኸው ለዚህ ክብር በቃን /2/

ሸክም ከብዶብን ስንሄድ ወደ እርሱ ጠርቶ አሳረፈን
ቀንበር ከጫንካችን ላይ ሰብሮ ቀና ብለን እንድንሄድ አረገን
ዛሬ ግን ይኸው ተፈተን የሱስን እናመልካለን
ምህረቱ በዝቶልን ክበር ንግስ እንለዋለን /2/

ማንም ሊከፍል ማይችለውን እዳችንን ከፈለልን
ከሳሻችን አሳፍሮ የመንግስቱ ወረሽ አረገን
ከንግዲህ የሚቃወመን ማን ነው እስኪ ይነሳ
ሞታችን በሞቱ ሽሯል ኢየሱስ የይሁዳ አ
',0),(NULL,'ለሚስኪኖች ይራራል','Aylew1','ሰብሳቢ ነው ኢየሱስ እረዳት ያጣውን
ፍጽሙ እረፍት አጥቶ የሚባዝነውን
ከወዴት ይገኛል እንደ እርሱ አፍቃሪ
ለሚስኪን የሚያዝን ርሁሩህ መሃሪ /2/

ለሚስኪኖች ይራራል /3/ 2
እንደ የሱስ የት ይገኛል /2/
ምህረቱ በዝቶልኛል ቸርነቱበዝቶልኛል /2/

የነፍሴን መጨነቅ እረሃብዋን አይቶ
ልመና ጭንቀቴ ጸሎቴንም ሰምቶ
ደረሰልኝ ኢየሱስ ጥማቴን ሊያረካ
ሃዘኔን ለወጠው በደስታ ተተካ /2/

በሰው የተረሳ ያበቃለትን
ዋጋ የለውም ተብሎ የተጣለውን
የሱስ እንደ ሰው አይደል ለሚስኪን ይራራል
እኔንም ይኸው ሰው አርጎኝ ለክብሩ አቁሞኛል /2/

አስታዋሽ አባት ነው ማንን ረስቶ ያውቃል
እንደ ሰው አይደለምሁሉን እኩል ያያል
ደካማን አይንቅም ቸር ነው ይሸከማል
ኧረ እንደ ኢየሱስ ከቶ ይገኛል /2/
',0),(NULL,'ከልቤ አመልክህለሁ በልቤ','Aylew1','አለኝ ጌታ የሚራራ
በመልካም ፍቅሩን እኔን የሚመራ
ሞቴን በሞቱ የሻረልኝ
አመልከዋለሁ ጌታ የሱስን
ከልቤ አመልካለሁ/እሰግዳለሁ/-
እዘምራለሁ/እልል እላለሁከልቤ /2/

ቢዘረዘር አያልቅም የሱ ስራ
ውለታውን ብቆጥር በየተራ
አልዘልቀውም ዝም ብዬ ላመስግነው
ሌላ የለኝም ለየሱስ የምከፍለው /2/

ነፍሴን ካዳኝ ወጥመድ እያዳነ
በምህረቱ ሕይወቴን የከለለ
አሻገረኝ ማዕበሉን በእጁ ይዞ
ኤልሻዳይ ነው ኢየሱስ ምን ተስኖት /2/

አይሆንልኝም ከእርሱ በቀር ሌላ ማምለክ
መስዋእቴን ለጣኦት ከቶ አልሰዋም
መሰውያዬ አንድ ነው ለእርሱ ሰዋለሁ
መልካሙ መአዛ ምስጋናዬ ያውደው /2/
',0),(NULL,'አሁንስ ተስፋዬ ማን ነው?','Aylew1','ተስፋ ስቆርጥ ፍጹም ሳዝን
ያለረዳት በከንቱ ስባዝን
ድንገት ደርሰህ አሳረፍከኝ
የዘላለም ሕይወት በነጻ ሰጠኸኝ /2/

እኔስ ተስፋዬ ማን ነው
ትምክህቴ የሱስ ባንተ ነው
ማን አለኝ ያላንተ ኢየሱስ
በችግሬ ለኔ ፈጥኖ የሚደርስ /2/

ሌላ ረዳት ያላንተ የለኝም
እንዳንተ የሚሆን ለኔ አይገኝም
ባንተ ብቻ ኢየሱስ እመካለሁ
ካንተ ውጭ ሌላ የከንቱ ከንቱ ነው /2/

ችግሬንም ላንተ ነው የማዋየው
የሱስ ካንተ ሌላ የሚቀርበኝ ማን ነው
ለእኔ ወዳጅህ ነኝ የሚስጥር ጓዳዬ
ካንተ አልለይም የሱስ እረኛዬ /2/

ሁሉን ክጄ አንተን ይዣለሁ
የሕይወት ውሃ ነህ ባንተ ረክቻለሁ
እገዛልህ አለሁ በቀሪው ዘመኔ
ኢየሱስ እንዳተ አይገኝምለኔ /2/
',0),(NULL,'እንዳንተ ያለ ለኔ','Aylew1','እንዳንተ ያለ ለኔ እንዳንተ ያለ /2/
ወድቄ ሳለሁ ኢየሱስ አይተኸኝ
በፍቅር አጥበህ ከትቢያ አነሳሀኝ
ጸጋና ምህረትህን ለኔ በዝቶልኝ
እግሮቼን በቤትህ አጸናህ ተመስገን /3/

የልመናዬን ድምጽ ሰምተህ ዝም አትልም
ሆድህ ለኔ የሱስ ፍጹም አይጨክንም
የለመንኩህን ሁሉ ነስተኸኝ አታውቅም
ባለውለታዬ ነህ ለኔ እንዳተ የለም /2/

የችግሬ ደራሽ ለኔ መጽናናዬ
ሳዝን ተስፋ ስቆርጥ አይዞህ ባይ ጌታዬ
ብዙ ውጣ ውረድ ባንተ አልፌአለሁ
በምህረትህ ብዛት እዚህ ደርሻለሁ /2/

ሸክሜ ከብዶብኝ ጎብጬ ስራመድ
እግሮቼ ሲሄዱ በሸካረው መንገድ
ከአእምሮዬ ጠፍቶ እውነተኛ ሰላም
ወዳንተ ስመጣ ቀለለኝ የሚሳንህ የለም /2/

ትውልድ ሁሉ ይወቅ አምላክነትህን
ድንቅ እንደሚሰራ ታላቁ ስምህን
እኔስ አይቻለሁ ላንተ ምስክር ነኝ
ቀንበሬን ሰባብረህ ለክብር ስታቆመኝ /2/
',0),(NULL,'የሱስ ማን እንዳንተ','Aylew1','ጸንተህ የምትኖር ለዘላለም በዙፋንህ ላይ
የማትለወጥ አንተ ብቻ ነህ የሱስ ኤልሻዳይ
አልተገኘም አቻ ሚሆንህ የሚመስልህ
ዘመናት ከቶ የማይለውጠው አንተ ብቻ ነህ

ማን እንዳንተ የሱስ ማን እንዳንተ /4/

በየዘመናቱ ተነስቷል ታላላቅ ነን ባዮች
ስማቸው ገነነ በምድር ላይ መፍትሄ አልባዎች
ግን ጸንተው አልኖሩም ጠፍተው ቀሩ ከአለም ላይ
አንተ ብቻ አለህ ሳትለወጥ ኢየሱስ ኤልሻዳይ

መሸሸጊያ አምባ ለሕይወቴ ኢየሱስ አንተ ነህ
በጨነቀኝ ግዜ ስጠራህ ፈጥነህ ትደርሳለህ
በሰላም እኖራለሁ ተደላድዬ አምላኬ በቤትህ
የማትተኛ እረኛ ስላገኘሁኝ ነፍሴ ተመካችብህ
',0),(NULL,'ተማርኪያለሁ በፍቅሩ','Aylew1','ኢየሱስ ያድናል ሲባል ሰምቻለሁ
ዛሬ ግን ሲያጸናኝ በአይኖቼ አይቻለሁ
በስልጣን ይሰራል የሚያግደው የለም
ትናንትና ዛሬም ያው ነው ለዘላለም /2/

ሲወራ አሃ አሃ ሲነገር አሁ አሁ
ዝናውን ሰማሁ /2/
ዛሬ ግን ባይኖቼ ሲረዳኝ አየሁ /2/
ብዙዎች ተመለሱ ወደኋላ አንፈልግም ብለው
እኔ ግን በፍቅሩ ተማርኬ ቀረሁ/አለሁ በፍቅሩ /..../
ከንግዲህ የእርሱ ሆኛለሁ /4/

ሽባ ሲተረተር እውሩን ሲያበራ
ሰምቶ ነበር ጆሮዬ ታምራት ሲሰራ
እኔም በአይኔ አየሁ እድሉ ገጥሞኝ
ልክ ነው ያድናል የሱስ ከፍ ይበልልኝ /2/

ታሪክን በታሪክ ገለብጠው እና
ዘመናትን ኢየሱስ ለዋወጠው እና
እኔም ቀን ወጣልኝ በእርሱ ታይቻለሁ
ለክብሩ ምስጋና ይኸው አዜማለሁ /2/
',0),(NULL,'አምኜው ነው የተከተልኩት','Aylew1','ለሰው ብመስልም አምላክ የሌለው ወዳጅ ያጣሁኝ
ግራ የገባው ተንከራታች ውል የጠፋብኝ
ነገር ግን እንዲህ በጭራሽ አይደል ክብሩ ነክቶኝ ነው
የናዝሬቱ ኢየሱስ በመገለጡ ውስጤን ሞልቶት ነው /2/

አምኜው ነው የተከተልኩት
አንተው ብቻ ነህ ጌታዬ ያልኩት
ተረድቸው ነው የማመልከው
እሱ ብቻ አምላኬ ነው /2/*

በመገለጥ ተራራ ላይ
የክብሩ ጸዳል ሲያበራ
አይኖቼ ክብሩን አይተወታል
የሱስ በውስጤ ታትሞ ቀርቷል
ጠላት ብዙ ቢል እኔ ምን ቸገረኝ
የማመልከውን አውቃለሁኝ /3/

ቀንበሬ ሰብሮ የእዳ ጽህፈቴ - ፍጽም ደምስሰዋል
ነጻ ወጥቼ እኔ እንዳመልከው - ሰላም ሰጥቶኛል
ምን ነካህ አትበሉ ውስጤ ገብቶ ነው - የኢየሱስ ፍቅሩ
የሚያዘምረኝ እንዲህ ምያረገኝ - አይቼ ክብሩ /2/
አምኜው ....
በመገለጥ ...

ስሙ እንደሚፈስ ዘይት ነው ለኔ - በውስጤ ፈሷል
መልካም መአዛ አለው የሱሴ - ፍቅሩ ማርኮኛል
የራሴ አይደለሁም ከንግዲህ የሱ ነኝ - የሱስ ይግዛኝ
በፍቃዴ ራሴን እሰጠዋለሁ - ይጠቀምብኝ /2/
አምኜው .....
በመገለጥ .....
',0),(NULL,'ወድህኛል በዘላለም ፍቅርህ','Aylew1','ወድኸኛል በዘላለም ፍቅርህ
ገዝተኸኛል በቀራንዮ ደምህ
ኢየሱሴ ካንተ የት እሄዳለሁ
ባንተ የዘላለም ሕይወት አግኝቻለሁ /2/

አለም ሳይፈጠር እኔን መርጠኸኛል
የዘላለም ሕይወት የሱስ ሰጥተኸኛል
ባንተ አግኝቻለሁ እረፍትና ሰላም
ቢደላኝ ባይደላኝ ፍጹም ካንተ አልለይም

ባንተ ነው ያማረብኝ ጌታ ኢየሱሴ
ድጋፍና ረዳት ሆንክላት ለነፍሴ
ታሪኬ ተለውጦ ባንተ ሰው ሆኛለሁ
የሕይወት ውሃ አንተን ጥዬ ወዴት እሄዳለሁ

ስንከራተት አይተህ የሱስ ደረስክልኝ
አበሳዬን ወስደህ ለክብርህ አቆምከኝ
መቼ እረሳለሁ ውለታህን የሱስ
ያደረክልኝን እስከ ዛሬ ድረስ

ወላጅ እንደሌለው እኔን አልጣልከኝም
በፍቅር ገዝተኸኛል ፍጹም አልተውከኝም
የምህረትህ ብዛት ይኸው አቁሞኛል
ለእኔ እንዳንተ ሚሆን የሱስ ከወዴት ይገኛል
',0),(NULL,'ያዳነኝ ኢየሱስ ነው ያዳነኝ','Aylew1','አይቼ አሃ አሃ ወደ ተራሮች አነሳሁ
ረዳቴ አሁ አሁ ከስፋርው አጣሁ
ረዳቴ አሃ አሃ ላካስ በሰማይ ነው
ደረሰልኝ አሁ አሁ ተጨንቄ ስጠራው /2/

አይቶ አላለፈኝም ጌታዬ
ሰምቶ ዝም አላለኝም የሱሴ /2/
ያለሁበት ድረስ የሱስ መጥቶ
በፍቅር ወደ እኔ ተጠግቶ
አልጋህን ተሸክመህ ሂድ አለኝ
ማን ነው ከንግዲህ እኔን ሚቃወመኝ
ያዳነኝ ኢየሱስ ነው ያዳነኝ
 አልጋህን ተሸክመህ ሂድ ያለኝ /2/

ለብዙ ዘመን አሃ አሃ በደዌ ስማቅቅ
የሚረዳኝ አሁ አሁ አጥቼ ስጨነቅ
አንድ ወዳጅ አሃ አሃ አገኜኝ እና በድንገት
አይዞህ ልጄ አለኝና ፈወሰኝ በነጻነት /2/

ሰውን ሲረዳ አሃ አሃ እንደ ሰው አይደለም
መልክን ቁመና አይቶ አሁ በፍጹም አያዳላም
ነገር ግን ለተጎዳ ወዳጅ ሆኖ ይረዳል
አፍቃሬ ነው ከልቡ እንደ የሱስ የት ይገኛል /2/
',0),(NULL,'በቃ ሲል አበቃ','Aylew1','በቃ ሲል አበቃ ችግሬን ረሳሁት
እንዳለፈ ውሃ ሲፈስ ሲሄድ አየሁት
የሱስ ሸክሜን ወሰደው 
ዛሬይኸው ነጻ ሆኜ ስሙን አከብራለሁ /2/

ከጎኔ አለኝ የምለው አንዳች ረዳት ባጣ
ችግሬን ሚካፈል ከልቤ ማይወጣ
የናዝሬቱ የሱስ ብቻ ደርሶልኛል
መከራዬን ወስዶ ነጻ አውጥቶኛል /2/

እኔ የማመልከው ከሁሉ ይበልጣል
ተሸንፎ አያውቅም ሁሉን አሸንፏል
ታምኜ አላፈርኩም አንድ ቀን በየሱስ
በሁሉ ረድቶኛል የሰላሙ ንጉስ /2/

ሁሌ ምዘምረው ስለ እርሱ ውለታ
ረድቶኝ ስለአየሁ ነው የሱስ የኔ ጌታ
ዛሬም ዘምራለሁ ለክብሩ በእልልታ
ተስፋ ቆርጬ ሳለሁ ደርሶልኛልና /2/

ምንም በሌለበት ተስፋ ባጣሁበት
ሳላስበው መጥቶ ሆነልኝ ረዳት
ለኔ አለኝ የምለው ከእንግዲህ እርሱ ነው
በሌላ አልመካም በእርሱ እመካለሁ በአምላኬ እመካለሁ
',0),(NULL,' እሱን ታምኖ','Aylew2','እሱን ታምኖ ማን አፈረ
የሱስን ይዞ ማን ወደቀ/2/
ይታመናል እንጂ ጌታ ይታመናል እንጂ
ይታመናል እንጂ የሱስ ይታመናል እንጂ /2/

ዘመናት አይለውጡትም አመታት አያስረጁቱም
በሰማይ ዙፋኑ ላለው ብቻውን ገዢ ለሆነው
ለሱ እዘምራለሁ /4/

ከአፉ ለወጣው ቃል የሚጠነቀቅ
የታመነ አምላክ ለሰው የማይንቅ
የዘለአለም ጌታ በቃሉ የማይዋሽ
እውነት የሚናገር ከቶ ማይነገር /9/

ሰማይን ዘርግቶ ምድርን ያጸና
ሁሉን የፈጠረ እርሱ ነው ገናና
ፍጥረትን በእልፍኙ ሰብስቦ የያዘ
ጌታ ነው በአለም ላይ ሃያል የታመነ /9/

ሲታመኑት ታማኝ ሲጠጉት የማይጥለው
ሁሉም እኩል የሚያይ ሲያምኑት ታማኝ
እርሱ በእውነት ጠርቶ ያፈረ ማን አለ
የማያሳፍር ነው ኤልሻዳይ/ ሁሉምቻይ/ የሆነ /9/
',0),(NULL,'አንተ ነህ ማእረጌ','Aylew2','ክብሬ ማእረጌ ክብሬ ማእረጌ ነህ /3/
ባንተ ነው ያማረብኝ ባንተ ነው
ባንተ ነው ሰው የሆንኩኝ ባንተ ነው
ባንተ ነው እዚህ የደረስኩኝ ባንተ ነው
ባንተ ነው እረፍት ያገኘሁኝ ባንተ ነው

አንተ ነህ ማእረጌ ክብርን ያየሁብህ
ሙርኩዜ ነህ የሱስ የተደገፍኩብህ
መሸሸጊያ ሆንከኝ በመከራ ጊዜ
ሁሉን ባንተ አለፍኩ ክበር ኢየሱሴ /2/

እንደ ሰው አንተን ጊዜን አይለውጥህም
ፊትን አይተህ የሱስ አንተ አታዳላም
ምስኪኑን ከትብያ ከአመድ ምታነሳ
ታናሹን ቀብተህ ታምር የምትሰራ /2/

ታግዛለህ ሲባል ሰማሁ ደካማውን
ካንተ እጅግ ርቆ የሚቆዝመውን
እኔም አይቻለሁ ፈጥነህ ስትረዳኝ
በዘይት ቀብተህ ለክብር ስታበቃኝ /2/
',0),(NULL,'አይረፍድብህም ','Aylew2','ስትነሳ አሃሃሃ ብትዘገይም
ስትደርስ ግን ጌታዬ/የሱሴ አይረፍድብህም /2/
ነገርን ሁሉ በጊዜው ውብ አርገህ ትሰራለህ
የሚመስልህ የለም የሱሴ እውነትም ኤልሻዳይ ነህ /2/

(አዝ.) አይረፍድብህም ጌታዬ/የሱሴ አይረፍድብህም /4/

ነገሮች ሁሉ ቢለወጡ - አንተ ግን አትለወጥም
ሁሉም ነገር በጊዜው - ትሰራለህ ሚመስልህ የለም
ደረቁን በትር የሱሴ - በመንፈስ ታለመልማለህ
ዘመናት ሁሉ አይለውጥህም - አልፋና ኦሜጋ አንተ ነህ

በስራህ ሁልጊዜ ፍጹም - በጭራሽ አትሳሳትም
እንዲህ አደረግ ተብለህ - የሱሴ አንተ አትታማ
በሞት አፋፍ የደረሰውን - በሕይወት ታኖረዋለህ
ታሪኩን ሁሉ ለውጠህ - ለክብርህ ታቆመዋለህ

ተስፋ አጥቶ ለሚንከራተት - በተስፋ ታኖረዋለህ
የተረሳውን አስታውሰህ - በቤትህ ታከብረዋለህ
መዛግብትህ ሁሉ ቢገለጥ - ታሪክ ሁሉ ቢመረመር
በምድር ላይ ፍጹም አይገኝም - ኢየሱስ አንተን የሚመስል
',0),(NULL,'ከሁሉ በላይ ነህ','Aylew2','ከምልህም በላይ ነህ
ከማወራው በላይ ነህ
ከምዘምረው በላይ ነህ
ከሁኔታዎችም በላይ ነህ

በላይ ነህ /2/ ከሁሉ/አንተ/-
ከምንም በላይ ነህ
በላይ ነህ /2/ የሱስ/-
አንተ የበላይ ነህ /...../

የሞት መውጊያ - ሰባብረሃል
የናሱን በር - ቆራርጠሃል
ከጠላት እጅ - አላቅቀኸኝ
     ናጻ አውጥተህ - ልጅህ አረከኝ /2/

ማህተሙን ፈትተኸዋል
መጋረጃውን ቀደኸዋል
እንቅቁልሽ ከንግዲህ የለም
ሁሉም ፈታህ ለዘላለም /2/

በሰዎች ዘንድ የሞተውን
አራት ቀን የሆነውን
መቃብሩን ከፈትክና
አስነሳኸው በህይወት እንደገና /2/
',0),(NULL,'በጊዜው ሁሉም ውብ ይሆናል','Aylew2','እግዚአብሔር ሲነሳ ጨለማው ይበራል
እግዚአብሔር ሲነሳ ሌሊቱም ይነጋጋል
እግዚአብሔር ሲነሳ ችግር ገለል ይላል
እግዚአብሔር ሲነሳ ቀንበር ይሰበራል
በጊዜው /2/ ሁሉም ውብ ይሆናል /4/

ያስጨነቀኝንም ከእኔ ላይ ጥሎ
የከበደኝንም ከላዬ አራግፎ
አሸጋገረኝ ወጥመዱንም ሰብሮ
በድል ላይ ኢየሱስ ድልን አጎናጽፎ /2/

ለሰው የማይቻል ለእርሱ ቀላል ነው
የሚዋጋኝንም የሱስ ተዋጋው
እዘምራለሁ እኔ እቀኛለሁ
  ኢየሱስ ሲረዳኝ በአይኔ አይቻለሁ /2/

ጸሃይ ባትወጣ ጀንበር ብትጠልቅ
ዙሪያው ተጋርዶ ሕይወት ቢጨልምም
በጊዜው ኢየሱስ በድንገት ሲነሳ
ሁሉም ይቀየራል ብርሃን ይሆንና /2/
',0),(NULL,'አንተ  ስትናገር ','Aylew2','አንተ እዘዝ እንጂ
ካፍህ ቃል ይውጣ እንጂ
ምን የማይሆን አለ የሱስ ባንተ እጂ /2/
አንተ ስትናገር ተራራው ይናዳል
አንተ ስትናገር ሸሎቆው ይሞላል
አንተ ስትናገር ባህር ይከፈላል
አንተ ስትናገር ታሪክ ይለወጣል /2/
ታሪክ ይለወጣል /8/

ሰማይ ምድር ጸኑ ካፍህ ቃል ሲወጣ
ይሁን በሚል ቃልህ ሁሉን ምታጸና
የተናገርከውን በእውነት የምትፈጽም
የኔ ታማኝ ወዳጅ የሱስ ለዘላለም /2/
ይሁን ያልከው ይሆናል
   አንተ ያዘዝከው በሰማይ /2/

የደረቁ አንጥቶች ተስፋ ለቆረጡ
በሞት ላይ ተይዘው በመቃብር ላሉ
ስልጣን ባለው ቃልህ ስትናገራቸው
ህያው ሆነው ጸኑ ቆሙ በእግራቸው /2/
ይሁን ያልከው ይሆናል
አንተ ያዘዝከው በሰማይ /2/

ታሪክ አላወራም እኔ ምስክር ነኝ
ብዙ ነው በሕይወቴ የሱስ ያረክልኝ
ከሞት አፍ አላቅቀህ ነፍሴን አድነሃል
አፌም ምስጋናህን ዘወትር ያወራል /2/
ሳልቆጥብ በፍጹም ልቤ አመልክሃለሁ
ብዙ ነው ኢየሱስ ለኔ ያደረከው /2/
',0),(NULL,'ኢየሱስ ካንተ ተለይቼ','Aylew2','ኢየሱስ ካንተ ተለይቼ - ወዴት እሄዳለሁ
አንተ ለኔ አባቴ ነህ አንተ ለኔ
አንተ ለኔ ረዳቴ/ወዳጄ/ትምክህቴ ነህ 
አንተ ለኔ /2/

ፍጹም አላየሁም እንዳንተ ለእኔ
ለነፍሴ የሚያስብ ደርሶልኝ ከጎኔ
ፍቅርህ እውነተኛ የማትከዳ ወዳጅ
አንተ ነህ ኢየሱሴ ለእኔ የምትወድ /2/

ካንተ ርቄ መኖር - ለኔ አይሆንልኝም
ከእቅፍህም መውጣት - ከቶ አይመቸኝም
ለዘላለም ልኑር - ኢየሱስ በግሮችህ ስር
ምርጫዬ አንተ ነህ ከቶ የሌለህ ወደር /2/

በአለም ላይ ሚመረጥ - ብዙ ምርጫ ቢኖር
ሰዎች ሚያደንቁት - የሚያገኙት ቢኖር
እኔ ግን ማደንቀው - የሱሴ አንተን ነው
ምርጫዬ ነህና - ሁሌ መርጥህአለሁ /2/

የሕይወት ቃል አለህ - ካንተ ማን ይለያል?
አንተን ትቶ ኑሮ - ኧረ እንዴት ይመቻል?
ዘመኔ ሁሉ ይለቅ - ኢየሱስ በቤትህ
ሕይወቴ ነህና - ልኑር በእቅፍህ /2/
',0),(NULL,'በቃሉ  ታማኝ ','Aylew2','አሃ አይጨልምብኝም አሃ ያየልኝን ሳላይ
ከቶ አይመሽብኝም/ጊዜ አያልፍብኝም-
 አሃ መገለጡን ሳላይ /2/
የኔ ሌሊት በእሱ ይነጋል በእሱ ይነጋል /4/
በእሱ ይነጋል /8/

ተስፋን የሰጠኝ የታመነ ነው
በቃል ኪዳኑ እታመናለሁ
የተናገረውን እስከሚፈጸም
እጄን ይዞታል ከቶ አይተወኝም

ጌታ በቃሉ ታማኝ ጌታ በቃሉ /2/
የሱስ በቃሉ ታማኝ የሱስ በቃሉ /2/


ባለ ራእዪ ነኝ ባለ ተስፋ
ሕልሜ ሳይፈጸም ከቶ አልጠፋ
ከሩቅ አያለሁ እሱ ያየልኝ
እጠብቃለሁ እሲኪጎበኘኝ
ጌታ ...

ኪዳኑን አይሽር አያጥፍ ቃሉን
የማይለወጥ ለሚታመኑት
ያልታሰበውን ታላላቅ ስራ
  አየሁት ባይኔ እሱ ሲሰራ /2/
አሃ ....
',0),(NULL,'አውቄ ነው የማመልከው','Aylew2','ያዘምረኛል ፍቅሩን ሳስብ
ያዘምረኛል ምህረቱን ሳስብ
ያዘምረኛል ውለታውን ሳስብ
ያዘምረኛል ደግነቱን ሳስብ /2/*
አይበዛበትም እዘምራለሁ
ክብሬ ይውደቅለት አመልከዋለሁ /2/

ሞኝነት ቢመስልም የሱስን ማምለኬ
ጠላቴ ሊያስቆጣ ለርሱ መዘመሬ
ይቆጣ ይረር እንጂ እኔ ግን አልተውም
በአይኑ እያየኝ ዘምራለሁ ዛሬም /8/

አውቄ ነው የማመልከው
ለከንቱ አይደለም የምዘምረው
የየሱስን ክብር በአይኔ አይቼ ነው
ፍቅሩ ውስጤ ገብቶ ስለማረከኝ ነው /5/

የእስራቴን ቀንበር ከላዬ ሰበረው
የከበደኝን ከፊቴ አነሳው
በጠላቴ እራስ ላይ ቆሜ ዘምራለሁ
ድልን ያስታጠቀኝ የሱስ አምላኬ ነው /5/
',0),(NULL,'አይረፍድብህም','Aylew2','ስትነሳ አሃሃሃ ብትዘገይም
ስትደርስ ግን ጌታዬ/የሱሴ አይረፍድብህም /2/
ነገርን ሁሉ በጊዜው ውብ አርገህ ትሰራለህ
የሚመስልህ የለም የሱሴ እውነትም ኤልሻዳይ ነህ /2/

(አዝ.) አይረፍድብህም ጌታዬ/የሱሴ አይረፍድብህም /4/

ነገሮች ሁሉ ቢለወጡ - አንተ ግን አትለወጥም
ሁሉም ነገር በጊዜው - ትሰራለህ ሚመስልህ የለም
ደረቁን በትር የሱሴ - በመንፈስ ታለመልማለህ
ዘመናት ሁሉ አይለውጥህም - አልፋና ኦሜጋ አንተ ነህ

በስራህ ሁልጊዜ ፍጹም - በጭራሽ አትሳሳትም
እንዲህ አደረግ ተብለህ - የሱሴ አንተ አትታማ
በሞት አፋፍ የደረሰውን - በሕይወት ታኖረዋለህ
ታሪኩን ሁሉ ለውጠህ - ለክብርህ ታቆመዋለህ

ተስፋ አጥቶ ለሚንከራተት - በተስፋ ታኖረዋለህ
የተረሳውን አስታውሰህ - በቤትህ ታከብረዋለህ
መዛግብትህ ሁሉ ቢገለጥ - ታሪክ ሁሉ ቢመረመር
በምድር ላይ ፍጹም አይገኝም - ኢየሱስ አንተን የሚመስል
',0),(NULL,'ላይህ እናፍቃለሁ','Aylew2','ላይህ እናፍቃለሁ በአይኖቼ
ላይህ እናፍቃለሁ /2/ የሱሴ
ላይህ እናፍቃለሁ
ያኔ ችግሬን እረሳለሁ
ያኔ ጭንቀቴን እረሳለሁ
እንባዬ ታብሶ ካንተ ጋር
በደስታ እኖራለሁ /2/

ተስፋ ሰጥተኸኛል ከቶ ላትተወኝ
በዘላለም ፍቅር ኢየሱስ ወደደከኝ
የማያልፍ ርስትህን አዘጋጀህልኝ
     ለዘላለም እንድኖር ቃልም ገባህልኝ /2/

ጠላት ተስፋ ቁረጥ ከቶ አታገኜኝም
ኢየሱሴ ወዶኛል ፍጹም አይጥለኝም
ስፍራ አለኝ በሰማይ እሄዳለሁ ----
የምናፍቃትን ዮሩሳሌም ላይ /2/

በዚህች አለም ሲኖር ምንም ባይመችም
ችግር መከራውም ቢደራረብብኝ
ፍቃድህን እየፈጸምኩ እጠብቅህአለሁ
ወደኔ ስትመጣ ያን ጊዜ አርፋለሁ /2/

ወንጌልን ለፍጥረት እየሰበኩ ልኑር
ወስኛለሁ የሱስ እርዳኝ በኔም ክበር
የፍጥረታት ናፍቆት መገለጥህን ሲያዩ
    በስልጣን ስትሰራ ማየት እናፍቃለሁ /2/
',0),(NULL,'አንተ ስትናገር','Aylew2','አንተ እዘዝ እንጂ
ካፍህ ቃል ይውጣ እንጂ
ምን የማይሆን አለ የሱስ ባንተ እጂ /2/
አንተ ስትናገር ተራራው ይናዳል
አንተ ስትናገር ሸሎቆው ይሞላል
አንተ ስትናገር ባህር ይከፈላል
አንተ ስትናገር ታሪክ ይለወጣል /2/
ታሪክ ይለወጣል /8/

ሰማይ ምድር ጸኑ ካፍህ ቃል ሲወጣ
ይሁን በሚል ቃልህ ሁሉን ምታጸና
የተናገርከውን በእውነት የምትፈጽም
የኔ ታማኝ ወዳጅ የሱስ ለዘላለም /2/
ይሁን ያልከው ይሆናል
   አንተ ያዘዝከው በሰማይ /2/

የደረቁ አንጥቶች ተስፋ ለቆረጡ
በሞት ላይ ተይዘው በመቃብር ላሉ
ስልጣን ባለው ቃልህ ስትናገራቸው
ህያው ሆነው ጸኑ ቆሙ በእግራቸው /2/
ይሁን ያልከው ይሆናል
አንተ ያዘዝከው በሰማይ /2/

ታሪክ አላወራም እኔ ምስክር ነኝ
ብዙ ነው በሕይወቴ የሱስ ያረክልኝ
ከሞት አፍ አላቅቀህ ነፍሴን አድነሃል
አፌም ምስጋናህን ዘወትር ያወራል /2/
ሳልቆጥብ በፍጹም ልቤ አመልክሃለሁ
ብዙ ነው ኢየሱስ ለኔ ያደረከው /2/
',0),(NULL,'ሃያሉ አምላኬ','AberhamA1','ሃያሉ አምላኬ ይኸው ምሮኛል
ከዚያ ከጨለማ አውጥቶኛል
እንዲህ ምህሮኝ ብርሀን አይቻለሁ
ለስሙም ክብር ሁሌም እዘምራለሁ /2/ 2

ከአሳዳጆች ዋና የነበርኩኝ
በአምላኬ ፍቅር ተሸነፍኩኝ
ዛሬማ እፎይ ሙሉ ሰው አርጎኛል
እንዳየው አይኖቼን ከፍቶልኛል
አሮጌው ማንነት ሲቀየር
በልቤ ላይ የሱሴ ሲከብር
በገናዬን ያዝኩኝ ላመልከው
እንዲህ ያማረብኝ በርሱ ነው /5/

ልስገድለት ዛሬም ክብሬን ጥዬ
የሚገባው እርሱ ነው ጌታዬ
ጨለማዬን ኢየሱስ አብርቶታል
ለኔ ሲራራልኝ አይኔ አይቶታል
ከታሰርኩበት ተፈትቼ
ሲረዳኝ አምላኬ በአይኔ አይቼ
እንዴት ታዲያ አስችሎኝ ዝም እላለሁ
በብዙ ምስጋና አመልከዋለሁ /3/
በብዙ እልልታ አመልከዋለሁ /2/
',0),(NULL,'ከልጆችህ እኔን','AberhamA1','ደስታዬን በምን ቃላት ልግለጽልህ የኔ ጌታ
ከፍ ከፍ ላድርግህ ላደናንቅህ እንደገና
ከልጆችህ እኔን አንዱ ስላደረከኝ /4/
ስለዚህ በምስጋና ላይ ምስጋናን እጨምራለሁ
የወደድከኝን ኢየሱስ ከፍ ከፍ አደርግሃለሁ
ስለዚህ በክብርም ላይ ክብርን እሰጥሃለሁ
የወደድከኝን ጌታ ከፍ ከፍ አደርግሃለሁ /4/

ከልቤ ልበልህ ተባረክ
እየደጋገምኩኝ ምስጋናዬ
ከእስራቴ ሁሉ ፈተኸኛል
ነፍሴን ኢየሱስ አንተ ወደሃታል /2/

ሰላምህን ይዘህ መጣህና
አበሳዬን ከእኔ አራቅክና
ይኸው ዛሬ ታዘምረኛለህ
እንደ አንቦሳ ታዘልለኛለህ /2/
እንግዲህ ምን ልበል ምን ልከፈልህ
ምስጋናዬን ዛሬም ላፍሥስልህ
ከዙፋንህ ከእግር ስር ሆኜ
ክብርን ልስጥህ ኢየሱስ መድህኔ /2/

መድህኔ መድህኔ /2/
ክብርን ልስጥህ በዘመኔ /2/ 
',0),(NULL,'እኔን ላከኝ','AberhamA1','ማንን እልካለሁ ማንስ ይሀድልኛል?
ለህዝቤ ጥፋታቸው ማን ይነግርልኛል?
ብለህ ስትጠይቅ ድምጽህን ሰማሁና
ተነሳሁ ለመሄድ ታመንኩብህና

እኔን ላከኝ /2/
እሄዳለሁ ወደ ምትልከኝ
እኔን ላከኝ /2/
እላካለሁ ወደ ምትልከኝ

ገና በማህጸን ሳለሁ ለይተኸኝ
ልትከብርብኝ ልትነግስብኝ ከወደድክኝ
ወደ ምትሰደኝ በሙሉ እሄዳለሁ
ቃልህ በአፌ ውስጥ ይኑር እታዘዛለሁ

አንደበቴ ኮልታፋ ነው የኔ ጌታ
ታምኜ ግን እወጣለሁ የአንተን ጸጋ
ኃይልን በምትሰጠኝ ሁሉን እችላለሁ
አምላኬ ሆይ አትተወኝም ይህን አምናለሁ

መገለጥ ነው በእምነት አንተን ታምኖ
እንደ ጴጥሮስ ስለ ወንጌል ሁሉን ትቶ
ከፍታውን ዝቅታውን የማልፍበት
ኃይልን ስጠኝ ተራራውን የምንድበት
',0),(NULL,'ሞት አልፎኝ ሄዶ','AberhamA1','ሞት አልፎኝ ሄደ ደምህን አይቶ /4/
አመለጥኩኝ ባንተ ጌታዬ ኢየሱስ
አመለጥኩኝ ባንተ ጌታዬ ጥፋትን
አምልጫለሁ ባንተ ጌታዬ ኢየሱስ
አምልጫለሁ ባንተ ጌታዬ ሞትን

ቤቴን በደስታ ሞላህ በምስጋና
የክፉ መላእክት አልፎኝ ሄዷልና
ደምህ በመቃኔና ጉበኔም ተቀብቶ
አስመለጠኝ ከሞት ከጠላት ለይቶ /2/
አመለጥኩኝ ....

ድል ነው በመንደሬ የሚዘመረው
በእልልታ ተሞላሁ ማዳንህን አየው
አጥፊው እንዳያገኘኝ ከለላ ሆንክልኝ
ፋሲካዬ ኢየሱስ በአንተ ደስ አለኝ /2/
ሞት አልፎኝ ....

አንደበቴን በሳቅ ልቤን በደስታ
ሞልተሃል ኢየሱስ ክበር የኔ ጌታ /2/
ሞት እኔን ላያየኝ እኔም ሞትን ላላይ
በቃ አመለጥኩት አልፏል ደምህን ሳይ

አመለጥኩኝ ....
አንደበቴን ...
አመለጥኩኝ ....
',0),(NULL,'ልቤ ውስጥ አለ ፍቅሩ','AberhamA1','ለደካማው ኃይል ይሰጣል
ጉልበት ላጣው ብርታትን
የሰማሁት እውነት ነው
አምላኬማ ፍቅር ነው
ነፍሴ እርሱን እርሱን ትላለች
እንደ ዋላ ተጠምታ የኑሮዬ መሰረቱ
ጌታ አምላኬ ነውና /2/
ለእኔስ ኢየሱስ ነውና /2/
ቸሩ አባቴ ነውና

ያሳለፍኩትን የጭንቅ ዘመን
በመሸማቀቅ በሀዘን
ትዝ ይለኛል አስታውሳለሁ
ኢየሱስ ውለታህ ብዙ ነው
አውቀዋለሁ እራሴን
ምን እንደ ነበር ህይወቴ
ከልቤ አይወጣም ከአዕምሮዬ
ያደረገልኝ ጌታዬ

አድርጎልኛል እኔ አልረሳውም
ውለታውን ከቶ አልዘነጋውም
ፍቅሩ በኔ ላይ አይሎ ኖሯል
ኢየሱስ ሲጠራኝ ለካስ ለአላማ /2/

ልቤ ውስጥ አለ ፍቅሩ
ኢየሱሴን እወደዋለሁ
ታሪኬን ለውጦታል
ባለ ብዙ ምህረት ነው /2/

የማልችለው መስሎኝ ነበር
በዝቶ በህይወቴ ፈተና
በአምላኬ ኃይል ሁሉን አለፍኩ
ጸጋውን ደግፎኝ ተሻገርኩ
እንደ ኢየሱስ ያለ የለም
ዛሬም ቢሆን ነገ ለዘላለም
በቸርነቱ አቁሞኛል
ተመስገን ልበል ራርቶልኛል

አድርጎልኛል .....
ልቤ ....
',0),(NULL,'ገና እንበዛለን ገና','AberhamA1','ገና እንበዛለን ገና
ገና እንሰፋለን እኛ
የአብርሃም ዘሮች ነንና
እግዚአብሔርን የምንፈራ
ገና እንበዛለን ሃሌሉያ /2/

የሱስ ቃል ኪዳኑን አይረሳም
አበዛሃለሁኝም ብሏል
እንደ ሰማይ ከዋክብት
እንደ ምድርም አሸዋ /2/
እንደ ከዋክብት እንደ አሸዋ /2/
ገና ያበዛናል ኢየሱስ ከዚህ በላይ

የመውረስ ዘመን ነው የመብዛት
በአይኖቻችን የምናይበት
ምርኮአችን የሚመለስበት
አምላካችን የሚነግስበት /2/

የሚከብርበት የሚነግስበት /2/
ኢየሱስ ብቻ ገኖ የሚታይበት
ገና ....

ከምስራቅ እስከ ምዕራብ
ከሰሜንም እስከ ደቡብ
የረገጥነውን ሁሉ ሰጥቶናል
በምድር ላይ ስሙ ይከብራል /2/

ስሙ ይከብራል ስሙ ይነግሳል /2/
የኢየሱስ ስም ብቻውን ይወደሳል /2/
ይከብራል ስሙ
ይከብራል አሜን ይከብራል /2/
ምድር በሙሉ እርሱን በማወቅ ስትሞላ
ይከብራል ኢየሱስ በአምላካችን ከተማ /2/
',0),(NULL,'ኦ መዳኔ','AberhamA1','ከጨለማው ዓለም የወጣሁባትን
የህይወት ምዕራፍ የጀመርኩባትን
ካንተ ጋር አምላኬ እርቅ ያደረኩባትን
ያቺን ቀን አልረሳም መዳን ያገኘሁባትን /2/

ኦ መዳኔ /3/
እኔስ ገረመኝ መዳኔ መዳኔ
ኦ መዳኔ /3/
እኔስ ደነቀኝ መዳኔ መዳኔ

ያዳንከኝ ጌታዬ
ላምልክህ እንደገና
ቅዱሳን ባሉበት
እንካ ይኸው ምስጋና
ዕዳዬ ተከፍሎ
ሞቴ ተሻረልኝ
ባንተ ነው ኢየሱሴ
ከፍ ከፍ በልልኝ
ኦ መዳኔ ....

የክብርህ ብርሀን በላዬ ሲያበራ
አይኖቼ ተከፍተው አየሁ የአንተን ስራ
የምስጋናን መስዋዕት እሰዋልህአለሁ
መዳኔን እያደነኩ ሁሌ አክብርህአለሁ

የተበተበኝ ነገር በሙሉ ተፈታ
ሰላሜ በዛልኝ ነፍሴ አገኘች እርካታ

ቀምሼ ማላቀው ደስታ በልቤ ፈሰሰ
መንፈስህ መጣና ህይወቴን አረሰረሰ /2/

ይህን ሁሉ አይቼ የምለው ቢጠፋኝ
ከተመስገን በቀር ሌላ ምን ቋንቋ አለኝ? /2/
ከተመስገን ውጪ ምን ቋንቋ አለኝ? /2/
አምላኬ ምን አለኝ
',0),(NULL,'እድሜን ጨመርክልኝ','AberhamA1','እድሜን ጨመርክልኝ እስቲ ላመስግንህ /3/
ይህቺን ቀን አየሁ ውዴ ተመስገን /3/ 2
በአንተ ነው በህይወት መኖሬ
ስንቱን ውጣ ውረድ በጸጋህ ተሻግሬ /2/

ትዝ ትዝ ሲለኝ ያሳለፍከኝ ሁሉ /2/
ላመልክህ ልዘምር እነሳሳለሁኝ /2/
ይኸው አለሁኝ አለሁኝ በሕይወት /2/
ተከትለውኛል ቸርነት በጎነት /2/

የሱስ ያሳለፍከኝ ብዙ ነው ታሪኬ /2/
እኔ ተናግሬው አልጨርስ ተርኬ /2/
እንደው ስለሁሉ ተወደስ ልበልህ /2/
ዝማሬን ጨምሬ ከፍ ከፍ ላድርግህ /2/

አቤት በጎነትህ /2/
እዚህ አደረስከኝ እንዲህ ተሸከመኸኝ
ዛሬ የደስታ እንባ አይኔንም ሞልቶታል
ባመልክህ /2/ መች ይበዛብሃል

ለኔ /3/ ጉልበት ሆንከኝ
ለኔ ኢየሱስ ጉልበት ሆንከኝ
ለኔ /3/ ኢየሱስ ሞገስ ሆንከኝ /2/
ኢየሱስ ጉልበት ሆንከኝ
አምላኬ ሞገስ ሆንከኝ  /.../

አቤት ....
ለኔ ...
',0),(NULL,'በፊትህ ከብረናል','AberhamA1','በፊትህ ከብረናል በአይኖችህ ታይተናል
ኢየሱስ ስራችንን ቀድመህ ሰርተኸዋል /2/
ለክብርህ እንደገና ምስጋና - ምስጋና
ለክብርህ እንደገና እልልታ - እልልታ /2/

ኢየሱስ ከኛ ጋራ ባትሆንማ ኖሮ
በጠፋን ነበረ ባልታየን ዘንድሮ
ነገር ግን በፊትህ ሞገሳችን በዝቶ
ለምልመን ታይተናል ቃልኪዳንህ ሰርቶ
ለክብርህ ....

ክንድህ እየረዳው በድል የሚራመድ
ማነው እንደ እስራኤል እንዲህ የሚወደድ
ለሰሙት ማስፈራት ሆነን ብንታይም
ክብሩ ይብዛልህ ኢየሱስ ከኛ የሆነ የለም
ምስጋና ተሞልተን በዝማሬ - በዝማሬ
እናከብርሃለን ኢየሱስ ዛሬ
ይደርደርልህ በብዙ በገናው - በገናው
ያርግልህ ከማደሪያህ እልልታው /2/
በፊትህ ...

እስራኤል ሆይ ስማ አምላክህ አንድ ነው
ተብሎ የተነገረው ይህ ልዩ ህዝብ ነው
ትምክህትና ሀይሉ ክቡር ስምህን አርጎ
በአደባባይ ታየ በምርኮ ተሞልቶ
አምላካችን ሃይላችን ነህ
ልዑል ሆይ መጠጊያችን ነህ /2/
አንተን ይዞ ሽንፈት የለም አንተን ይዞ--አንተን ይዞ
አንተን ይዞ ማሸነፍ እንጂ አንተን ይዞ-አንተን ይዞ /4/
',0),(NULL,'ተው','AberhamA1','አይንህ ያየውን ልብህ ከተመኘው
ተው ይቅርብህ ተው
ለነፍስህ አይበጅህም ተው
ተው ይቅርብህ ተው
ለሕይወትህ አይበጅህም ተው

እርም የሆነውን ነገር እንዳትነካው ተብሎ
አካን ወሰደው እጅግ ቸኩሎ
የእግዚአብሔርን ቁጣ እጅግ ነደደበት
በቤቱ ላይ ሞትን አመጣበት
ከእቅፉ ስትኖር እንዲረዝም እድሜ
አትንካ ያለህን ተው ወንድሜ
ትእዛዙን ብትሰማ ደስታህ ይበዛል
ሰላሙም በዝቶ ይፈስልሃል

የቤተ መቅደሱን የክብር እቃ ነክቶ
ለክብሩ ሲያደርገው ቢልጣሶር
ማኔ ተቄል ፋሬስ ተብሎ ተጻፈበት
ማንነቱ ከዳው ቀሎ ሲገኝ
ለክብሩ እንዲሆን ኢየሱስ የለየውን
ለምን ትነካለህ ያከበረውን
ዘመንህን በሙሉ በእረፍት እንድትኖር
ትእዛዙን መጠበቅ ይበጃል

ለአምላክህ የሰጠኸውን መልሰህ አትሻ
እርም ሆነብህ እንዳያጠፋህ
ሃናኒያ ሰጲራ ይህን መች አለፉ
በቁጣው ከመጥፋት አልተረፉ
የአይንህን አምሮት ክፉንም ምኞት
አትስማ ይቅርብህ እንዳይሆንብህ ሞት
ስትወጣ ስትገባ ሕጉን ተከተለው
ለመንገድህ ብርሃን አድርገው
',0),(NULL,'ጌታዬ እወድህለሁ','AberhamA1','ምስጋናዬን ይዤ ኢየሱስ ላሞጋግስ /3/
ይገበሃል ክብርህን ተላበስ
ዛሬም ላመስግንህ እኔም ደጋግሜ /3/
አንተ እኮ ነህ ኢየሱስ ባለውለታዬ

ጌታዬ እወድሃለሁ ነህ ጉልበቴ
ጌታዬ ጥበቃህ በዝቶልኝ መውጣት መግባቴ
ጌታዬ አይቼዋለሁ ቸርነትህ
ጌታዬ ከምንም በላይ በጎነትህ

ቸር እንዳንተ የለም አብልጬ ኢየሱስ ልጠጋ
በቤትህ ምን ጠፍቶ አለ ሁሉም አንተጋ
ምስክርህ ነኝ ስራህን አይኖቼ አይተዋል
ተደንቄ እንዳላልፍ ምስጋናን ባአፌ ሞልተሃል
ጌታዬ ....

የደረቀ ሕይወቴ ለምልሟል ከአንተ የተነሳ
ሲነካኝ ቅባትህ ህመሜ ሁሉ ተረሳ
ታድሷል መንፈሴ አሁንማ አዲስ ሰው ሆንኩኝ
እንደ አባቶቼ ስትወደኝ እስራኤል ተባልኩኝ
ምስጋናዬ ...
ጌታዬ ....

አቤት /2/ አቤት ማዳንህን አቤት
አቤት /2/ አቤት ችሎታህ አቤት /2/

በምድረበዳ ላይ ምንም በሌለበት
ፈጥነህ ደረስክልኝ ኢየሱስ ልትሆነኝ ጉልበት
ያለቀ ሲመስለኝ ታሪኬ ያበቃ
ብርቱ ምርኩዝ ሆንከኝ ድጋፌ የኔ ዋስ ጠበቃ
አለኝ /2/ አለኝ ብዙ ምስጋና አለኝ
አለኝ ብዙ ክብር አለኝ
አለኝ አምላኬ የሚገባህ
በቅባትህ የተቀባ /2/
',0),(NULL,'ይለፍ ያልከው','AberhamA1','ይለፍ ያልከው

ይለፍ ያልከው ይለፍ በሕይወቴ
ጸጋህ ብቻ ይብዛልኝ መድሃኒቴ
በዚህች አለም በቤትህ ሳለሁኝ
የሚሆነው ሁሉ ለበጎ ነው /2/

ኢየሱሴ /4/ 2

አልማርር ከአፌ ምንም አይወጣ
የምትሰጥ የምትነሳ አንተ ብቻ
ምንም ይሁን ምንም ይምጣ እከተልሃለሁ
እኔነቴን ዛሬም ኢየሱስ ሰጥቼህለሁ /2/
ይለፍ ...

ጌታዬ /4/ 2

እስከ ዛሬ ጸጋህ በዝቶልኝ ቆሜያለሁ
ስወድቅና ስነሳ እዚህ ደርሻለሁ
ያሳለፍኩትን በሙሉ አሁን ሳስበው
ከአንደበቴ ክፉ አይወጣም መልካም ነው /2/

ኢየሱሴ /4/ 2

ውጣ ውረድ በጉዞዬ ቢፈራረቅ
እኔ እንደሆንኩ ፍጹም ኢየሱስ አንተን አልለቅ
ስጋዬንም በጥርሴ አጥብቄ እይዘዋለሁ
እስከሞትም ቢሆን ካንተ ጋር እሄዳለሁ /2/
ይለፍ ...
ኢየሱሴ /4/
',0),(NULL,'አድርገህልኛል','AberhamT1','ብቻዬን ነኝ ብዬ ሳስብ ስጨነቅ
አየሁት ጌታን ሲመጣ ከሩቅ
በሰማያዊ በረከት ባረከኝ
አረማመዴን እርሱ አጸናልኝ

አድርገህልኛል አከብርሃለሁ
ሰርተህልኛል አነግስሃለሁ
የልቤን መሻት ስለፈጸምክልኝ
በመከራዬ ስለደረስክልኝ

ለእኔ ያረከው ግሩም ታምራትህን
በቀረው ዘመኔ ላውራ ሥራህን
የሕይወትን መንገድ በአንተ አግኝቻለሁ
ፍቅርህ ልዩ ነው ተለውጫለሁ

ወንድሞች እህቶች እናምልከው በአንድነት
የዘላለም ተስፋ የዓለምን መድኃኒት
በከበረው ዜማ ስሙን እንባርክ
እኛን ለተቤዠን አምልኮ ይሁን

ስላደረክልኝ ምን እመልሳለሁ
ከምስጋና በቀር ምን እሰጥኃለሁ
አድርገህልኛልና አመሰግንህአለሁ
     በቅዱሳኑ ፊት ስምህን አከብራለሁ /2/*
',0),(NULL,'በኢየሩሳሌም  ውስጥ ','AberhamT1','በኢየሩሳሌም ውስጥ ምስጋና ይሰማ
ኢየሱስን ሊያይ አህዛብ ሁሉ መጥቷል
የነፃነት ድምጽ ከፍ ያለ ምስጋና
ከሕዝቡ ይሰማ ለከበረው ጌታ

ነፃ ወጣ ሕዝቡ ነፃ /2*
ድል ሆነ በእርሱ/በኢየሱስ/2*

አእላፋት መላእክት የሚዘምሩለት
ኪሩቤል ሱራፌል የሚያገለግሉት
የሕይወት ብርሃን የዘላለም ተስፋ
በምድር ላይ ወጥቷል ለከበረው ጌታ

አንተን ያገኘ ሕዝብ አንተን የጠራ ሕዝብ
በረከት አገኘ ልቡ ተቀየረ
አንተን ያገኘ ሕዝብ አንተን የጠራ ሕዝብ
ልቡ ተቀየረ ሕይወትን አገኘ
ኢየሱስን አገኘ ኢየሱስን አገኘ
ሕይወትን አገኘ ሕይወትን አገኘ
',0),(NULL,'በብርሃንህ  ብርሃንን ','AberhamT1','አንተ የጠራኸው አንተ የመረጥከው
ልዩ የተለየ
ታላቅ ጉባኤ የርስትህ ወገን
በትንቢት የተሰወረ
በቃልህ ኃይል ሲሰባሰቡ
እናያለን የተዘጋጁ

በብርሃንህ ብርሃንን እናያለን/2*
ጆሮ ያልሰማውን እንሰማለን/2*
እንደ ቃልህ/4*

የሰላም ወንጌል የትንሳኤው ኃይል
 ሲሰበክ በዓለም ዙሪያ
በመንፈስ ቅዱስ በአንተ እስትንፋስ 
ሰዎች ሲቀደሱ
እናያለን ታላቅ ሠራዊት 
የሚመጡ ወደ ኢየሱስ ቤት

እናያለን ሥራህን
እንሰማለን ዝናህን
የቃልህ ኃይል ብርታት
',0),(NULL,'መንፈስህ በኃይል ወርዶብኝ','AberhamT1','ዕውቀት ሳይኖረኝ መረጠኝና
ውዳቂውን ሳይንቅ አከበረኝ
እኔም የሚወደኝ ተገኘና
የምጠቅም ዕቃ ሆንኩኝና
ወደድከኝ አከበረከኝ 
 መረጥከኝ ልጅህ አረከኝ/2*

መንፈስህ በኃይል ወርዶብኝ
የነፍሳት ሸክም በዝቶብኝ
በማያቋርጥ የእምነት ተስፋ
በሩጫ ለአንተ ስሰራ
አያለሁ ጠብቃለሁ/2*
ፈልጋለሁ ኢየሱስ እመኛለሁ/2*

መንግስትህን ለመውረስ የሚመጡ
ከገሃነብ ፍርድ ያመለጡ
ሲዘምሩ ለአንተ በደስታ
ሲያቀርቡ ክብር ምስጋና
አያለሁ ጠብቃለሁ
 ፈልጋለሁ ኢየሱስ እመኛለሁ/2*

ነፍሳት ሲድኑ ከኃጥያት
ያቀርባሉ ዜማ መላዕክት
ያዳንካቸው ሁሉ ሲሰግዱልህ
ኢየሱስ እያሉ ሲጠሩህ
አያለሁ ጠብቃለሁ
ፈልጋለሁ ኢየሱስ እመኛለሁ/2*
',0),(NULL,'የእኔ ጌታ እባርክሃለሁ','AberhamT1','የእኔን ጌታ እባርክሃለሁ/3*
የእኔ ኢየሱስ እባርክሃለሁ/3*

ታላቅና ሞገስ ያለው የእኛ ጌታ
በኪሩቤል ላይ በዙፋኑ ነገሶአልና
መላዕክቱም ሠራዊቱም ያመስግኑት
ቅዱስ ስሙን ለዘለዓለም ከፍ ያድርጉት

ሰላምህን ለሰው ልጆች አብዝተሃል
ቸርነትህ በዘመናት እጅግ በዝቷል
ሁሉን ላንተ ሁሉን ባንተ አድርገሃል
እስትንፋስ ያለው ክብርን ሊሰጥ ይገባዋል

ግሩም ሥራህ ያደረከው ነገር ሁሉ
ቸርነትህ በቃልህ ውስጥ ያለው ሁሉ
ታማኝነትህ ኃያል ጸጋህ በዝቶ ታይቷል
የሱስ ፍቅርህ በመስቀል ላይ ተገልጦልናል

ስምህን እንባርካለን ኃያል ስምህን
ስምህን እንባርካለን ግሩም ስምህን
ስምህን እባርካለሁ የማዳን ስምህን
ስምህን እባርካለሁ ታላቅ ስምህን
',0),(NULL,'የድል የድል ሽታ','AberhamT1','የድል የድል ሽታ
 በአንተ ከጽዮን ይሸታል/2*
የባለ ሃምሳ መንፈስ 
እሳት ከላይ ይወርዳል/2*
እልል በሉለት አመስግኑት
ስሙን ጥሩለት ከፍ አድርጉት/…/


ስምህ/5* ኢየሱስ ስምህ ስምህ ኢየሱስ ስምህ
ሰላምህ/5* ኢየሱስ ሰላምህ ሰላምህ ኢየሱስ ሰላምህ
ስምህ/5* ኢየሱስ ስምህ ስምህ ኢየሱስ ስምህ
',0),(NULL,'መዳኔ ይለምልም','AberhamT1','በቅድስና በፍቅር
እራሴን በማዋረድ
ኢየሱሴን ፈርቼ ሰው በማክበር
በወንድማማች መዋደድን

መዳኔ ይለምልም/4*

በስምህ ስጠመቅ የተሰማኝ ደስታ
በመንፈስ ስትሞላኝ ያየሁት እርካታ
አንድ የመዳን መንገድ ዘላለም ደስታዬ
ልንከባከብለት ይለምልም መዳኔ

አለምን በሙሉ አድኜ ባተርፍ
ነፍሴ ግን ከጠፋች የት ነው የእኔ ትርፍ
ሌሎችን ማዳኔ የመዳን ፍሬ ነው
መዳኔ ይለምልም ጽሎቴ ይሄ ነው
',0),(NULL,'የዘላለም ክንዶች','AberhamT1','የዘላለም ክንዶች በምድር ላይ ሲታዩ
የፈጠርከው ሕዝቦች ክብርህን ኢየሱስ ሲያዩ
በጨለማ መንገድ ክብርህ ለሰው ሲበራ
የታሰረ ሁሉ በቃልህ ኃይል ሲፈታ

ኢየሱስ ታየ/2*

ኃያልነትህን እንደገና አይተናል
ታላቅነትህን ከቃልህ አድምጠናል
አንድነትህን ኢየሱስ ሁሌ እናወራለን
የበረከት አምላክ እንወድሃለን

ተመስገን ኢየሱስ ተመስገን
ኢየሱስ ታየ/2*

ኃያልነትህን እንደገና አይተናል
ታላቅነትህን ከቃልህ አድምጠናል
አንድነትህን የሱስ ሁሌ እናወራለን
የበረከት አምላክ እንወድሃለን

የዘላለም ክንዶች በምድር ላይ ሲታዩ
የፈጠርከው ሕዝቦች ክብርህን ኢየሱስ ሲያዩ
በጨለማ መንገድ ክብርህ ለሰው ሲበራ
የታሰረ ሁሉ በቃልህ ኃይል ሲፈታ
',0),(NULL,'አመሰግንሃለሁ','AberhamT1','የዓለምን ኃጥያት በመስቀል ላይ ጠርቆልን
ኃጥያቴንም በሙሉ ከመንገድ አስወገደልን
ለታረደው በግ ኃይልና ባለጠግነትም
ጥበብ ብርታትም ይገባዋል ለእርሱ ክብር
ክብር ይሁን አሜን!

አመሰግንሃለሁ
እዘምርልሃለሁ
አመሰግንሃለሁ
እሰግድልሃለሁ
በቅኖች ሸንጎ ስምህን አከብራለሁ

የጠፋውን ልጁን በትንሳኤው ታድጎታል
ልብሱንም ለውጦ የራሱ ልጅ አድርጎታል
ሥልጣንን ሰጥቶ በዘንዶው ራስ ላይ አቆመኝ
ቃል ኪዳን ገብቶ መጥቼ ወስዳለሁ አለኝ
ክብር ይሁን አሜን!

በኢየሩሳሌም በእግዚአብሔር ከተማ ላይ
ከመላዕክቱ ጋር በደስታ ዘምራለሁኝ
በሰማያዊቱ በተቀደሰው ተራራ
በነጩ ዙፋን ፊት እሰግዳለሁ እንደገና
ክብር ይሁን አሜን!
',0),(NULL,'ኢየሱስን ካየን','AberhamT1','ኢየሱስን ካየን መስቀሉ ከገባን
የዘላለም ሕይወት ከሆነ ፍለጋ
ና የሱስ ይጠራሃል
ና ወደ እሱ ይልሃል

የሰላም አባት እጁ ተዘርግቷል
የብርሃን አባት ከላይ ይወርዳል
የብርሃን አባት እርሱ ይመራሃል
የብርሃን አባት ከላይ ና ይልሃል
ኢየሱስ/3* ና ይልሃል ኢየሱስ ኢየሱስ

እውነትን ከወደድክ ሰላምን ከፈለክ
የሕይወት ቤህ ወንዝ ከሆነ የጠማህ
ና ኢየሱስ ይጠራሃል
ና ወደ እሱ ይልሃል
',0),(NULL,'መከራና ችግር','AberhamT1','ለቅዱሳን ሁሉ መለከት ሲነፋ
ዘመንና ጊዜ ለሰው ልጅ ሲያበቃ
የሕዝቡንም እንባ ኢየሱስ ያብሳል
ከእርሱ ጋር አብረን እንሄዳለን

መከራና ችግር ከእኛ ይወሰዳል
በእርሱ ደስታ ሰላም በፍቅሩ እየሞላን
ከእርሱ ጋራ አብረን እንነግሳለን
ለዘላለም

የሰማያት ደጆች ለእኛ ሲከፈቱ
መላዕክት በዜማ ሁሌ ሲያከብሩ
በጽዮን ተራራ በኢየሩሳሌም ውስጥ
የጻድቃን ማህበር አለቃ ሲያበራ

መከራና ችግር…..
ለቅዱሳን ሁሉ መለከት ሲነፋ…
መከራና ችግር…
',0),(NULL,'IT‘S AMAZING','AberhamT1','When I think of all you‘ve done for me
how you laid your life on calvary
my soul cries out
and my heart will shout for you

It‘s amazing how you love me
It‘s amazing that you care
No one ever loved me quiet like you
It‘s amazing Jesus you‘re amazing

When I feel your spirit in my heart
How you changed a life so torn a part
my soul cries out
and my heart will shout for you

No Nobody else can do
things that you can do
and no one else could love me like you do
your love will never change
you will remain the same
for you alone are worthy
',0),(NULL,'በኪሩቤል ላይ የምትቀመጥ','AberhamT2','ከሰማያት በላይ በክብርህ ላለኸው
ለሞትና ለሲኦል ኃይልህን ያስታወከው
የዘላለም ደጆች ለአንተ ይከፈቱ
የጽድቅ ንጉስ ግባ ዛሬም እንደ ጥንቱ

በኪሩቤል ላይ የምትቀመጥ
የነገስታት ንጉስ ኢየሱስ አንተ ታይ
በኪሩቤል ላይ የምትቀመጥ
የሰላም አለቃ ኢየሱስ አንተ ታይ

እንደ ተስፋ ቃልህ መጣህ ወደ ምድር
ለገባው ሚስጥሩ ታየ የአንተ ክብር
የማይሻር የጸና የትንቢት ቃል ይዘን
እስክ ትመጣ ኢየሱስ እንጠብቅሃለን
በኪሩቤል ላይ…

ሃሌሉያ ሃሌሉያ
ሃሌሉያ ሃሌሉያ
በምስጋና በምስጋና
እናንግሰው እናንግሰው

በኪሩቤል ላይ…
',0),(NULL,'በሚመራኝ እሔዳለሁ','AberhamT2','በሌት በቀን ይመራኛል
ኢየሱስ ያስፈልገኛል
እውነተኛ ወዳጄ ነው
ነፍሴን በደሙ የገዛት

በሚመራኝ እሔዳለሁ
ሕይወቴን ሰጥቼዋለሁ
አልረሳም አስታውሳለሁ
በሞቱ ተፈውሼአለሁ

ትዕዛዝህን አከብራለሁ
በክንደህ እደገፋለሁ
ተስፋ ሳልቆርጥ እጓዋዛለሁ
አንድ ቀን አዳኜን አየዋለሁ

አልተክዝም ከቶ አልፈራም
አንተ ካለህ ከኔ ጋራ
ፍጹም ፍቅርህ መድሃኒቴ
ማጽናኛ ነው ለሕይወቴ

አንዳንድ ጊዜ ፈተና ሲበዛ
መከራ ችግር ቢበዛብን
አንድ እንኳን ቢታጣ የሚረዳ
ኢየሱስ አለ ከእኛ/ከኔ ጋራ
',0),(NULL,'መድኃኒቴን አየዋለው','AberhamT2','መድኃኒቴን አየዋለው አይኖቼ ተከፍቷል
በደሙና በስሙ ስላነጻኝ
ፍጹም ህይወት አሁን አለኝ
በሞቱ ፈወሰኝ
አሮጌውን ልማድ ከህይወቴ ጠፍቷል

አምላኬን ላመስግን ስሙንም ልወድስ
ስላፈቀረኝ በመስቀል ተሰቅሎ
ሃሌሉያ
በህይወቴ ዘመን ሁሉ የሱስን ልወድስ
ለዓለም ህዝቦች የፍቅሩን ወንጌል ልግለጽ/ 2*

ትኩስ ቀዝቃዛ ለብ ያለ ህይወት አትመኙ
የጌታ አገልጋይ የእሳት ነበልባል ነው
በመንፈስ እሳት ግላችሁ እሱን አገልግሉ
የድሉን አክሊል እንድ ትቀበሉ

አምላኬን .....
ነፍሴ አርፋለች በዙፋንህ ስር
በጥላህ እታመናለሁ
መፍትሄ የሌለው ምንም ችግር
እንደማያገኘኝ አውቃለሁ

ካንተ የተሻለ ጓደኛ የለኝም
ካንተ የቀረበ ዘመድ አላገኝም
ካንተ የበለጠ ምንም አልመኝም
      ኦ የሱስ አለህልኝ ምንም አይጎድለኝም /4/*
',0),(NULL,'የሕይወት ውሃ ምንጭ','AberhamT2','የእምነት ቃሉን የሰጠ እስከ ፍጻሜ ታማኝ ነው
የፍጥረት ሁሉ አባት ለልጆቹ የሚዋጋ
እሩህሩህ አምላኬ የፍቅር ውሃ ምንጭ
ኃጥያት እንዳይጥለኝ ያዝከኝ በቸርነት

የሕይወት ውሃ ምንጭ
የነፍስ ሁሉ እረኛ
የአንቀላፋው ልቤ በውሃ ይነሳ
አፍስስ ቅዱስ መንፈስህን
ለተጠማች ነፍሴ
ይፍለቅ ፍቅርህ ከሕይወቴ
ይህ ነው ጸሎቴ

ማንም የተጠማ ቢኖር ወደ እኔ ይምጣ ብለሃል
የሕይወት ውሃ ወንዝ በሰው ሁሉ ላይ ያድራል
የመንፈስ አንደበት የሰማያት እንባ
ፈሰሰ ከአይኔ መቼም ላልጠማ
የሕይወት ውሃ ምንጭ….
',0),(NULL,'ዘመናት አይለውጡህም','AberhamT2','ዘመን በዘመን ሲፈራረቅ 
ቀኑም ለቀኑ ቦታ ቢለቅ
በአመታት መሃል በቀናት ቁጥር 
ከፍ ከፍ እያልክ የምትከብር/2*
የጊዜ ኃይል አይለወጥህም 
አንተ ሕያው ነህ አትቀየርም
ሚመስልህ የለም ሚገዳደርህ 
ማነው ኃይልህን ሚከለክልህ/2*

ዘመናት አይለውጡህም
አመታት አይሽሩህም
ቀናት አይቀይሩህም
አንተ ሁሌ አንተ ነህ
ኢየሱስ ነህ አንተ አልፋ
ኢየሱስ አንተ ኦሜጋ
ኢየሱስ ለዘለአለም
ኢየሱስ ሚመስልህ የለም

ቢፈራረቁ ክረምት ከበጋ 
አንተ ግን ያው ነህ አልፋ ኦሜጋ
ጊዜው ሲገሰግስ እንደ ሰረገላ 
አንተ አታረጅም አትቀርም ኋላ/2*
ሁሉን ፈጥረሃል በስልጣንህ 
ተከናወነ በይሁን ቃልህ
በዙፋንህ ላይ ጸንተ ነዋሪ 
አቻ የለህም ተወዳዳሪ ተገዳዳሪ
ዘመናት.......
የጥንቱ ክንድህ ይሰራል ዛሬም
 ግሩም ችሎታህ አልተቀየረም
አንተ አትሻር አትለወጥም 
ኢየሱስ ሕያው ነህ ለዘለአለም/2*
በሙሴ ዘመን ባህሩን ከፍለህ 
በሐዋሪያት ማዕበሉን ገሰፅክ
ብዙ ሰርተሃል በየዘመናት 
እጅግ ድንቅ ነው የአንተ ታምራት
ዘመናት....... /../
',0),(NULL,'ላመስግነው አምላኬን','AberhamT2','ምድርና ሞላዋ በቃልህ ያጸናህ
በክብርህ ሞገስ በብርሃንህ አለምን የሞላህ
እንዴት ላክብርህ ዛሬስ ምን ይዤ በፊትህ ልግባ
አዲስ ምስጋና አዲስ ዝማሬ አይበዛብህም እና
እጆቼን ወደ ሰማይ አንስቼ
በንጹህ ልብ ዛሬም እስከ ዘላለም

ላመስግነው አምላኬን
   በሰማይ ላለው ለኢየሱስ ቅኔ ልቀኝለት/2/*
ታማኝነቱንም ገናናነቱን አይቼ

ስለምህረትህ ባስብ ባወራ አመታት ያጥሩኛል
አቤቱ ኢየሱስ የታምራትህ ዘርፍ እረዝሟልና
ለነፍሴ ዘወትር ተሟግተሃል
ሕይወቴንም በደምህ ተቤዥተሃል

እጆቼን ወደ ሰማይ አንስቼ
በንጹህ ልብ ዛሬም እስከ ዘላለም
ላመስግነው አምላኬን .../3/

በላይ በዙፋንህ ላይ በክብር ነግሰህ ታየህ አቤቱ /4/
ላመስግነው አምላኬን /2/
በላይ በዙፋን ላይ በክብር ነግሰህ ታየህ አቤቱ /4/
',0),(NULL,'እስክትለውጠን','AberhamT2','የዘላለም አምላክ የሕይወት ቤዛ
አንተን ፈልገን መጥተናልና
ሕይወት እስከ ትርፉ ዛሬ ስጠን
በቅዱስ መንፈስህ አንተ ሙላን
እንጠብቅህአለን በውሃው ላይ
እንይዘዋአለን የልብስህን ዘርፍ

እስክትለውጠን/3*
እስክትባርከን3*
አንተን እንይዛለን አንተን እንሻለን

ጽዮንን ከወደድክ ከመረጥካት
የክብርህ ማደሪያ ካደረካት
ወደ ዕረፍት ዛሬ እስክትገባ
የኋለኛው ዝናብ እስኪመጣ

እንጠብቅሃአለን…
እስክትባርከን/3* እስክትለውጠን/3*2
አንተን እንይዛለን/3*

አንተን የሚያከብር ልሁን መሰዋዕት/2*
መሰዊያው ይታደስ ልቀደስ/2*
አንተን የሚያከብር ልሁን መሰዋዕት/2*
መንፈሴ ይታደስ ልቀደስ/2*  /2/*
',0),(NULL,'ግሩሙ የሱስ መድኃኒቴ','AberhamT2','እኔ ወዳንተ ሳልመጣ
ገና ሃጢአተኛ ሳለሁ
ፍቅርህ ለኔ ተገለጠ
በጸጋህ ድኛለሁ

ግሩሙ የሱስ መድኃኒቴ
ግሩሙ የሱስ ይገርመኛል
ግሩሙ የሱስ ከክፋቴ
ግሩሙ የሱስ አድኖኛል

አንተ ለነፍሴ መቸገር አልነበረብህም
ግን አምላኬ በኔ ፍቅር ነፍሴን ችላ አላልካትም

ፈቃሩ የሱስ የኔ ጌታ
ፈቃሩ የሱስ አፍቅሮኛል
ፈቃሩ የሱስ የኔ አለኝታ
ፈቃሩ የሱስ ለውጦኛል

የሰማዩን ርዝመት ያወቅክ የመረመርከው
የምድርን ምስጥር የያዝክ እኔን የፈጠርከው

ታጋሹ የሱስ ቻዩ ጌታ
ታጋሹ የሱስ ታግሶኛል
ታጋሹ የሱስ ብበድልም
ታጋሹ የሱስ አንጽቶኛል
',0),(NULL,'I‘VE GOT SO MUCH','AberhamT2','ገመድ ባማረ ስፍራ ወድቃልኝ ዕርስቴም ተዋበችልኝ
የሃዘን ዘመኔ ተረሳ በሰማይ ደስታ ተሞላ
እድል ፋንታ ስለሆነኝ 
በሕይወት ጎዳና ላይ እግሮቼን አጸናው
ምስጋና አምልኮ ውዳሴ ለንጉሡ
በሰማይ ሰማያት መላዕክት ይዘምሩ
የዘላለም ደጃጆችም ለአምላካችን ይከፈቱ
እኛም እንበል ማራናታ ኢየሱስ ሆይ ቶሎ ና

I’ve got so much to be thankful for
All of the things you’ve done for me
The goodness you’ve poured into my life 
All of the things you’ve done for me
You have made me glad (2x)
And I will sing for joy
And I will shout for you
And it is all because of you
You have  turned my mourning into dancing now
And it’s all because of you

I’ve got joy, I’ve got peace so much to rejoice over
Life an Offering of  praise to you
ምስጋና አምልኮ ውዳሴ ለንጉሡ
በሰማይ ሰማያት መላእክት ይዘምሩ
የዘላለም ደጃጆችም ለአምላካችን ይከፈቱ
እኛም እንበል ማራናታ ኢየሱስ ሆይ ቶሎ ና
ገመድ ባማረ ስፍራ ወድቃልኝ ዕርስቴም ተዋበችልኝ
',0),(NULL,'HOW GREAT THOU ART','AberhamT2','Oh Lord my God when I in awae struck wonder
Consider all the works thy hands have made
I see the stars, and I hear the roaring thunder
Thy power throughout the universe displayed
 
Then sings my song my savior God to thee
How great thou art, how great thou art /2/
ክርስቶስ ኢየሱስ በታላቅ ክብር መጥቶ
ይዞኝ ሲሄድ ደስታዬ እንዴት ይሆን
በዚያም ለእርሱ በምስጋና እሰግዳለሁ
በታላቁ ግሩም ኃያል አምላክ
ነፍሴ ላንተ መዝሙር ታቀርባለች
ኃያል ግሩም ታላቅ አምላክ /2/

When Christ shall come with shouts of acclamation
And take me home, what joy shall feel my heart
Then I shall bow in humble adoration
And then proclaim my God how great You are

Then sings my song my savior God to thee
How great thou art, how great thou art /2/

Oh Lord you‘re worthy to be praised in all the earth
Then sings my song my savior God to thee
How great thou art, how great thou art /2/
',0),(NULL,'THEY THAT WAIT','AberhamT2','Wait on, wait on, wait on the Lord /3/ 
They that wait upon the Lord
Shall renew their strength
They shall mount up with wings as an eagle
They shall run and not grow weary
They shall walk and not faint
They that wait, they that wait, they that wait
 
I’m waiting for my blessing /2/
I’m waiting Lord
They that wait they that wait ….
 
Let us not grow weary in well doing
I know that my season is going to come
Let us not grow tired in the running
I know my rewards is coming soon
 
I will wait on you (Said I will wait on you lord)
I will trust in you (I’ll trust in you with all my heart)
I will wait on you (I’ll wait on you, I will)
I will trust in you (Trust in you Lord with all my heart)
I will wait on you (The name of the lord is a strong tower)
I will trust in you (I will trust in the lord)

I’m waiting for my blessing /2/
I’m waiting Lord
They that wait they that wait
',0),(NULL,'ታማኝ እግዚአብሔር ታማኝ','Betty1','ታማኝ ታማኝ እግዚአብሔር ታማኝ/2*
ገና ድሮ ያኔ ሲያስበኝ 
እግዚአብሔር እርሱ ታማኝ ነው /3/
ሳያፍርብኝ እኔን ሲያድነኝ 
እግዚአብሔር እርሱ ታማኝ /3/

ካነሳሴ ገና ከጅምሩ /
የጠበቀኝ ይኼ ታማኝ ፍቅሩ
ዛሬም ይዞኝ ጉልበት ሆኖልኝ/

ለክብሩ እያዘመረኝ 2*
ዛሬም ይዞኝ ጉልበት ሆኖልኝ
ለክብሩ አልል እያልኩኝ
እልል እያልኩኝ ለስሙ እያዜምኩ
የታሰብኩበትን ፍቅር አደነቅኩ  3* 

    ዛሬ አይደለም ስለ እኔ ሚያስበው
    በዘመኔ ለኔ ለሚሆነው
ያኔ ድሮ ጌታ ያሰበውን
      እኖራለው እሱን የጻፈውን 2* 


ዛሬ ግን ኢየሱስ ስለኔ ሚያስበው /
ታማኝ እግዚአብሔር ታማኝ ነው
አላማው የነበረ አስቀድሞ ያየው/
ታማኝ እግዚአብሔር ታማኝ ነው
አሳብ በልቡ ፈቃድ ያኖረው /
ታማኝ እግዚአብሔር ታማኝ ነው
በብርሃኑ  ሲያመላልሰኝ/
ታማኝ እግዚአብሔር ታማኝ
ይህንን እያሰብኩ ለስሙ እያዜምኩ/ 
የዳንኩበት መዳን ፍቅሩን አደነቅኩ
 ገና ድሮ ያኔ ሲያስበኝ/
ከፍጥረቱ ለይቶ ሲያውቀኝ
 ላዘጋጀው የታሰበልኝ/
ለአላማው እግዚአብሔር ታማኝ 2* 

እልል አያልኩኝ … 
ታማኝ ታማኝ እግዚአብሔር…  
',0),(NULL,'እኔን የሚገርመኝ ኢየሱስ','Betty1','የነፍሴን ጩኸት አዳምጠሃል
የልቤን ናፍቆት አድርገሃል
ገርሞኛል ምህረትህ ገርሞኛል
ገርሞኛል ደግነትህ ገርሞኛል (2)

በሬ ዘግቼ ያለቀስኩበት የለመንኩሁን
የልቤን ናፍቆት አድርግልኝ የጠየኩሁን
በደግ እጅህ ሸሸግ አድርገህ ስትሰጠኝ
ብል ይበቃል ወይ ይሄ ደግነት አስገረመኝ

በሬን ዘግቼ የለመንኩህን
የልቤን ናፍቆት የጠየኩሁን
በደግ እጅህ ስትጠኝ 
ብል ይበቃል ወይ ገረመኝ

መልካም የሆነውን እፈጽመው ዘንድ እተጋለሁ
ያልከኝ ኢየሱስ ተስፋ ላረገኝ እሰራለሁ
አከናወንከው እንደ ፈቃድህ ልመናዬን
አትረፈረፍከው እስከምገረም ጌታ መልሴን
  እፈጽመው ዘንድ እተጋለሁ 
  ያልከኝ በቃልህ እሰራለሁ
  አከናወንከው ፈቃድህን
  በጎ የሆነውን ስጦታህን
የነፍስንም ጩኸት 
ያደምጣል ይኼ ጌታዬ/3*
የልብንም ናፍቆት 
ያደርጋል ይኼ ጌታዬ/3* 
በምክሩ ያስባል ጌታዬ

   በቸርነት እሱ ፍጹም ባለጠጋ
   አያበላልጥም በፍቅር ሲጠጋ
   ሲሰጥ አይሰስትም ሙሉ አትረፍርፎ

እኔን የሚገርመኝ ኢየሱስ 
እኔን የሚደንቀኝ ኢየሱስ 
እኔን የሚስበኝ

በዛሬ ላይ ሆኖ የነገን የሚያውቅ
ለሚሰራው ሁሉ የሚጠነቀቅ
የማንም አይምሮ የማይገምተው
ስፋቱ ጥልቀቱ እጅግ እሩቅ ነው

እኔን የሚገርመኝ ኢየሱስ ….

እኔን የሚደንቀኝ ኢየሱስ 
እኔን የሚስበኝ
አይገርመኝም የቱም ነገር
አይደንቀኝም የቱም ነገር

እኔን የሚገርመኝ……..
',0),(NULL,'እስቲ ላመስግንህ','Betty1','እስቲ ላመስግንህ
ለውለታህ ምላሽ ዋጋ ባይሆንም
ላንተ የምሰጠው ሌላ የለኝም / 2*
 ይሁንልህ ልበል ክበር /8*


ከማላልፈው ሁሉ ጠብቀህ
ዘመኔን በፍቅርህ አስውበህ
ይሄ አነሰ ብለህ ይሄው ዛሬ
አፌን ሞልተኀው በዝማሬ
እስቲ ላመስግንህ
ይሁንልህ ልበል ክብር /8* 

እድል ፈንታዬ የሆንክልኝ
ነፍሴን በእረፍት ያኖርክልኝ
እርህራሄህ ምህረትህ
ያልተለየኝ ታማኝነትህ
እስቲ ላመሰግንህ

እንዳመሰግን ግድ የሚለኝ
የሱስ ውለታህ ትውስ አለኝ
ከክፉ ሁሉ የጠበቀኝ
መልካምነትህ ትውስ አለኝ
እንዳመሰግን ግድ የሚለኝ
ጌታ ምህረትህ ትውስ አለኝ
የማላልፈውን ያሳለፈኝ
የሱስ ጥበቃህ ትውስ አለኝ


አላማህ በኔ ላይ ፍቅር ነው ይገርመኛል እግዚአብሔር
ምህረትህ ሁል ጊዜ ገኖልኝ አለሁ እግርህ ስር

ዛሬም ደስታዬ ነህ ኢየሱስ የነፍሴ ንጉስ
ክብርን በሙሉ ሃይሌ እሰጣለሁ አንተን ላነግስ

 ይሁንልህ እያልኩ ክብር/ 8*

ክበር እያልኩኝ ብዘምርልህ አይበዛብህም

አምላኬ ብልህ/ ጌታዬ ብልህ/ጌታዬ ብልህ

ክበር እያልኩኝ ብዘምርልህ አይበዛብህም

ተመስገን ብልህ/ ተመስገን ብልህ/ተመስገን ብልህ

ክበር እያልኩኝ ብዘምርልህ አይበዛብህም

እልል ብልህ/ እልል ብልህ/እልል ብልህ
',0),(NULL,'ምስጋናን ዘምሬ አላልፍም','Betty1','ምስጋናን ዘምሬ አላልፍም
  ፈጥኜ ሥራህ አልረሳም
  ለነፍሴ ክሳትን አላመጣም
  ያዳንከኝን ጌታ አልረሳም 

ኢየሱስ አልረሳም ምህረትህን
ኢየሱስ አልረሳም ፍቅርህን
ኢየሱስ አልረሳም ውለታህን
አምላኬ አልረሳም

እንዴት እረሳለሁ የወጣሁበትን
እሩሩህ እጅህ ክንድህ የረዳኝን
ለዛሬው እኔነቴ ምክንያቱ አንተ ነህ
ከዚያ ከሞት ቦታ በፍቅርህ አንስተህ
እንዴት እረሳለሁ
ሥራህን ፈጥኜ አልረሳም
ምስጋናን ይልቅ አበዛለሁ
ያደረክልኝን እያየሁ
ወደ ፊት ደግሞ እዘረጋለሁ

ለኑሮዬ ጣዕም ለሕይወቴ ጋሻ
ለጉዞዬ ምርኩዝ ወደ አንተ መድረሻ
መንፈስህ ሙላቴ ፀጋህ ድጋፌ ነው
ዘመኔን ጨርሼ ፊትህን እስካየሁ
እንዴት እረሳለሁ
አላጉረመርምም በድንኳኔ
አሰማለሁ እልልታ ደግሜ
ያደረክልኝን እያየሁ
ወደ ፊት ደግሞ እዘረጋለሁ

የተራበች ነፍሴን አንተ አጥግበሃል
ተራቁታ የነበረች በረከትህ ሞልቷል
ጨለማ አልፎ ሄዶ ብርሃንህ ወጥቷል
እኔም የአንተ ሆኜ ተአምራትህ በዝቷል
እንዴት እረሳለሁ
ያለፈውን አረሳም አውቃለሁ
ዛሬ ግን ምስጋና አበዛለሁ
ያደረክልኝን እያየሁ
ወደ ፊት ደግሞ ዘረጋለሁ

አልረሳም እንዴት እረሳለሁ
በሕይወቴ ዘመን ለእኔ ያደረከው
ብዙ ነው እንዴት እረሳለሁ
',0),(NULL,'ቃልህ ሕይወቴን','Betty1','ልቤን ያቀናልኝ ሥርዐት ያሳየኝ
ለመንገዴ ብርሃን እየሆነልኝ
ባሪያህ እንዳስተውል ምህረት እንዳገኝ
አካሄዴ ሁሉ እንዲቀናልኝ
ሕያው ያደረገኝ ወደ አንተ የሳበኝ/2*
ቃልህ ነው ኢየሱስ የደረሰልኝ/2*
እናገራለሁ ይሄን ቃልህን
ለፍጥረት ሁሉ ዕረፍት እንዲሆን
በጨለማ ያለው ብርሃን እንዲያይ
ነፍሱ እንዲረካ እንዳይሰቃይ
ለእኔ እንደመጣ ቃልህ እንደፈታኝ
ወንድሜን/እህቴ ይፍታ ዛሬ አድንልኝ /2/

ኢየሱሴ ቃልህ ሕይወቴን ለውጦታል
ቃልህ ሕይወቴን አጽናንቶታል
ቃልህ ሕይወቴን ደግፎታል /2/
ለሌላም ይትረፍ ነፍሱን ያሳረፈ/4*

ከእልፍና ወርቅ ከመልካም ነገር
ለኔስ ይሻለኛል ኢየሱስ የአፍህ ቃል
በሰማይ ዘላለም የምታኖረውን
ለልጅ ልጅ ለትውልድ የምትጠብቀውን
ሕግህ ተድላዬ ነው ቃልህ ደስታዬ
ምመላለስበት የሕይወት ምርጫዬ /2/

ኢየሱሴ……

አቤቱ እንደ ቃልህ ለእኔ ለባሪያህ
ስትሰራ አየሁ መልካም አድርገህ
ሕግህን እንድማር ለካ ያስጨነከኝ
ከንቱ ነገር እኔን እንዳያገኘኝ
የአመጽን መንገድ ከእኔ አርቀህ
ቃልህ አጠነከረኝ በሕግህ ምህረትህ /2/
ምን ከልካይ አለው ተአምራትን
አይኖቼ ተከፍተው እያለሁ በምድርህ
የእውነትህ ቃል ከአፌ ሳይርቅ
እንዳሰላስል እንድጠነቀቅ
እጆቼን ላንሳ ወደ ትዛዝህ
ደስ ወደ ሚለኝ ወደ ሥርዐትህ/2*
ኢየሱሴ…
',0),(NULL,'በአንተ እዚህ ደረስኩ ጌታዬ','Betty1','በአንተ እዚህ ደረስኩ ጌታዬ በአንተ
በአንተ እዚህ ደረስኩ ኢየሱሴ በአንተ
በአንተ በማትጥለው
በአንተ በማትተወው
በአንተ በምትደግፈው በመድኃኒቴ /2/

የሚያልፈው አልፎልኝ በድል ዛሬ
ላቆምከኝ ኢየሱስ በእግሬ
የክብር መስዋዕት እሰዋለሁ
መቅደሱን በእልልታ እሞላለሁ

ለአንተ ላስረሳኸኝ/2*
ለአንተ መከራዬን/2*
ዳግም ዞሬ ላላየው /2*
ፍጹም ያንን ዘመን/2*

በከበደኝ ጊዜ በሐዘን
ከእኔ መቼ አራካት እጅህን
የድል ቀን እስከማይ ስታባብለኝ
ኢየሱስ በፈቃድህ ስትመራኝ
አታውቅ ሰው ማሳዘን
ቢያልፍም ሁሉ ነገር
ከአንተ ለተጠጋው
ለእርሱ መላ አለው
ለእርሱ መላ አለው በጌታ ላለው
ለእርሱ መላ አለው በኢየሱስ ላለው /2/

የሚሸከም አምላክ ስላለው
የሚደግፍ አምላክ ስላለው
የሚያሳርፍ አምላክ ስላለው
የሚባርክ አምላክ ስላለው
መላ አለው

እዚህ ደርሻለሁ ተለይቼ
የቀረው ዘመኔን ለአንተ ትቼ
እኖራለሁ ገና እንደ ፈቃድህ
ደግሞ ይሸከመኛል ምህረትህ
በዚህ መቼ ያበቃል 
ፍቅርህ ገና ይዘልቃል
ከአንተ ልታኖረኝ
የጸና ኪዳን አለኝ /2/
እራራህልኝ/2*
ተጠነከክልኝ የአንተው/
የራስህ አረከኝ/2*
',0),(NULL,'አውልቆ ጣለልኝ የእጄን ሰንሰለት','Betty1','አውልቆ ጣለልኝ የእጄን ሰንሰለት
በጠላቴ ሐሰት የታሰርኩበት
ፍጹም ለፈቃዱ ለሐሳቡ አልተወኝ
ይልቅ በታምራት እያሳለፈኝ
ምሽጉ ቢናጋ ጦር ቢወረወር
አያስደነግጠኝ ሰልፉ የእግዚአብሔር
በወደደኝ በእርሱ ደግሞ አሸንፋለሁ
መሸነፍ አያውቅም ድል የእግዚአብሔር ነው

ማሳለፍ የሚያውቀው አሳለፈኝ
ማሻገር የሚያውቀው አሻገረኝ
መሸከም የሚያውቀው ተሸክሞኝ
ይኸው ዛሬ በድል  አቁሞኝ

በድል ያቆመኝ/2* እግዚአብሔር ይክበርልኝ
በድል ያቆመኝ/2* ጌታዬ ይንገስልኝ
ማሳለፍ የሚያውቀው……

ፈልጎ ነበረ እንድቀጠቀጥ
ጠላቴን እንድፈራ ልቤ እንዲቀልጥ
ተስፋዬን እንድጥል እንዳላስበው
የተገባልኝ ቃል እንድረሳው
ግን እሱ አልተወኝም ኢየሱስ ደግ ነው
በጨነቀኝ ጊዜ መንፈሱን ላከው
ተጽናናው በቃሉ እረፍት ሆነልኝ
ታማኙ አምላኬ ደስታ አድርጎልኝ

ማሳለፍ ለሚያውቀው ምስጋና አለኝ
ማሻገር ለሚያውቀው እልልታ አለኝ
መሸከም ለሚያውቀው አምልኮ አለኝ
እኔን ዛሬ በድል አቆመኝ
በድል ያቆመኝ/2*…

ቢያስነድድም እሳት በሰባት እጥፍ
እኔስ አምላክ አለኝ በዚያ የሚያሳልፍ
መንገዴን በፊቱ የሚያቀናልኝ
ዙሪያዬን በእሳት የቀጠረልኝ
በደሙ የከለለኝ በእጁ የቀረጸኝ
ማህተም ያለብኝ ለእርሱ የለየኝ
እራሱን እስኪሰጥ አንዴ የወደደኝ
እኔን አታገኝም ጠላት አትመኝ

አምላኬ ጌታዬ
ምታመንበት መደገፊያዬ
ያመለጥኩበት መሸሸጊያዬ
ስሙን ስጠራው ሚደርስልኝ
የሚያሳልፈኝ የሚያሻግረኝ /2/
',0),(NULL,'በግራ በቀኝ አንድስ አያድክመኝ','Betty1','በግራ በቀኝ አንድስ አያድክመኝ
ሁሉን ትቼዋለሁ እኔ የኢየሱስ ነኝ
ወዳየልኝ ክብር እሄዳለሁ ወዳዘጋጀልኝ/2* 2

እኔ አይሰማኝም የሞገዱ ድምጽ
በግራ በቀኜ ዙሪያዬ ቢነፍስ
ተስፋዬ አንተን ብቻ እናፍቃለሁ
የአባቶቼን አምላክ ፊትህን ላየው /2/
ኢየሱስ ለእኔ ናፍቆቴ
ጌታዬ ለእኔ ናፍቆቴ
  አምላኬ ጌታዬ ለእኔ /2/

እንግዲህ አልደክምም ልሂድ ከአንተ ጋራ
በምድር ዙሪያ ሁሉ ስምህ እንዲጠራ
ይሄ ደጉ እጅህ ዛሬም ሲፈውስ
ታምራትህን እንዲያደርግ ለሥጋም ለነፍስ/2/
ታምራትህን አያለሁ
ድንቅ ሥራህን አያለሁ
አያለሁ እደነቃለሁ

እስማማለሁ ከአንተ ከወደድከኝ ጋር
ዕጣዬ ዕድሌን ከምታሳምር
በሕይወቴ ሁሉ ተስፋ ከሆንከኝ
ቀን አይተህ እንደ ሰው ከማትጥለኝ /2/
ልስማማ ዛሬም ከአንተ ጋር
ልሂድ ዛሬም ከአንተ ጋር
አይቼ የአንተን ፍለጋ /2/

ሌላ አልፈልግም ትበቃኛለህ
አላፍርም በአንተ ታኮራኛለህ
ይሻላል ኢየሱስ አንተን እጠብቃለሁ
የቀረው ይቅርብኝ ይሁን መርጫለሁ /2/
አላፍርም በአንተ ኮራለሁ
አላፍርም በአንተ ኮራለሁ
ጌታዬ ጠብቅሃለሁ /2/
',0),(NULL,'ያውቅበታል','Betty1','ያውቅበታል ውብ ማድረግን ሁሉን በጊዜው/4*
የአመታት እንባ በእሱ ይታበሳል
የዘመናት ጩኸት ለካ ይመለሳል
   በታማኙ ኢየሱስ ይመለሳል/2*
   ከታማኙ ጌታ መልስ ይመጣል/2*

ተለምኖ ከእሱ ምንም አይታጣ 
በትዕግስት ከቆዩ ጌታ እስኪመጣ
ለካ ይመለሳል ተስፋ የታጣለት
በታማኙ ጌታ በተጠበቀለት ቀን ይመለሳል
    እግዚአብሔርን አምኖ ይመለሳል
    በትዕግስት ከቆዩ ይመለሳል
    አይቀርም ይመጣል ቀን ይመጣል
    ከእጁ ሊቀበለው ሊቀበለው
    አይቀርም ይመጣል/2* ከእጁ ሊቀበለው ሊቀበለው /2/

ይቆያል በፊቱ በጸሎት ጸጥታ 
ለመቀበል ከእርሱ ከታላቁ ጌታ
ይመጣል ያ ቀን የሚናፍቁት
ውብ የሆነው ሥራው የሚታይበት የጌታ ቀን
   የተወሰነውን ለመቀበል
   ለሁሉም ጊዜ አለው ይሆናል
   የዘመናት ቢሆን የትናንት
   በተጠበቀለት በዚያን ለት
   የዘመናት ቢሆን ወይም የትናንት
   በተጠበቀለት በዚያን ለት

አይቀርም ይሆናል ይሆናል
የሚታመኑትን ጌታ ያውቃል
አያሳፍርም  እርሱ አይጥልም
በጊዜያት ፈቃዱን ያደርጋል /3/

   ይመጣል የእግዚአብሔር ቀን
   በጸሎት ለቆየው
   ስፍራውንም ሳይለቅ ለሚጠብቀው /2/

ቢዘገይ ያሳየው ተስፋው
አምላኩ የነገረው ያለው
አበቃልኝ ቢል አብርሃም
ይሳቅ መምጣቱ አልቀረም
    
ይመጣል የእግዚአብሔር ቀን….

ሐዘኗ በርትቶ እጅግ
ሃና ስትጸልይ ስትቃትት
ለሚያዩአት ተስፋ የሌላት
እግዚአብሔር ግን ሳሙኤልን ሰጣት

    ገና ይከፈታል እህህህህ
    የአምላኬ ደጅ እህህህህ
    በተስፋ የቆየው እሁሁሁሁ
    ሊወስድ ከእሱ እጅ እህህህህ
    በእምነት የቆየው ይቀበላል እንጂ/3*
    በተስፋ የቆየው ይቀበላል እንጂ/3*
',0),(NULL,'ለምን ይሄን አረክ','Betty1','ለምን ይሄን አረክ አይባልም እርሱ/2*
እግዚአብሔር ቅን ነው ንጹህ ነው መቅደሱ/2*
እግዚአብሔር ቅን ነው ትክክል ነው መልሱ
የወደደውን በእኛ ላይ ሊያደርግ
ሐሳቡ በሙሉ ይሆናል አይቀርም
ለእኛ የሚበጀውን እሱ ቀድሞ ያውቃል
አሜን ትክክል ነው ሁሌ ይጠነቀቃል

ከምድር ላይ ቢያነሳ ከታች ወደ ላይ
ሞገስን ጨምሮ በቅባቱ ላይ
ፍጹም የተረሳ በሰው ያልታየውን
እረኛን አክብሮ ንጉስ ቢያደርገው
ከልካዩ ማነው?
ወይ የከበረውን እሱ ቢያዋርድ
ዝቅ ዝቅ ቢያደርገው በራሱ መንገድ
የሚሆነው ይሁን ሐሳቡ የእሱ ነው
በእሳት በባሕር ውስጥ ሁሌ መንገድ ያለው
ኢየሱስ ጌታ ነው
ዛሬ የምታስበው ሆኖ ባታየው
የሚሆነው ሁሉ አንተ ያልገመትከው
ሐሳብህ ከሐሳቤ ይርቃል ያለው
የሚበልጥን ነገር ሰርቶ ስታየው
ምን ምላሽ አለው

ሰው እንደሚያስበው እግዚአብሔር አይሰራም
ወይም እንደሚመኘው እርሱ አያደርግም
ሞገስን የሚሆነው ፈቃዱ ብቻ ነው
ይህን ለምን አረክ የሚለውስ ማን ነው?
እርሱ ትክክል ነው
ለምን ይኼን አረክ……..

         በሰማይ በምድር ምንም ቢደረግ
ሁሉ ይከናወናል እንደ እርሱ ፈቃድ
ይሄ ለምን ሆነ ጌታ አይባልም
አስቀድሞ ያውቀዋል ከእርሱ አይሰወርም
         ሁሌ እሱ ዘላለም
',0),(NULL,'የምስጋና ሰው አደረገኝ','Betty1','ያለፈው ኑሮዬን ቀርቷል ትቼዋለሁ
ዛሬ እኮ በኢየሱስ እጅግ ከብሬአለሁ
ባሪያው ነኝ ለጌታ የምገዛለት
ምስጋናን ጠዋት ማታ የማመጣለት

የምስጋና ሰው አደረገኝ
የእልልታ ሰው አደረገኝ
የዝማሬ ሰው አደረገኝ /2/
ሊከብርበት  በሕይወቴ ሊከብርበት
ሊከብርበት በነፍሴ ላይ ሊከብርበት
ሊከብርበት በኑሮዬ ሊከብርበት
ሊከብርበት በእኔነቴ ሊከብርበት

ቀንበር ተሰበረ በጌታ ቅባት
ፍቅር አስገድዶት ወደ እኔ አምጥቶት
ሰንሰለት ወደቀ ከእስራት ፈታኝ
ያለፈውን ሁሉ ላያስብብኝ

ስሙን እንዳከብር ጽድቁን እንዳወራ
በእኔም ሕይወት ኢየሱስ ታምራት ከሰራ
ከማያልቀው ፀጋ ከበረከት ምንጭ
ከታደልኩ ልቀዳ ከአምላኬ ደጅ
ከእልፍ አእላፍቱ መላዕክት ጋር
እሄዳለሁ ገና ጌታዬን ላከብር
በዚህ አያበቃም የተሰጠኝ ፀጋ
ይጨምራል ገና ሌሊቱ እስኪነጋ /3/

የዝማሬ ሰው ካደረገኝ
የእልልታ ሰው ካደረገኝ
ለኢየሱስ ክብርን ሰጣለሁኝ/
ለአምላኬ ክብርን ሰጣለሁኝ /2/

ይክበርበት በሕይወቴ ይክበርበት
ይክበርበት በነፍሴ ላይ ይክበርበት
ይክበርበት በኑሮዬ ይክበርበት
ይክበርበት በእኔነቴ ይክበርበት

የምስጋና ሰው አደረገኝ
የእልልታ ሰው አደረገኝ
   የዝማሬ ሰው አደረገኝ /.../
',0),(NULL,'ለታረደው በግ ምስጋና','Betty2','ሐዘን ያበቃል ዛሬ ያለንበት
ደርሷል ሰአቱ የምንጽናናበት
ከአምላካችን ጋር የምንከብርበት
በእምነት በደስታ የምንኖርበት/2/

በመለከት ድምጽ ታጅቦ ይመጣል
በዝማሬ ድምጽ ታጅቦ ይመጣል
በእልልታ ድምጽ ታጅቦ ይመጣል
ጌታችን/ኢየሱስ ይገለጣል /2/

በክብር አብረን ከአምላካችን ጋር
የምድር መከራ ጭንቀቱን ትተን
መኖሪያ ሆኖ ለዘለዓለም
ዕረፍት ልናርፍ እንሄዳለን /2/
  በመለከት…

ዓይንም ሁሉ የወጉትም ያዩታል
ፍጥረት ሁሉ በእርግጥ ጌታን ያዩታል
ያ ታላቅ ክብር ለሰው ሁሉ ተገልጦ
የሱስ ብቻ በዙፋኑ ተቀምጦ

ከፍ ከፍ ያለው ወደ ሰማይ የወጣው
ተመልሶ በደመና የሚመጣው
አልፋ ኦሜጋ የሁሉ ገዢ የሆነው
ጌታ ሲነግስ በቃሉ የታመነው

እኛም እንዘምራለን/እንቀኛለን /2*
እንዲህ እንላለን
በሰማይ ደስታ ነው/2*
በምድር ደስታ ነው/2*
ለታረደው በግ ምስጋና ነው/እልልታ/ ነው
ለታረደው በግ አምልኮ/ ዝማሬ ነው
ቅዱስ /3* የነበርከው ያለህና የምትኖር የምትመጣው
አምላካችን ታላቁ እግዚአብሔር
መጥተናል ስምህን ልናከብር

ምስጋናው ይብዛ/2/* ምስጋው ይብዛ ይብዛ ይጨመር 
ምስጋና ይጨመር ለእግዚአብሔር
አምልኮ ይብዛ/2* አምልኮው ይብዛ ይብዛ ይጨመር 
አምልኮ ይጨምር ለእግዚአብሔር
እልልታው ይብዛ/2* እልልታው ይብዛ ይብዛ ይጨመር 
እልልታው ይጨመር ለእግዚአብሔር
',0),(NULL,'እወድሃለሁ','Betty2','ገናናው ምህረትህ አገኘኝ
ለነፍሴ እረፍት ሰጥተህ ወደድከኝ
ሌላ ምንስ ልናገር እችላለሁ
ለፍቅርህ ለውለታህ ዘምራለሁ
ምስጋናን ደግሜ ጨምራለሁ 

አንተን ኢየሱሴን ወድሃለሁ
ግዛኝ ለዘላለም እገዛለሁ
እጆቼን አነሳው ተማርኬ
እንደምን ልዩ ነው ፍቅርህ አምላኬ /2/

በምታኖረኝ ኑሮ በምድር ሳለሁ
ዕድል ፋንታዬ አንተ ነህ ታድያለሁ
ማርከህኸኛል ኢየሱስ ወድሃለሁ
የፍቅርንም ትርጉም በአንተ አየሁ
ከዚህ የሚበልጥ መውደድ ለማንም የለው

በልቤ የፈሰሰው የፍቅርህን ፍሰት
ብዘምር አይበቃም ለተያዝኩበት
ዘመኔን ለእረፍት ነፍሴን ለሐሴት
ምርኮ አደረከው ኢየሱስ በአንተ ቤት
ፍቅርህ ልዩ ነው/2* አሃሃ
ፍቅርህ ልዩ ነው/2* ኦሆሆ
ፍቅርህ ልዩ ነው/2* ኧረ እንዴት ልናገረው/2*
ፍቅርህ ልዩ ነው/2* ኧረ እንዴት ልናገረው/2*

ዘወትር አይጠፋም በልቤ ይነዳል
ፍቅርህ ልዩ ነው ይህን ተለማምዷል
ከዚህ የተነሳ በእቅፍህ መኖሬ
በመተማመን ነው በጥላህ ማደሬ
    ፍቅርህ የማይጎድልብህ እህህ
ጌታ በምን ልግለጽልህ  እህህ
እግዚአብሔር ፍቅር ነህ እግዚኣብሔር/ 10*
',0),(NULL,'የልቤ','Betty2','የልቤ....የልቤ...የነፍሴ...የነፍሴ
የልቤ የልቤ የነፍሴ የነፍሴ  
የልቤ ናፍቆት የልቤ የነፍሴ የነፍሴ
የልቤ የልቤ የነፍሴ የነፍሴ

የልቤን ናፍቆት ብቻ  አስባለሁ
የኢየሱስን ፊት እናፍቃለሁ
አምላኬ ብቻ ለኔ ተስፋዬ 
መመኪያዬ  ምንም አይያዘኝ
ምንም አይለየኝ ከጌታዬ

ዛሬ በምድር ያለው ቢያታክተኝም
አምናለሁ ፊትህን ከማየት አያስቀረኝም
ስፍራ አለ ያዘጋጀኸው አንተ ያለህበት
መኖርያ በዚያ ስላለኝ ልቤ አይታወክ ልቤ አይታወክ


እጅግ ቢከብድም ጉዞው መንገዱ
በምድር ያለው ውጣ ውረዱ

ወደ ኋላዬ ዞሬ አላይም 
አንዴ ወጥቻለሁ አልመለስም
ከተመረጠው ከሕዝብህ ጋራ 
ዕድሌን አርገው ጌታዬ አደራ

ምንም ይቅርብኝ በምድር እኔ 
ነፍሴ መርጣለች አንተን መድህኔ
ምንም አይለየኝ ብያለሁ ወድጄ ወዳንተ እጠጋለሁ

እስካይህ ድረስ ፊት ለፊት እጨክናለሁ ወደፊት
አላማዬ አንተ ብርታቴ የሕይወት መንገድ እፊቴ

የምመራብህ እያየሁ መንፈስህ አለኝ አምናለሁ

ናፍቆቴ አንተን ፊትህን ማየት
 የሚያስገርመው ክብርህን በሙላት
ቆሜ መዘመር ቀንና ሌሊት
ጌታ አንተን ማክበር እንደመላዕክት

በፊትህ መውደቅ መስገድ ወደ እግርህ
አምልኮን ማቅረብ ለቅድስናህ
መልካም የሆነ ውዳሴ እልልታ 
ዘላለም መስጠት ለክብርህ ጌታ

ይኼ ነው ጌታ ምኞቴ  
ፊትህን ማየት ናፍቆቴ
ሙሉ ክብርህን ግርማህን  
በአእላፋት ዘንድ ያለህን

ውበትህን ማድነቅ ስራህን 
 የቀደመውን ሃሳብህን
በምትኖርበት ከፍታ 
ነፍሴ ልትኖር ተፈትታ
',0),(NULL,'እኔስ ካንተ ሌላ ','Betty2','አጽንቶ ያቆመኝን ፍቅር አየሁኝ 
ደግፎ ያቆመኝን ፍቅር አየሁኝ

   እኔስ ካንተ ሌላ ጌታዬ ማን አለኝ
   እኔስ ካንተ ሌላ ኢየሱስ ማን አለኝ
    እኔስ ካንተ ሌላ በእውነት ማን አለኝ
   እኔስ ካንተ ሌላ አባት ማን አለኝ

ሥራህ እጅግ ድንቅ ነው ነፍሴ ታውቀዋለች
የከበረ ሐሳብህ በእኔም ዘንድ ከብራለች
ከምለው በላይ ነው መልካምነትህ
በነፍስ በሥጋዬ ለእኔ ሁሉ ነህ

በቀን በጊዜያት በዘመናት በአመታት
ነፍሴ ታውቀዋለች ኢየሱስ ያረክላትን 
የአፌ ነገር ሰምተህ አድምጠህ የልቤን ሐሳብ
ልዑል በጥላህ የሸሸከኝ ዘላለም ክበር/2*

ብርታት የሆንከኝ የተደገፍኩብህ
አጽንተህ የያዝከኝ ጌታዬ የታመንኩብህ
እንዴት እኔ ዝም እላለሁ /2/
ለፍቅር እዘምራለሁ/4*

ሐዘኔን ለውጥከው ለምስጋና አረከው
ጭንቀቴን ለወጥከው ለምስጋና አረከው
ኑሮዬን ለወጥከው ለምስጋና አረከው
ሕይወቴን ለወጥከው ለምስጋና አረከው

ቸርነትህን ቀመስኩ ወደ አንተ ስቅርብ
ሕይወቴን ስትይዘው በፍቅርህ ገመድ
ያላየሁትን አየሁ አይኔ ተገለጠ
ጨለማው ዘመኔ በአንተ ተለወጠ

 ለምስጋና አረከው ጌታ ለምስጋና ሁሉን ለምስጋና
  ለእልልታ አረከው /ኢየሱስ/ ሁሉን ለእልልታ
  ይብዛልህ ብዙ ምስጋና የልቤ ጌታ
  አውቃለች ነፍሴ አይታለች የምን ዝምታ /2/

ለካስ የእግዚአብሔር አሰራር ብዙ 
ለካስ የአምላኬ መንገዱ ብዙ
   ከእርሱ ጋር ሲጓዙ /2/
በእኔ መረዳት በእኔ እውቀት 
መች ይከናወናል የሕይወት ስኬት
ይሁን አልህ ሁሉን ከአፍህ ቃል ወጣ 
ተአምራት ሆነ ወደ እኔ ሲመጣ
  ለምስጋና አረከው ….
',0),(NULL,'ቤተክርስቲያን','Betty2','የሚነፍሰው ነፋስ ሽታውን እወቂ
የጌታን ቃል ያዢ ቁሚ ተጠንቀቂ
ቅድስት ቤተክርስቲያን ተለይ አትደባለቂ/2*

ቀኑ ቀርቧልና የሚመጣበት
ጌታ እግዚእብሔር የሚነግስበት
ዓለም በኃጥያትዋ ምትቀጣበት
የተናገረው ቃል የሚሆንበት ጊዜው ደርሷልና
   ዘመኑ ቀርቧልና የሚያነበው
   የትንቢቱን ቃል የሚሰማና የሚጠብቀው ብጹህ ነው /2/

በስሙ ድኛለሁ ተጠምቄአለሁ
እመላለሳለሁ እዘምራለሁ
ብለሽ እንዳትስቺ እጅግ ተጠንቀቂ
አምስቱ ሰነፎች እንዳሉ እወቂ 
እጅግ ተጠንቀቂ

አንተ የምትዘምር የምትመክር
በቃሉ ተማምነህ የምትመሰክር
ታማኝ ሁን ለእውነት ለተቀበልከው
ሊመዘን ነውና የምትዘራው

ቅድስና ብቻ ወደ እሱ የሚስብሽ 
የመንፈስ ቅዱስ ኃይል ሁሌ እንዲበዛልሽ
ፍሬ እንድታፈሪ ፍቅር እንዲኖርሽ
እንድታሸንፊ ከጌታ ተቀበዪ ዝናቡን ለምነሽ

ቤተክርስቲያን አሁን ጨክነሽ
ጌጠኛውን ልብስሽን ልበሺ
ሙሽራው መጥቶ እንደሚወስድሽ/4*
ቃሉን አስቢ ጊዜውን አይተሽ/4* /2/

   ይመጣል ኢየሱስ /2/ ይመጣል
  ጌታችን ይገለጣል /3*
',0),(NULL,'ቅዱስ ቅዱስ','Betty2','ደስ ብሎኛል ከክፉ አምልጬ ወጥቻለሁ
በእልልታ መቅደሱን አጥናለሁ
በምስጋና ፊቱ እቀርባለሁ እዘምራለሁ

ዝም አያሰኘኝም እዘምራለሁ
የሱስን አግኝቼ እዘምራለሁ
  ታላቅ ታምራቱን እዘምራለሁ
  አይተዋል አይኖቼ እዘምራለሁ
ዝም አያሰኘኝም እዘምራለሁ
ጌታዬን አግኝቼ እዘምራለሁ
  በእሱ መታሰብን እዘምራለሁ
  በዘመኔ አይቼ እዘምራለሁ

ከእጁ ከተቀበልኩ ኢየሱስ ከሰጠኝ
በደስታ ልሰዋ እንዲህ ካቆመኝ
  ያለ ልክ ክብርን እሰጣለሁ
  በዝማሬ ስሙን እጠራለሁ
  ያየሁትን ማዳን አወራለሁ
  ከጠላቴ ፈቃድ/ሃሳብ አምልጫለሁ /2/

ደስ አሰኝቶኛል ደስ ይበለው እርሱ
አምልኮ እልልታዬ ይድረስ መቅደሱ
   በታላቁ ክብር በሞላበት
   በማደሪያው ዝማሬ ይብዛለት
   አእላፋት እልፍ መላዕክቱ
   ቅዱስ ቅዱስ እያሉት ከፊቱ /2/

ቅዱስ ቅዱስ/4*

ቅድስና እጅግ የተዋብክ
ደስ ይለኛል ጌታ አንተን ሳመልክ
ባለብዙ ክብርና ሞገስ
ብዙ ብዙ ዝማሬ ይድረስህ
የሚወዱህ የሚሉህ ንገስ /2/

ቅዱስ ቅዱስ /4*
ቅዱስ ቅዱስ ቅዱስ እላለሁ
በማደሪያ እዘምራለሁ
ዛሬ ይብዛ ያርግ እልልታዬ
ክበርልኝ/ንገስልኝ/ ኢየሱስ ጌታዬ /2/
',0),(NULL,'ቃል ነበረ','Betty2','በመጀመሪያው ቃል ነበረ
ዓለማትን ሁሉ የፈጠረ
እግዚአብሔርም እርሱ ቃል ነበረ 
ሁሉ በእርሱ ሆነ
   ለሰው የሚያበራው 
   እውነተኛው ብርሃን ወደ አለም መጣ /2/

ሕግ በሙሴ ተሰጥቶ ነበረ
ፀጋና እውነት በክርስቶስ ሆነ
ከቶ እግዚአብሔርን ማንም አላየው
ከሰማይ ወርዶ የሱስ ተረከው/4*

እግዚአብሔር ሆነ ከእኛ ጋራ
በሥጋ መጣ ለሁሉ ራራ
ሕዝቡን ከኃጥያት የሚያድነው
ጌታ ኢየሱስ ስሙ ይህ ነው

ለተቀበሉት በስሙ ለሚያምኑ
ስልጣን ይሰጣል ልጆቹ እንዲሆኑ
ወደ እግዚአብሔር ሁሌ የሚማልዱ
በመንፈስና በእውነት የሚሰግዱ /4*
   ከላይ የመጣው ከሁሉ በላይ 
   እንዲሁ አይፈርድም አይኑ እንደሚያይ
   በእሱ የሚያምን ሕይወት አለው
   የዘላለም ሞት አያሰጋው

እውነተኛው ብርሃን ወደ አለም የመጣው
ቃልን ሥጋ ሆነ ፀጋን የተሞላው  /2/

ሙላቱ ሁሉ በእርሱ እንዲኖር
የፈቀደበት የእግዚአብሔር ምስጢር
ቃል ሥጋ ሆኖ ሊመላለስ
አብ ተገለጠ በክርስቶስ
እግዚአብሔር ሆነ ከእኛ ጋራ 
በሥጋ መጣ ለሁሉ እራራ
ሕዝቡን ከኃጥያት የሚያድነው
ጌታ ኢየሱስ ስሙ ነው
   እውነተኛ ብርሃን ወደ ዓለም የመጣው
   ቃልን ሥጋ የሆነው ፀጋን የተሞላው /2/
',0),(NULL,'በሞገስህ','Betty2','ያለ አንተ ሰው በኃይሉ መች ይበረታል
አቅሙም ጉልበቱም ውስን ነው ያልቃል
ምንኛ ትረዳለህ ኃይል የሌለውን
እጅህ/ክንድህ እንዴት ያግዛል ብርታት ይሆናል

በሞገስህ ወጣሁ ጌታዬ 
በሞገስህ ገባሁ ጌታዬ
እኔማ በአንተ ተከልዬ/ 
ስምህ ሆኖኝ ከለላዬ/ 
  አንተ ሆነኸኝ መካሪዬ /3/

ሰውስ በእግዚአብሔር ፊት ጻድቅ አይሆንም
ድካም አለው ጉድለት ፍጹም አይነፃም
እጅግ ታናሽ የሆነ የተናቀውን
አከበርከው ኢየሱስ ክብሩ ለአንተ ይሁን  /2/

በሞገስ የምትመራኝ ምታሰማራኝ
ጌታዬ ለአንተ ክብር አለኝ
ድካሜን የማታይ የምትራራልኝ
ኢየሱሴ ለአንተ ክብር አለኝ
ወደ እራስህ ያስጠጋኸኝ በእጅህ የያዝከኝ
ጌታዬ ለአንተ ክብር አለኝ 
በሞገስህ ወጣሁ …

የሰው ሕይወት በምድር - ብርቱ ሰልፍ ቢሆን ሲኖር
አንተ ያለኸው የያዝከው - በምንም አይሰጋም
በሞገስህ ይወጣል - በሞገስህ ታስቦ ይገባል
መሰማሪያ ሆነህለት - ባንተ ይጠበቃል
   አንተ ያለኸው ጌታ ያለው /2*
   ኢየሱስ ያለው አርፏል/2*
ከመከራ ሥጋት መሸሸግ አውቋል
መከለል አውቋል ዕረፍትን አርፏል
',0),(NULL,'የሚመጣ','Betty2','የሚመጣ በሥልጣን የሚያዝዝ
የእኔ ጌታ ኢየሱስ ልዑል ቅዱስ
የሚመጣ ብቻውን የሚያዝዝ
የእኔ ጌታ ኢየሱስ ልዑል ቅዱስ
የሚገዛ በሥልጣን የሚያዝዝ
የእኛ ጌታ ኢየሱስ ልዑል ቅዱስ
የሚገዛ ብቻውን የሚያዝዝ
የእኛ ጌታ ኢየሱስ ልዑል ቅዱስ

አእላፍ በሰማይ ሚዘምሩለት
ሚያውቁት ቅዱሳን የሚሰግዱለት
ግዑዝ ፍጥረታት የሚያመሰግኑት
በሰማይ በምድር ክበር የሚሉት
ተራሮች ሁሉ የሚጤሱለት
ውሃው ማዕበሉ ሚናውጡለት
የአማልክት አምላክ የተከበረ
እርሱን ለማምለክ ልቤ አመረረ
ልቤ ጨከነ/4*
እኔም የሾምኩት አድርጌ የበላይ/2*
ጌታ ከማንም ከምንም በላይ/2*2

ዘመኔን የደስታ ያረገ
ሐዘኔን በሳቅ የለወጠ
ትልቅ ነው እኔ የማመልከው
ለክብሩ ፍፃሜ የሌለው
ሲወደኝ ጌታ ላይጠላኝ
ሲያነሳኝ ኢየሱስ ላይተወኝ
በደም ነው የእኔ ቃልኪዳን
አልፈራም ልቤ ጨክኗል /2/

ጥበብና ኃይል ለእርሱ ነውና
ለስሙ ይሁን ክብር ምስጋና
ጊዜ ዘመንን ይለዋውጣል
ዕውቀት ማስተዋል ጌታ ይሰጣል
የተሰወረውን ይገላልጣል
በጨለማ ያለውን የጥልቁንም ቃል
አንዳች በፊቱ አልተሰወረም
እርሱን ለማምለክ ልቤ አመረረ

ልዑልን መጠጊያ አድርጌ
ከክፉ ነገር ተሸሽጌ
ልጠራው ስሙን አውቄያለሁ
በክብር ጥላ እጋረዳለሁ
ወዶኛል በዘላለም ፍቅር
ያለፈው ላይታሰብ ይቅር
እኔ ግን ንጉሴን ሾሜያለሁ
በእኔ ላይ ሙሉ ሥልጣን ያለው /2/

አእላፍ በሰማይ ...... 
',0),(NULL,'ከእኔ የሆነ የለም','Betty2','እንድያው በምህረትህ አለፍኩት ሁሉንም/2*
ከእኔ የሆነ የለም/4*

ሰውስ ንጹህ ሆኖ በፊትህ መቼ ይገኛል
ፍጥረቴን ታውቃለህ አንተን መች ደስ ያሰኛል
ኢየሱስ በአንተ ፍቅር ሕይወቴ ባይለወጥ
አውቀዋለሁ እኔ ከክፉ እንዳላመልጥ
ምህረትህ ድርሶ ባይረዳኝ
ዓይኖችህ እኔን ባያዩኝ
በእኔ ችሎታ በእኔ እውቀት
አይሳካልኝ/አይቀናልኝ  የምድር ሕይወት /2/ 

ያለፈውን ታሪክ ያሳለፍኩትን ዘመን
ዞር ብዬ ሳየው እደነቃለሁ አሁን
እንዲያው በምህረትህ ጌታዬ ታግሰኸኝ
የማይቻለውን አምልኬ ችለህልኝ
ሲበዛ ያኔ መከራዬ 
የሥጋ የነፍስ ፈተናዬ
አንተ ባትራራ ባትይዘኝ
ምን እሆን ነበረ ባትረዳኝ /2/

በምህረትህ ሁሉን አልፌአለሁ/2*
ዛሬስ ክበር ውዴ እልሃለሁ/2*
ማዳንህን ጌታ አይቻለሁ/2*
ዛሬስ ክበር ኢየሱስ እልሃለሁ/2*

የያዘኝ መልካምነትህ 
የገዛኝ ኢየሱስ ፍቅርህ ነው
ታሪኬን ሁሉ ለውጦ
ሰው አርጎ እኔን ያቆመው
ስለየቱ ጌታ አወራለሁ 
ለሁሉ አለህ የሚበቃ
ከሕይወት ምህረት ይሻላል
ጌታዬ ያንተ ጥበቃ

አምላኬ/ጌታዬ እኔ ግን በፍቅርህ እጸናለሁ
ክብርህን ሳይ እጠግባለሁ
',0),(NULL,'በእውነትም ጌታዬ','Betty2','ባስፈሪው ጨለማ እኔን በጋረደ
በሚናውጠው ላይ እየተራመደ
አዘዘው ማዕበሉን ፀጥ አደረገው
በእውነትም ጌታዬ እርሱ ጌታ ነው

በእውነትም ጌታዬ ጌታ ነው/2*
   በእውነትም የማመልከው/ኢየሱስ ጌታ ነው
   ማዕበሉን /ወጀቡን ያዘዘው

የበደልን ኃጥያት የአመፃን ብርታት
ወስዶ ይቅር የሚል በታላቅ ምህረት
በሰማይ በምድር ኧረ እንደ እሱ ማነው
ቃላት አይገልፀውም ኢየሱስ ልዩ ነው
   ልዩ ነው በሰማይ ልዩ ነው
   ልዩ ነው በምድር ልዩ ነው
   ልዩ ነው ኢየሱስ ልዩ ነው
   አምላኬ ከሁሉ በላይ ነው  /…./

በእውነትም ጌታዬ ጌታ ነው/2*
በእውነትም የማመልከው/ኢየሱስ ጌታ ነው
ሚመስለው የሌለው

ያሻግራል ጨለማን አንግቶ
ያሳልፋል ጠማማን አቃንቶ
ያነሳል የወደቀውን
ጌታ ኢየሱስ የተጠቃውን
ማክበር ያውቃል የተጣለ አንስቶ
አሰማምሮ በዘይት ቀብቶ
በሐዘን ልቡ የተሰበረው
ቀና ይላል ኢየሱስ ሲያግዘው /2/
በእውነትም ጌታዬ ጌታ ነው/....
',0),(NULL,'ከአንተ ወዴት','Betty2','መሪ ነህ የምትመራኝ በሕይወቴ
ዛሬማ ተለውጦ ማንነቴ
አፌን ሣቅ ሞልተኸዋል ልቤን ደስታ
መከራን ተቀብለህ በእኔ ቦታ
   አወከው ዘላለሜን ቀድመህ ያዝከው
   አሻግረህ ፍፃሜዬን እያየኸው
   ዛሬማ በንጉሱ ተወድጄ 
   ስትመራኝ እያየሁኝ ይዘህ እጄን

ካንተ ወዴት/2* እሄዳለሁ /2/
የሕይወት ቃል አለህ ኢየሱስ አግኝቼሃለሁ
ልኑር ላንተ ተሰጥቼ አምኜሃለሁ
ፍፃሜና ተስፋ አለህ እጠብቅሃለሁ
   እኔ ከፍቅርህ ወዴት እሄዳለሁ
   ከመንፈስህ ወዴት እሄዳለሁ
   እጅህ ያዘኝ ተማርኬአለሁ /2/

አንተ የሌለህበት አይሁንልኝ
በቃ በጎ ፈቃድህ ብቻ ይብዛልኝ
አቅርበኝ ወደ ልብህ አስጠጋኝ
ካሳብህ ውጪ የሆነው አይጠቅመኝም
   እንግዲህ ላትተወኝ ወደኸኛል
   ዘመኔን ምርኮ አድርገህ ሰጥተኸኛል
   አልፈራም ከአንተ ጋራ እጓዛለሁ
   እንዳልከኝ ወደ እርስቴ እገባለሁ
        እኔ ከፍቅርህ….

 ከአንተ ፍጹም ላልለይ ፍቅርህ በልቤ አለ
 ይሄን አልፎ ሊጎዳኝ የሚችልስ ኧረ ምን አለ
 ይያዝ ቅንነት ልቤን ይታዘዝህ ይኸው ሰጠሁ
 ጌታ ፈቃድህ ይምራኝ በእውነትህ እኖራለሁ
    
የመድኃኒቴ አምላክ ሆይ መንገዴን በፊትህ አጸናለሁ
ይቅር ይሄ ዘመኔ በምድር ላይ እንደ ጥላ ነው
የኋላዬን እየረሳው የፊቴን ላይ ከአንተ እጠጋለሁ
ድንኳኔን በሰላምህ ደግመህ እንድትሞላው እናፍቃለሁ
ካንተ ወዴት/2* እሄዳለሁ ...
',0),(NULL,'ክብሩን ይውሰድ','Betty3','ክብሩን ይውስድ ይውሰድ
ምስጋናን ይውሰድ ይውሰድ
እልልታን ይውሰድ ይውሰድ
ማደሪያው ይግባ ያውድ 
ክብሩን ይውሰድ ይውሰድ
ምስጋናን ይውሰድ ይውሰድ
እልልታ ጨምሮ ጨምሮ ይውሰድ
ማድሪያው ይግባ ያውድ
ማደሪያው ይድረስ ያውድ
ማደሪያው ይግባ ያውድ

ለማንም አይሁን ይህ ምስጋናዬ
ለማንም አይሁን ይህ እልልታዬ
ለሚገባው ለጌታዬ 
ቅኔ ዝማሬ አምልኮዬ
ለመንም አይሁን ይህ ውዳሴዬ
ለመንም አይሁን ይህ ቅዳሴዬ
ለሚገባው ለጌታዬ ቅኔ ዝማሬ አምልኮዬ
ለተገባው ለጌታዬ ቅኔ ዝማሬ አምልኮዬ

ፍጥረት ሲታሰብ ከጥንት አምልኮ ሲጀመር
ያመጣ ነበር ክብር መስዋእት ለእግዚአብሔር
ዛሬም ይህ አምላክ በፊት ወደሱ እንዲመለስ
መስዋእቱ ይሰዋለት ፊቱ ይፍሰስ
ሁሉም ሌላውን ይተው ኢየሱስን ይወድስ
ክብሩ ይሄ ብቻ ነው ጌታውን ማወደስ
ደስ የሚያሰኘው ዝማሬ/እልልታ/ ለሱ
የሚያርግለት ወደ መቅደሱ
ክብርን ለመስጠት ልቤ ናፍቋል
እልልታ/አምልኮ ይዟል /2/

ሞገስና ክብር ጥበብ ብርታት
ሃይልን በረከት ለሆነለት ለሆነለት
የልቤ አምልኮ የኔም ስግደት
ከወደደልኝ ይሁን ላምላኬ ለወደድኩት /2/

አሃ አሃ ለሆነው ስሙ የገነነ
አሃ አሃ ምስጋና የተረፈው
አሃ አሃ ጌታ ነው በእጁ ስራ ላይ
አሃ አሃ አዳናቆት የተገባው የተገባው /2/

አይቀያየር ጸንቶ ሁሉን እየቀየረ
ዛሬም በብርታት አለ ፍጥረትን እየጨመረ
የሁሉ ነገር ማብቂያ መጨረሻ ያለው
ዘላለምን የያዘ ፍጻሜን ያወቀው /3/
ንጉስ እግዚአብሔር በዙፋን አለ
በዘመናት ውስጥ እንደነበረ
አምልኮ ስግደት ሲቀርብለት
ሲሰዋለት /2/

ሞገስና ክብር .....
አሃሃ .....
',0),(NULL,'እንዲወደኝ ብቻ አውቃለሁ','Betty3','እንደሚወደኝ ብቻ አውቃለሁ
የኔን ነገር ለእሱ ትቻለሁ
ሲሰራው አየዋለሁ አሳምሮ
ጸጸት/ሀዘን የለበትም ወይ እሮሮ  /2/

አዎ የፍቅር አምላክ ነው
አዎ የፍቅር ጌታ ነው
ሕይወቴን በእጁ የያዘው/
                ነገሬን በእጁ የያዘው              /2/

ዛሬ ዛሬ ዛሬም እግዚአብሔር
እሱ ቢፈቅድ በምድር ስኖር
እኔ የምመኘው በሃሳቡ እንድኖር
እኔ የምመኘው በፈቃዱ እንድኖር
እኔ የምመኘው እሱ እንዳለኝ እንድኖር
ዛሬ ዛሬ ዛሬም እግዚአብሔር
እሱ ቢፈቅድ በምድር ስኖር
እኔ የምመኘው በሃሳቤ እንዲከብር
እኔ የምመኘው በምርጫዬ እንዲከበር
እኔ የምመኘው በኔነቴ እንዲከብር

እከተለዋለሁ አድርጌ ፊተኛ
ቃል ኪዳኑ ያለኝ ጌታ እውነተኛ
እራሴን ስሰጠው አልጠራጠር
ሳልወደው ወዶኛል ቀድሞ በፍቅር
ያኔ መጀመሪያ ሲያስበኝ ከጥንት
የኔ ነገር አልቋል ታይቶ በሱ ፊት

አቤቱ በሃሳብህ ውስጥ ልኑር
አቤቱ በፈቃድህ ጌታዬ
ካንተ ጋር ልስማማ አይክፋኝና
             አላማህ በኔ ያለው በላይ             /2/ 2

በጎነቱ ብዙ ነፍሴ ታውቀዋለች
ድካም አያደክመው ሲመረምር ሰዎች
ያልተሰራ አካሌን በአይኖቹ ቀየረው
አይተወኝም የሱስ ያደርገኛል ሙሉ
አንድስ እንኳን ሳይቀር ተጽፏል በደጁ
ዘመኔ ቀኖቼ እንዴት እንደሚያልፉ

ዛሬ ዛሬ ዛሬም እግዚአብሔር ....

እከተለዋለሁ አድርጌ ፊተኛ
ቃሉ ያለኝ ጌታ እውነተኛ /2/
እንዲወደኝ ብቻ አውቃለሁ 
ጌታዬን እከተለዋለሁ
እንዲወደኝ ብቻ አውቃለሁ
 የሱስን እከተለዋለሁ

ጌታዬን እከተለዋለሁ
     የሱስን እከተለዋለሁ /2/
',0),(NULL,'በመንፈሴ','Betty3','በመንፈሴ እ እ እገሰግሳለሁ
ወደ ማረፍያህ እህ እህ
ወደ መኖሪያ እህ እህ
ወደ ማደሪያህ እህ እህ
ወደ መገኛህ እህ እህ

መፈስህ ውስጥ አርፋለሁ
ሰላምህ ውስጥ እገባለሁ /2/
ከከበበኝ እርፍ እላለሁ
ካስቸገረኝ እርፍ እላለሁ
ከሃሳቤ እርፍ እላለሁ
ከድካሜ እርፍ እላለሁ

አቤቱ አንተን ነው የምሻበት በምንጣፌ ላይ
ጌታ ፊትህን ልቆይ በትእግስት ክብርህን እንዳይ
በማደሪያህ ካለው ከጥላህ ነፍሴ ረስርሳ
ወዴትም አልሄድም ሳታይህ ወደ ቤትህ ደርሳ
አቤቱ ፍቃዴ በፊትህ ካንተ አይሰወር
ከፍቃድህ ውጪ ከምንም አይተባበር
ወደ ቅድስናህ ተራራ ወደ መኖሪያህ
ሕይወቴን ይውሰደው ብርሃንህ ይምራኝ እቤትህ /2/

ወደ ማደሪያህ ወደ መኖሪያህ
ወደ ማደሪያህ ወደ መገኛህ

በብርሃንህ ብርሃን አያለሁ
በመንፈስህ አንተን አያለሁ
በክብርህ ግርድ እገባለሁ 
ወደ ስርህ ጥግት እላለሁ

ወደ ማደሪያህ ....

መንፈሴ ካንተ ጋር ይዋል
ጌታ ሆይ ካንተ ጋር ይደር
ሃሳቤ ካንተ ጋር ይዋል
የሱሴ ካንተ ጋር ይደር

የዘላለም እረፍቴ ነህ የተሸሸግኩብህ ዘላለም
ቀኔ ቢሆን ሌሊቶቼ ካንተ ጋር ነው ያሉት ዘላለም
እርፍ እያልኩብህ ዘላለም
ሳከብርህ ዘመኔ ይለቅ
ካንተ ጋር ሕይወቴ ይለቅ
ሳመልክህ ዘመኔ ይለቅ
ካንተ ጋር እድሜዬ ይለቅ
የዘላለም እረፍቴ ነህ የተሰወርኩብህ ዘላለም
ቀኔም ቢሆን ሌሊቶቼ ካንተ ጋር ነው የሚያልቁት ዘላለም
              ሽሽግ ያልኩብህ ዘላለም 
/2/
',0),(NULL,'በምህረት ከፈታ','Betty3','በምህረት ከፈታ ደግሞ የማያስር
በፅድቁ የሚገኝ ታምኖ የሚኖር
ቃሉን የሚያፀና እውነትም ታማኝ
ለካ ሌላ የለም እሱን አየሁኝ

መልካም ነው እግዚአብሔር /4/
ነፍሴ ትለዋለች መልካም ነህ እግዚአብሔር
መልካም ነህ እግዚአብሔር /2/

 የሰው የልቡ ሀሳብ
ያጠለቀውን ለራሱ ይዞ 
ሚስጥሬ ሁሉ የሸሸገውን
እሱ በብርሃኑ ይገለጥና
ያስደንቀዋል እንቆቅልሹን ይፈታውና 
በሚመርጠው መንገድ ባሰበው ጎዳና
እንዴት እንዲመራው ቀድሞ ያውቃልና
ነፍሱን ይመልሳል በመልካም እንዲያድር 
አንዴ ከወደደ ሲወድ ይኖራል

ጌታ ሀሳቡ ሁሉ የበጎ ነው ለተጠጋው
ለእርሱ ነገሩን ጥሎ አንተ ታውቃለህ ይህን ላለው /2/

ይወዳል ዳግም ላይጠላ
 ይይዛል ላይሰጥ ለሌላ
በእርሱ  የታሰበው
   ከእጁ ማን ሊያወጣው /2/
ይወዳል ዳግም ላይጠላ
 ይይዛል ላይሰጥ ለሌላ
በጌታ የታሰበው
 ከእጁ ማን ሊወስደው
ይወዳል ዳግም ላይጠላ
 ይይዛል ላይሰጥ ለሌላ
በኢየሱስ የታሰበው
 ከእጁ ማን ሊነጥቀው
ከእጁ ማን ሊወስደው
ከእጁ ማን ሊነጥቀው
ከአሳቡ ማን ሊያወጣው
ከአሳቡ ማን ሊለየው

የተወው ቢመስል የተረሳ 
ቢቆይ እንኳን ጌታ እስኪነሳ 

ጊዜ አለው የሚሰራበት
 ታሪኩንም ሊቀይርለት
ቀኑ ሲደርስ የታሰበበት
 ስለ ቆየ ሲሟገትለት
ለወደደው ታሪክ ይለወጣል
 ነገር ሁሉ ይገለባበጣል
ያልታሰበ የማይሆን ይሆናል
 ዝቅ ያለውም በአምላኩ ይከብራል
ተወስኖ የተጠበቀለት
 ትእዛዝ ወጥቷል ከዚያ ከሰማያት

ጨለማው አለፈ ብሎ ብርሃን ያወጣለትን
እኔማ ከአንተ ጋር ብሎ ቃል ኪዳን የገባለትን
አዋጅን በአዋጅ ሽሮ ምህረት ያበዛለትን
ድካሙን በሀይል ለውጦ ለነፍሱ ያስገዛለትን 
በሰይ ዙፋኑ ያለው መንግስቱ ሁሉን የሚገዛው
በቃሉ የታመነ ነው አይጥለው መቼ ሊተወው /2/
ይወዳል ዳግም ላይጠላ ....
',0),(NULL,'ምን ክብር አለኝ','Betty3','በእሱ የተሳብኩኝ መጠጊያ የሆነኝ
ሞገስ አገኘሁኝ በፊቱ እንዲህ እንድቆም እኔ ማን ነኝ
ከህያውያን ጋራ ታስቤ ቸርነትህ የታየልኝ
በጌታዬ ሃሳብ በልቡ ያልሁኝ እኔ ማን ነኝ
ምን ክብር አለኝ ክብሬ የሱስ ነው
ምን ማአርግ አለኝ ማእረጌ ጌታ ነው /2/
ሰው አድርጎ ዛሬም ያቆመኝ
በደግነት እየጠበቀኝ
በሱ ፍቃድ ዛሬን ያቆመኝ
በቸርነት እየጠበቀኝ
ክብሬ እለዋለህ ክብሬ
ማረጌ እለዋለሁ ማረጌ /2/

የማንነቴ መገለጫ
መሸሸጌያዬ የኔ ማምለጫ
መጎናጸፍያ ክብር ልብሴ
ጌታን ካገኘች እስትንፋሴ
ነገሬ በእሱ ተለወጠ
ህይወቴ ታየ ተገለጠ
በሰማያት ጠል ገናንነት
ባረከኝ እጁ ለሱ ውበት
ክብሬ እለዋለሁ ክብሬ
ሞገሴ እለዋለሁ ሞገሴ /2/

ሳላውቀው ነፍሴን ያከበረ
ፍጹም ከፍታ ያስቀመጠ
የእርስቴ እድል ነው ፋንታዬ
ቦታዬን ያየ ከፍታዬ
የጽድቅን ቁርባን የሱን መባ
ላጥን በፊቱ የሚገባ
የዘወትሩን መስዋት
ጣፋጩን ሽታ ጌታ ፊት
ክብሬ እለዋለሁ ክብሬ
ሞገሴ እለዋለሁ ሞገሴ /2/

ለእኔ የሆነ የምጠጋበት ማንንም አላይ ያለኝ ረዳቴ
ብዙ የሚኖር በልቤ ከፍታ ሞገስ የሆነኝ ክብሬ የኔ ጌታ /2/

ሰንሰለቱ ወድቋል በሩ አውቆ ተከፍቷል
ከፊቴ የቆመው የለም ሰፍር ለቋል
የአምላኬ ግርማው ክብሩ አለ በህይወቴ
ማእርግ የሆነኝ ጌታ አለ አባቴ /2/

ወዳየልኝ ክብር ልሂድ ወደ ከፍታዬ
ቃል ገብቶልኝ ላይተወኝ ይዞኛል ጌታዬ
ከሱ ጋራ ስለምጓዝ መንገዴ ቀና ነው
በእጁ መዳፍ ተቀምጬ የሚያስፈራኝ ማነው
አልፈራም/ አላፍርም/ እታመናለሁ
አልፈራም /አላፍርም/ እደገፋለሁ
የጠራኝ የያዘኝ/ ሞገሴ/ትምክህቴ/ ጌታ አለ /..../
',0),(NULL,'እረሳው መሰለኝ','Betty3','እረሳው መሰለኝ /3/ ጠላት /2/
እረሳው መሰለኝ ጠላት የጥንቱን 
 በድብቅ ጦር ጌታ ድል የመንሳቱን
እረሳው መሰለኝ ጠላት የጥንቱን
በድብቅ ጦር ኢየሱስ የማሸነፉን
የእግዚአብሄር ህዝብ ባንድ ልብ ሲነሳ
ግራ ቀኙን ሳያይ ለነፍሱ ሳይሳሳ
ሲጠራበት ስሙን ሰይፉን ሲመዝዝ
ድል የእሱ እንደሚሆን ከላይ ሲታዘዝ 

ምንም ቢመስል ሀይሉ ታናሽ
 ከጠላቱ ፊት ፍፁም አይሸሽ
ይጋጠመዋል መዝዞ ሰይፉን
 የአምላኩን ብርታት ታምኖ ሀይሉን /ስሙን/ 2

ያንጎደጉዳል ጌታ ከሰማይ
ያንን ችሎታ ብርታቱን ሊያሳይ
ድል የእርሱ ይሆናል የእግዚአብሔር ህዝብ
በጠላት ሰፈር ሊበዘብዝ   /2/

አይረገምም አይታሰር የተፈታ ነው ለአምላኩ /ለጌታ/ ክብር 
የሚባርኩት ይባረካሉ የሚረግሙትም ይረገማሉ /2/
አምላኩ እግዚአብሔር ከእርሱ ጋራ ነው 
እንዴት ነው ጠላት እሱን ሚያገኘው
ያለውን ሁሉ የሚያደርግለት 
የአብርሀም አምላክ ጋሻ የሆነለት /2/

የሱስ ሊሰራ ቃሉን ልኳል
 ከቶ  ማንስ  ያስቀረዋል
ጌታ ሊባርክ ቃሉን ልኳል
 እረ ማንስ ይረግማል?  /2/

ለበረከት የተጠራ 
የእግዚአብሔር ህዝብ የሚያስፈራ
ማን ይቆጣል (ይጣላል) እስራኤልን
በቃል ኪዳን የወጣውን  /2/

ቃል ያለው እህ ቃል አለው ቃል አለው
 የተባለለት የተነገረው /2/
 
ቃል ኪዳን ያለው ብርቱ የጸና
የአምላክ ሰራዊት ይዘምታል ገና
ጌታ እንዳየለት ድል እየነሳ 
ይሄዳል ሊወርስ እየተነሳ

አምላኩ ታማኝ ሁሌም የተጋ
ክንዱ የማይዝል ለህዝቡ ሲዋጋ
ተስፋ ሲያደርገው ሲጠብቀው
አለው ተምራት የሚያሳየው 
ብርቱና ሀያል ክብሩ ገናና
በዘመናት ላይ ይገዛል ገና
ከአፉ የወጣውን ቃል ኪዳኑን
ሳይፈፅምለት አይትወውም

ቃል አለው እህ .....
',0),(NULL,'አርገኝ እንደልብህ','Betty3','ምህረት ከሆነልኝ ከወደድከኝማ
የልምናዬ ቃል ድምጼ ከተሰማ
በፍቅር አይኖችህ ወደኔ ከሆኑ
ይቅርታህ በህይወቴ አድልቶ ሚዛኑ
አርገኝ እንደ ልብህ አርገኝ
          አርገኝ እንደ ሃሳብህ አርገኝ        /2/

የትናንት አይደለም የዛሬ
ከዘመን በፊት ነው ጅማሬ
መኖሪያህ በምህረትህ ውስጥ
አያልቅም ለሁሉ ስትሰጥ
አይኖችህ በፍቅር ያያሉ
ባንተ የታመነን ይለያሉ
አትችልም ይሄ አይሆንልህ
ሊያከብርህ ራሱን ለሰጥህ  /አምላኬ ኢየሱስ ላለህ/  /2/

እኔም ላደንቅልህ የሚያስገርም ምህረትህን
የሚያስደንቅ ምህረትህን
እኔም ላደንቅልህ የሚያስገርም ማንነትህን
የሚያስደንቅ ጌትነትህን
እኔም ላደንቅልህ የሚያስገርም ልእልናህን
የሚያስደንቅ ቅድስናህን

ምህረት ከሆነልኝ ......

ይፍጸም የልብህ ናፍቆት
ይደረግ ያንተ መሻት
ልታዘዝ ቀና ልሁንልህ
በንጹህ ልቤ ላገልግልህ
አይሁን ዘመኔ የእውቀት ብቻ
ለነገ  ሰልፍ መጨረሻ
ላስቀድም ደስታህን /ፍቃድህ ልወቅ/
ፍቅርህ /ስራህ/ በህይወቴ ይላቅ    /2/

ምህረትህ ብዙ ነው ብዙ ነው ብዙ ነው
ብዙ ነው ሁልጊዜ ማደንቀው
ደግነትህ ብዙ ነው ብዙ ነው ብዙ ነው
ብዙ ነው ሁልጊዜ የማደንቀው
በጎነትህ  ብዙ ነው ብዙ ነው ብዙ ነው
ብዙ ነው ሁልጊዜ የማደንቀው

አደንቃለሁ ምህረትህ ኢየሱስ አያለሁ
አደንቃለሁ ትእግስትህን ጌታ አያለሁ
የመኖሬ ምስጥር የተቋጠረብት
የመቆሜ ሚስጥር ያለብት
የመኖሬ ምክንያት የተቋጠረበት
የመቆሜ ሚስጥር ያለበት

እኔም ባደንቅልህ ....
',0),(NULL,'የልመናዬን ድምጽ','Betty3','የልመናዬን ድምጽ ሰምተህኛልና
እሰዋልሀለው ኦ ምስጋና ኦ ምስጋና ኦ ምስጋና
ጸሎቴ በፊትህ መልስ አላጣምና
ይሁንልህ እንድያው ብዙ ክብር እንደገና እንደገና

ተጨንቄ አልቀረሁ ፊትህን ፈልጌ
ታሰብኩኝ በአንተ በአምላኬ በአምላኬ
ከከበበኝ ሁሉ ስታስመልጠኝ
ማን ነበር እንዳንተ የረዳኝ የረዳኝ
የልቤንም ሀሳብ ስታደምጥልኝ
እንባዬን በስውር ስታብስልኝ
ማን ነበር እንዳንተ ቀርቦ የረዳኝ
               መጽናናት ለነፍሴ የሆነኝ/የሰጠኝ            /2/

ትካዜዬን ሁሉ በአንተ ላይ ስጥል
አምኜ ነበረ ስናገር ስናገር
ሁሉንም ለስምህ አደራ ስሰጥ
ተቀበልኩ ከእምነት የሚበልጥ የሚበልጥ
ደስታ ያየሁብህ የነፍሴ እፎይታ
የልመናዬ መልስ የሱስ የኔ ጌታ
በደሌን ዝም እንዳልክ ስምህን ስጠራ
ስንቱን አልፌአለሁ ከአንተ ጋራ /2/

የምትሰማ የምህረት ጌታ
ቸል የማትል እጅህ የበረታ /2/
ምን አለ ብአምነው ጌታን ምን አለ
ለኔ ያለው ልመናዬን ሁሉ መልሰህ
እንቁቁልሼን ሁሉ በአንተ ተፈታ
ሁሉን በቻልከው በጌታ
ምን አለ ባምነው ጌታን ምን አለ
በእኔ ያለው ልመናዬን ሁሉ መልሰህ
እንደ ጨለመ አልቀረም ሌሊቱ ነጋ
ለአንተ ታዘዘ ለጌታ
',0),(NULL,'ምስጋናው ይውጣ','Betty3','ምስጋናው ይውጣ (3)
እልልታው ይሂድ (2) ያርግ /2/
መልካም መኣዛ ይሁን በአምላኬ ፊት
ጣፋጭ ሽታ ይሁን በየሱስ ፊት
በተወደደ ባማረ ቃና 
ሉኡል ለክብርህ መስዋእት ቢሆን
ይቀመም ጣፋጭ ክብርና ዜማ
 ማደርያህ ይድረስ ምስጋና ይሰማ
እልልታው ያርግ ቅጥርህ ይድረስ
 ክብር ግርማህን ያሞጋግስ /2/

በላይ በመኖሪያህ ከፍታውን ሁሉ
ቅዱሳን መላእክት ለክብር ያጥናሉ
በረከት ውዳሴ ምስጋና እያሉ
አዳዲሱን ቅኔ ላንተ ይዘምራሉ
በዚያ በቅድስና ክብርህ ባለበት
ዜማ ቅኔ ይሰማል የምትከብርበት
ማንም ሊቀርብህ አይችል ደፍሮ ሊያይህ
  ፍጡር ወድቆ ይሰግዳል ግርማዊ ነህ /2/

ምስጋና የተገባህ ነው
ውዳሴ የተገባህ ነው
ዝማሬ የተገባህ ነው
                      አምልኮ ሁሉ ያንተ ነው             /2/

ቅዱሳን በሰማይ በፍርሃት
ምስጋና/ውዳሴ ምስጋና/ውዳሴ ይላሉ
ክብር ይገበሃል ጌታችን
              ክብርን ውሰድ እያሉ           /2/

አእላፋት በሰማይ ዙፋንህን ከበው
ሌተቀን ሲያመልኩህ ፊትህ ተንበርክከው
የምድርን ፍጥረታት ንግስናህን አውቀው
ክብርን ያመጣሉ ወድቀው ላንተ ሰግደው

በተወደደ ባማረ ዜማ
ልኡል ለክብርህ አምልኮ ይሰማ
አልፎ የሚሄድ ሰማያት
ጥሶ ተሻግሮ ደመናትን
ፊትህ የሚደርስ የተቀደሰ
            ነውር የሌለው ያላነከሰ           /2/

         በዚያ በቅድስና ክብርህን ባለበት ...   /2/
     ምስጋና የተገባህ ነው  ....        /2/
  በዚያ በቅድስና ክብርህ ባለበት ..... /2/

ምስጋናው ይውጣ (3)
        እልልታው ይሂድ (2) ያርግ     /2/
መልካም መኣዛ ይሁን በአምላኬ ፊት
ጣፋጭ ሽታ ይሁን በየሱስ ፊት

ምስጋናው ይውጣ (3)
እልልታው ይሂድ (2) ያርግ  /4/
',0),(NULL,'ህይወቴ አንተ ነህ','Betty3','አፌን አልከፍት ቃል አላወራ 
ጥበብ እንዳለው ስራ እንደሰራ
ታሪኬ ቢታይ ቢመረመር 
ምንም የለውም ካንተ በቀር
ነፍሴ ብትያዝ ብትጠየቅ 
ከፍቅርህ በቀር ሌላ እንዳታውቅ 
ይሄንን ብቻ ትናገራለች
የምታውቀውን እንዲህ እያለች

ህይወቴ አንተ ነህ /3/ የኖርኩብህ
ኑሮዬ አንተ ነህ /3/ ያለሁብህ

ሌላ የለኝም የሚነገር
ቃልኪዳንህ ነው የኔ መኖር
ጥበቤ አይደለም ወይ ማስተዋሌ
እውቀት አይደለም ተሰምቶ ቃሌ   /2/

ህይወቴ አንተ ነህ /3/ የኖርኩብህ
ኑሮዬ አንተ ነህ /3/ ያለሁብህ

አንተ የነፍሴ ጌታ ነህ
ታሪኬ የጀመረብህ
አንተ የሕይወቴ ጌታ ነህ
ታሪኬ የሚያበቃብህ
እጄን ያጸናኝ የጀመረኝ 
እስትንፋስ ሰጥቶ አስገኝቶኝ
እጅህ ሙላቴ የሚያኖረኝ
ፍጻሜዬንም የያዘልኝ
አንተ የነፍሴ ጌታ ነህ
ታሪኬ የጀመረብህ
ታሪኬ የሚያበቃብህ

በአንተ ሃሳብ ቀድሞ ተጀምሮ
በአንተ ሀሳብ ደግሞ የሚፈጽም
ይሄ ነው ህይወቴ እኔ አላውቅም ሌላ ነገር 3  /2/

እኔን የሚወድ ተገኘ 
በደል በእርሱ አልተገኘ
ነፍሱን እስከ ሞት የሚሰጥ
 መውደዱን እንዲህ የሚገልጥ
ሞትን በራሱ አውቆ የፈቀደ
የወደደውን ደግሞ የወደደ
ክብሩን የተው ለፍቅር ብሎ
እኔን ያዳነ ራሱን ከፍሎ
የሱስ የነፍሴ ጌታ ነህ
ፍቅርን ለኔ ያሳየህ
ጌታዬ የህይወቴ ጌታ ነህ
በእኔ ላይ አላማ ያለህ

አንተ ያልከው በህይወቴ ሆኗል
አንተ ያሰብከው በህይወቴ ሆኗል
ገና ደግሞ ያልከው ይከናወናል
ገና ደግሞ ያሰብከው ይከናወናል

አንተ ያወከው በህይወቴ ሆኗል
አንተ ያየኸው በህይወቴ ሆኗል

ገና ቀሪው ደግሞ ይከናወናል
ጌታ እንዳየህልኝ ገና ይሆናል/
                 አንተ እንደምትለው ይሆናል             /2/
',0),(NULL,'ትልቅ ነህ','Betty3','ትልቅ ነህ ከምናስብህ በላይ
ትልቅ ነህ ከምንገምትህ በላይ
ትልቅ ነህ ከተጻፈልህ በላይ
ትልቅ ነህ ከተባለልህ በላይ

ከአእምሮአችን በላይ ትልቅ
ካሳባችን በላይ ትልቅ
ከሰማነው በላይ ትልቅ - እንዴት ትልቅ
ከፈጠርከው በላይ ትልቅ
ከሰራኸው በላይ ትልቅ
ካበጀኸው በላይ ትልቅ - እንዴት ትልቅ
ከአእምሮዬ በላይ ትልቅ
ከሃሳቤ በላይ ትልቅ
ከግምቴ በላይ ትልቅ - እንዴት ትልቅ

ሰማይ ሰማያት የዙፋንህ መቀመጫ
ትልቅ የቱ ነው ያንተ መግለጫ
ምድር ተሞላች ከጥበብህ ከእውቀትህ ብቻ
ትልቅ የቱ ነው ያንተ መግለጫ

ሁሉን የምትችል እስትንፋስ ህያው
ለፍጥረት በሙሉ ህይወትን ሰጠው
ምነኛ ጥቂት ነው እኛ ያወቅነው
ጌታ ብርታትህ ባንተ ውስጥ ያለው

ከአእምሮቻን በላይ ትልቅ ....

ያለህ የነበርክ ሁሉ ደግሞ የምትገዛ
ጌታ እግዚአብሔር ስምህ ይነሳ
ትልቁን ሀይል አንተ ብቻህን የያዝከው
ነግሰህ በዙፋንህ የጸናኸው

ጥበብና ብርታት ስልጣን ሹመትህ
መንግስትና ግርማ ክብር ግዛትህ
ሁሉን የሚችለው ጉልበት ችሎታህ
ለልጅ ልጅ ለትውልድ የዘላለም ነህ

ልኡል ምስጋናን ተቀበል
ልኡል አምልኮን ተቀበል
ልኡል ውዳሴን ተቀበል
     ይገባሀል ላንተ ይገባሀል    /2/ 
እስትንፋስ ያለው ሁሉ ክብር የሚገባው
እግዚአብሔር ነው ይበል እግዚአብሔር  (2)
እስትንፋስ ያለው ሁሉ ስግደት የሚገባው
እግዚአብሔር ነው ይበል እግዚአብሔር (2)

ታላቅነትህ ይነገር
ታላቅነትህ ይወራ
ታላቅነትህ ይዘመር
   ልኡል አንተ ክበር  /3/
',0),(NULL,'ካረክልኝ ነገር','Betty3','በስራህ በጥበብ ልቤ ያደነቀው አንተን ነው
ባየሁትም ነገር አይኔ የተማረከው ባንተ ነው /2/

ካረክልኝ ነገር በአይኔ ከማየው
እሱን አላስበልጥ አንተን ነው የማየው
በእውነት በመንፈስ ክብርን እየሰጠሁ
ካደንኩህ በላይ ዛሬም አደንቅሃለሁ /2/
ላድንቅህ ተገረምኩብህ
ጌታዬ ነፍሴ ወደደህ
ላድንቅህ ተገረምኩብህ
ኢየሱስ ነፍሴ ወደደህ

ያረክልኝ ሳይሆን የሚያስደንቀኝ
አንተ ነህ ኢየሱስ ያደረክልኝ
በሰልፍ እኔ ስቆም ጥሰህ ተዋጋህ
ስንቴ አምልጪያለሁ ከጠላት መንጋጋ
ከአእምሮ በላይ ነህ የምታደርገው
ታምራትህ ብዙ የምትሰራው
ግን እሱን አይደለም እኔ የማየው
አንተን ነው ኢየሱስ ሁሌ የማደንቀው /2/
አቤት እንድያው ዝም ብዬ
አቤት ስራህን ሳየው
አቤት እውቀትህ ጥልቅ ነው
አዎ እገረማለሁ
አቤት እገረማለሁ
አቤት በምን ይገለጣል
አቤት ታላቅነትህ
አቤት ሁሉን ቃልህ ሰራው
አዎ እንደ ፍቃደህ
አቤት እንደ ፍቃድህ

ስራህ ብቻ ሳይሆን የሚያስገርመኝ
አንተ ነህ ኢየሱስ ምታስደንቀኝ
እውቀት ጥበብህን ያለህን ችሎታ
ማንም አያውቀውም የአንተን ከፍታ
ሀይልህን ታምነህ የሱስ በምትሰራው ስራ
ምንም አይዛባም ፍጥረትን ስትሰራ
እጅግ ያስገርማል ጥልቅ ነው ጥበብህ
ስራህም ትልቅ ነው ሁሉን የመቻለህ /2/
ሁሉን ነገር በጊዜው ውብ አርገህ ሰራኸው
ግን ይመጣል ፍጻሜ አለመኖር ሊያጠፋው
ግን ይመጣል ያለመኖር ደግሞ ሊያጠፋው
አንተ ግን ህያው በንግስና ልኡል በውበትህ
የማትጠፋ የምትኖር ዘላለም በስፍራህ /2/
ፍጥረትን ሁሉግዜ የማደንቃው /2/ ለዚህ ነው
ጥበብን ሁልግዜ የማደንቀው /2/ ለዚህ ነው
እጅህን ሁልጊዜ የማደንቀው /2/ ለዚህ ነው
ስራህን ሁልጊዜ የማደንቀው /2/ ለዚህ ነው

በስራህ በጥበብህ ......
',0),(NULL,'አምላክ ነህ ይሉታል','Betty3','አምላክ ነህ ይሉታል ካማልክት በላይ  /2/
ጌታ ነው ይሉታል ከጌቶች በላይ  /2/
ቅዱስ ነህ ይሉታይ ከቅዱሳን በላይ /2/

ጌታን የሚመስል ሌላ ይገኛል ወይ
ሁሉን ከሱ በታች አድርጎት የለም ወይ /2/
የሱስን የሚመስል ሌላ ይገኛል ወይ
ሁሉን ከእግሩ በታች አድርጎት የለም ወይ /2/

የጠቢባን ጠቢብ የእውቀት ራስ ነው
ከስም ሁሉ በላይ ስም የተቀበለው
በዚህ አለም ቢሆን ወይም በሚመጣው
የተረጋገጠ ስልጣን የእሱ ነው
ምን ቃላት ይገኛል እሱን ለመግለጽ
ከምንም ከማንም ክብሩ /ሞገሱ/ አይደረስ /2/

አልፋና ቀዳሚ ህያው መጀመሪያው
መጨረሻም እሱ የሚገለጠው
የህይወትን ወሃ ሲያፈልቅ የኖረው
ስልጣኑ ብቻውን አቻ የሌለው
በዘመናት ህያው ያልተለወጠው
            መንግስቱ ዘላለም የሚጸና ነው            /2/ 

ነፍሴ አ ኤ ታከብረዋለች
ትልቅነቱን እያስተዋለች
ነፍሴ አ ኤ ታመልከዋለች
ቅዱስነቱን እያስተዋለች
ሌላ አላየሁም እያለች
ሌላ አልሰማሁም እያለች
ሌላ አልፈልግም እያለች
ነፍሴ አ ኤ ታመልከዋለች

ከኔ የተነሳ አትፍራ የሚለው
የሞትና የሲኦል መክፈቻ ያለው
የህይወት ቃል ካፉ የሚናገረው
ክቡሩ ኢየሱስ ጊዜ የማይሽረው
በሰው ልጅ አእምሮ የማይገመተው
ቅዱስ ማደሪያውን ምስጋና /ዝማሬ/ ይሞላው /2/
የዘመናት ብዛት ሃይሉን ያልሻረው
እንደ ጥንቱ ዛሬም እጁ መልካም ነው
ተስፋ ሆኖ የሚኖር ተስፋ ላረገው
ታማኙ እግዚአብሔር በክብር ያለው
ማይቆጠርለት ለዘመኑ ጥንት
አይገኝለትም ለኢየሱስ /ለጌታ/ ቃላት  /2/

ነፍሴ አ ኤ ታከብረዋለች ......

አምላክ ነው ካማልክት በላይ
ጌታ ነው ከሆኑት በላይ
ቅዱስ ነው ከቅዱሳኑ በላይ ኢየሱስ /4/
',0),(NULL,'አምላኬ እግዚአብሔር አንድ ነው  ','Berhanu1','አንድ ነው አምላኬ እግዚአብሔር አንድ ነው
አንድ ነው ጌታ አምላኬ/ኢየሱስ አንድ ነው /2/
ከግራም ከቀኝም አማካሪ የሌለው
ብቻውን የሚኖር ሃያል/ታላቅ አምላክ ነው /2/ 2

ከፀሃይ መውጫ እስከ መጥለቂያ
ከአጥናፍ እስከ አጥናፍ በምድር ዙሪያ
ከእግዚአብሔር ሌላ አምላክ የለምና
ተጣበቅ ከእርሱ ስገድ ለጌታ /2/

እርሱ ፊተኛው ኋለኛም አምላክ ነው
በሰማይ በምድር እንደ እርሱ ያለ ማን ነው?
አትፍሩ አትደንግጡ የአማልክት አምላክ ነው
ከማህጸን የሰራን ፈጣሪ እርሱ ነው /2/

ፊተኛው እና መጨረሻ ያው ነው
የምድር የሲኦል መክፈቻ ያለው
ዛሬም ለዘለአለም ህያው ሆኖ የሚኖር
እርሱ ነው አንዱ አምላክ አማካሪ የሌለው /2/

ያለና የሚኖር በክብር የሚመጣው
ሁሉም የሚገዛ ጌታ አምላክ አንድ ነው
በዙፋኑ ላይ ብቻውን ላለው
ታላቅ ምስጋና ለስሙ ይድረሰው /2/
',0),(NULL,'እኔን ሊያድን','Berhanu1','በብዙ ሰይፍ በብዙ ጎመድ ተከቦ
ተወሰደ እንደ ወንበዴ የሱስ ተገዶ
ምንም ሳይኖርበት ምንም ሳይሰራ
ስለኔ ኃጥያት በጥፊ ተመታ
እኔው እኔው ነኝ የመስቀሉ ጥፋት/ጠላት /2/
እኔን ሊያድን/ልታድን ዳግም ሊሰራ/ልትሰራ
የሱስ ነፍሱን/ነፍስህን ሰጠኝ ለሕይወቴ ቤዛ /2/

በጲላጦስ እና በሄሮዶስ ፊት ቆሞ
የሱስ ተጠየቀ ጥፋተኛ ሆኖ
ምንም ባያገኙም ከእርሱ ዘንድ ጥፋት
ይሰቀል አሉት ለሰዎች ፈቃድ
እርሱ ስለኔ ሊሰቀል ተገፋ
በደሙ ዋኝቶ ነፍሴን ሊያድነው /2/

 እኔው ነኝ የመስቀሉ ጥፋት/ጠላት /2/
እኔም አልችለውም መስቀል ተሸክሞ
የሱስ ተጓዘልኝ የእዳዬን ጉዞ
ስለኔ እጆች እጆቹ ቢበሳ 
ስለእኔ እግሮች እግሮቹ ቢበሳ
ምንም ሳይከፋው ቅር ሳይለው ጌታ
ጉዞ ቀጠለ ወደ ጎልጎታ /2/
በብዙ ....
በጲላጦስ እጅ የሱስ ተገረፈ 
ለመስቀልም ሞት አልፎ ተሰጠ
እጅ እግሩን በሚስማር ተቸንክሮ ጌታ
በመስቀል ላይ ዋለ ስለኔ መከራ
ስለኔ ጮሆ ነፍሱን ሰጠኝ ጌታ
እኔን ምስኪኑ ከሃጥያት ሊያወጣ /2/

እኔው እኔው ነኝ የመስቀሉ ጥፋት/ጠላት /2/
ከክፉ አድራጊዎች ጋር የሱስ ተሰቀለ
በደሙ ሊዋጀኝ ራሱን አዋረደ
ጎኑ ስለኔ በጦር ሲወጋ
ውሃ ደም ፈሰሰ የነፍሴ ማዳኛ
እሩህሩህ አምላክ የፍቅር ጌታ ነው
በመስቀል ላይ ሞቶ ነፍሴን ያዳነው /2/

እኔው እኔው ነኝ የመስቀሉ ጥፋት/ጠላት /2/
እኔን ሊያድን ዳግም ሊሰራ
የሱስ ነፍሱን ሰጠኝ ለሕይወቴ ቤዛ /2/
እኔው እኔው ነኝ የመስቀሉ ጥፋት/ጠላት /4/
',0),(NULL,'ሰምቶ የመለሰልን','Berhanu1','ሰምቶ የሚመልሰውን/የመለሰልኝን - አይቶ የሚራራውን/የራራልኝን
ሆዱም የማይጨክነውን/የማይጨክንልኝ - ምህረቱን ከኔ የማያርቀውን/ያራቀልኝ
ልኡሉን እግዚአብሔርን - አመሰግናለሁ
አምላክነቱን አንድነቱን - በዝማሬ ዜማ አወራዋለሁ /2/

ሰምቶ እንዳልሰማ አይቶም እንዳላየ
አያቅም ኢየሱስ ጨካኝ ስላልሆነ
ኢየሱስ የዋህና ትሁትም አምላክ ነው
ሆዱ የማይጨክን ቸር ወዳጅ እሱ ነው
ጌታ ኢየሱስን አመስግናለሁ
ሃያልነቱን ሁሉን ቻይነቱን
በዝማሬ ዜማ አወራዋለሁ

ምህረቱ የበዛ ቁጣው የዘገየ
ይጣራል ውድዬ ወደኔ ኑ እያለ
ሸክምን ከሰው ልጅ ማንሳት ያውቅበታል
ተንበርክከን እንጥራው ዕረፍት ይሰጠናል
ሰምቶ የመለሰልኝ
አይቶ የራራልኝ
ሆዱም ያልጨከነብኝ
ምህረቱን ከኔ ያልራቀብኝ
ልኡሉን .......

የኤርትራ ባህር ከፊትህ ሲንጣለል
የፈርኦን ሰራዊት ከኋላ ሲከተል
አይቶ ዝም አይልም የሱስ ይረዳናል
ባህሩን አድርቆ በየብስ ይመራናል
ጌታ ኢየሱስን አመስግናለሁ
ሃያልነቱን ሁሉን ቻይነቱን
በዝማሬ ዜማ አወራዋለሁ

በመንፈስ በእውነት ቀርበን ብንለምነው
ኢየሱስ ሊረዳን ሁሌ በቅርብ ነው
ጆሮቹ ተነሱ ሰምተውም ከመመለስ
መቼ ቸል ብሎ ያውቃል እኛ ካልሰለቸን
ሰምቶ የመለሰልን...
ልኡሉን .......
በምህረት በፍቅር ሁሌ የሚሰማን
እኛ በምንለምነው መጠን የሚሰጠን
እንደ የሱስ ያለ ማንም የለምና
ምስጋና እንስጠው ስራውን እናውራ
ጌታ ኢየሱስን አመስግናለሁ
ሃያልነቱን ሁሉን ቻይነቱን
በዝማሬ ዜማ አወራዋለሁ
',0),(NULL,'የሚዋጋኝን የተዋጋልኝ ','Berhanu1','የሚዋጋኝን የተዋጋልኝ 
ሸክሜን ሁሉ የተሸከመልኝ
በሃዘን በችግሬም ቀርቦ ያጽናናኝ
በነፍስም በስጋ እኔን የታደገኝ
ማን አለኝ የሱስ/ለእኔ የሱስ/ ያላንተ /2/
ማን አለኝ ለእኔ /የሱስ ለእኔ/ ያላንተ /2/ 2

ለነፍሴ መዳን አንተ ሆነሃል
በቀራንዮ መስቀል ነፍስህ ሰጥተሃል
ፍቅር አስገድዶህ ሁሉን ሆነሃል
ለኔ ያልሆንከው ምንስ ይገኛል? /2/

ለነፍሴ ምግብ የሕይወት እንጀራ
ለነፍሴ መጠጥ የሕይወት ውሃ
ሆነህ ኢየሱስ አቁመኸኛል
ተመስገን  አምላኬ ክብር ይገባሃል
ተመስገን  ኢየሱስ ምስጋና ይገባሃል

ጠላቴ ሰይጣን ቀርቦ ሲዋጋኝ
ከአንተ እንድወጣ ስህተት ሲያሳየኝ
ካላንተ የሱስ ማን ተዋጋልኝ?
ከኔ አርቆ ጽድቁን ከተተልኝ /2/

ሸክም በሕይወቴ እጅግ በዝቶብኝ
ሊጥለኝ ሲሞክር ሲያንገዳግደኝ
ሸክሜን ተርክቦ በድል የመራኝ
ያላንተ የሱስ ለኔ ማን አለኝ /2/
',0),(NULL,'በማለዳ','Berhanu1','በማለዳ በማለዳ አሜን
ሁሌ በማለዳ
ምህረቱ የእየሱስ ለኔ ብዙ ነውና
በማለዳ በማለዳ አሜን
ሁሌ በማለዳ 
የነፍሴ ንጉስ መሃሪ ነውና 

ማለዳ አስነስቶ በፊቱ ይጠራኛና
ልጄ አይዞህ ይለኛል  ጠጋ ያደርገኛልና
እንደ አለላ የሆነውን አንደ አመዳይ አንጽቶ
እንደ ደም የቀላውን እንደ ባዘቶ አጥርቶ
ሃጢአቴን አይቆጥርም ሁሌ ተከታትሎ
ጌታ ይቅር ይለኛል ስለ ስሙ ብሎ
አሜን ስለ ስሙ ብሎ

በማለዳ ነፍሴ ወደ እርሱ ገስግሳ
ምህረትን አግኝታ በረከትን አፍሳ
ስትነሳ ሁሌ መንገድዋ ቀና ነው
ምስጋናዋ ብዙ ደስቷዋም ፍጹም ነው
ሁሉን ለእርሱ ሰጥታ ጥዋት ስትወጣ
መንገድዋ ቀና ነው የለባትም ጣጣ
አሜን የለባትም ጣጣ

ዛሬም በዚህ ቦታ በፊትህ ቆሜአለሁ
ምህረትህን አብዛልኝ በረከትን እሻለሁ
አስተምረኝ ኢየሱስ ተናገረኝ ጌታ
ንቀለው ሃጥያቴን ከውስጤ ግባና
በማለዳ ፊትህ ቆሜ ጠራሃለሁ
የሚረዳኝ የለም ከኔ አትራቅ እላለሁ
አሜን እልህአለሁ
',0),(NULL,'ደስ ይበለን','Berhanu1','ደስ ይበለን ሃሴት እናድርግ እንዘምር ለጌታ
ሳናስበው ነፍሳችንን በከበረው ስፍራ አኖራታልና
ምስጋና /4/
ለጌታ ለኢየሱስ ይገባዋልና /2/ /2/

ነፍሳችንን ከሞት ሊያድን ወዶ
ወረደ ወደ ምድር ቃሉን ስጋ አድርጎ
ኢየሱስ ስለኛ ሁሉ ጊዜ ያስባል
አያንቀላፋም ዘወትር አይተኛም /2/

ደስተኞች ከሞት ድነናል
ልናገለግል ኢየሱስ መርጦናል
በተሰጠን ጸጋው በሰጠን ሃይሉ
ይገልገል ጌታ ይመስገን ስሙ /2/

ታላቁን ስሙን በኛ አሰጠርቷል
ከፋንድያ አንስቶ ልጆቹ አድርጎናል
እንቀኝለት ለዚህ ታላቅ ጌታ
አስር አውታር በትልቅ በገና /2/
የሱስ አንድ አምላክ ስሙ ይባረክ
ከነገድ ከቋንቋ ነጥሎ ያዳነን
ወንዱ ሴት አላለም አይሁድ የግሪክ ሰው
ኢየሱስ አድኖ መንግስቱ ሲያወርሰን /2/
',0),(NULL,'እግዚአብሔር ብርሃኔና መድሃኒቴ','Berhanu1','እግዚአብሔር ብርሃኔና መድሃኒቴ ነው
የሚያስፈራኝ ማን ነው?
እግዚአብሔር የሕይወቴ መታመኛ ነው
የሚያስደነግጠኝ ማን ነው?

መሸሸጊያ አምላኬ እግዚአብሔር ነውና
ነፍሴን ካዳኝ ወጥመድ ሰውሯታልና
ከሚያስደነግጥ ነገር አድኖኛልና
በላባዎች ጋርዶ አሳርፎኛልና
እግዚአብሔር የነፍሴ እረኛዋ ነውና
እግዚአብሔር ለሕይወቴ ከለላዋ ነውና

በሉዑል መጠጊያ ሁል ጊዜ እኖራለሁ
ሁሉን በሚችል አምላክ ጥላ ውስጥ አድራለሁ
መታመኛየም የሱስን አድርጌያለሁ
የሚያስፈራኝ የለም ሁሉን በእርሱ አልፈዋለሁ
ሃይል የእግዚአብሔር ነው ለምን እፈራለሁ?
ሁልጊዜ በሃይሉ ታምኜ እኖራለሁ

በመከራ መካከል ብሄድ እንኳን አልፈራም
ጨለማዬ ተገፎ ብርሃን በርቶልኛል
ለእግሬ መብራት ለመንገዴ ብርሃን ነው
የሚያስደነግጠኝ የሚያስፈራኝ ማን ነው?
ኢየሱስ በሕይወቴ ሁሌ ከኔ ጋር ነው
አይኔ ከእርሱ አልመልስም ሁሌ እርሱን አያለሁ

የሲድራቅ የሚሳቅ የአብደናጎም አምላክ
ዳንኤልን ያዳነ ከአንበሶች መሃል
በዚህ አምላክ ስም ታምኜ ዘለአለም ኖራለሁ 
የሚያስፈራኝ የለም በእምነት እጓዛለሁ
የተስፋይቱን አገር እንድወርስ አውቃለሁ
አልጠራጠርም በሆይታ ገባለሁ
',0),(NULL,'አለኝ የምለው','Berhanu1','አለኝ የምለው ሁሌ የምመካበት
ተስፋ አድርጌ ዘውትር የምኖርበት
የኢየሱስን ስም እኔ አግኝቼዋለሁ
ሰይጣን ተስፋ ቁረጥ ካንተ አምልጫለሁ
አምላኬ/ኢየሱስ ይመስገን በስሙ ድኛለሁ /2/

አንዱን አምላኬ ሶስት አድርጎብኝ
ዲያብሎስ አሳውሮ -ጆሮዎቼን ደፍኖብኝ
ወደ ሞት ስነዳ  መንገዱ ጠፍቶብኝ
በአንድ አምላክ ስም መጥቶ ሕይወት ሆነልኝ
ስምህ ጌታ ኢየሱስ ዛሬም ከፍ ይበልልኝ /2/

ዛሬ ለኔ ኢየሱስ ስሙ በትሬ ነው
በሕይወቴ ሆኖ በመንፈስ  የሚሰራው
ከኋላዬ መጥቶ ፈርኦን ቢያሳድደኝ
ባህሩን የሚከፍል የየሱስ ስም አለኝ
ስምህ ለነፍሴ  ጠበቃ ክብሬ ማእረጌ ነው /2/
ይኸ ታላቅ በትር ከበትሮች ይበልጣል

ይኼ ታላቅ በትር ከበትሮች ይበልጣል
የፈርኦን እባቦችን ባንድ ጊዜ ይውጣል
ኢየሱስ አይደክምምደግሞም አታክትም
ከኔ የትም ብሎ ወዴትም አይሄድም
ስምህ ለኔ መጠጌያ መሸሸያ መከለያ አጥሬ ነው /2/

ከኃጥያት ባርነት ናጻ ወጥቼለሁ
ከእንግዲህ አልፈራም ስምህን ይዣለሁ
የሱስ አባቴ ነው እኔ ልጁ ሆኛለሁ
መንግሰተ ሰማያትን እንድወርስ አምኛለሁ
ስምህ ከብሮ ከፍ ብሎ በዚያም አየዋለሁ /2/
',0),(NULL,'ኢየሱስ ታላቅ ነው ','Berhanu2','ኢየሱስ ታላቅ ነው 
ታላቅ ነው ታላቅ ነው
በዙሪያው ባሉት ላይ 
 የተፈራ የነገሰ የከበረ አምላክ ነው
ኢየሱስ ታላቅ ነው 
ታላቅ ነው ታላቅ ነው
በክብሩ ውበት ላይ በጽዮን 
የተፈራ የነገሰ የከበረ አምላክ ነው

በማርያም ማህጸን በመንፈስ ቅዱስ ሃይል
ተጸንሶ የነበረው ያ ትንሹ ህጻን
የዘላለም አባት የሰላም አለቃ ነው
ለዘመኑ ቁጥር ፍጻሜ የሌለው /2/

 ጫማውን እሸከም ዘንድ ፍጹም ማይገባኝ
ከኔ ደግሞ ይበልጣል ብሎ ዮሃንስ ያለለት
ስንዴን ጎተራው አግብቶ ገለባን ሚያቃጥለው
አለቅነት በጫንቃው ይዞ የመጣው ህጻን ነው /2/

አርባ ቀንና ሌሊት ሲጾም የነበረው
ጾሙንም ሲፈጽም ዲያብሎስ የፈተነው
የዲያብሎስን ፈተና በቃሉ ያሸነፈው
የይሁዳው አንበሳ ታላቁ የሱስ ነው /2/

በሃሰት አስመስክረው መስቀል ላይ ያዋሉት
መቃብርም አግብተው በማህተምም ያተሙት
ሞትና ሲኦል  ግን ሊይዘው ያልቻለው
በሶስት ቀን የተነሳው ሃያሉ ኢየሱስ ነው /2/
',0),(NULL,'ዘገዬ ብዬ','Berhanu2','ዘገዬ ብዬ የሱስ - አይኔን ወደ ሰው አላነሳም
ድምጽህ ራቀኝ ብዬ ጌታ - ጆሮዬን ለሌላም አልሰጥም
አንተው ዘንበል ብለህ እስክትጎበኘኝ
ባስቀመጥከኝ ስፍራ እኔስ እቀመጣለሁ
ባቆምከኝ ቦታ ላይ ቆሜ እጠብቅህአለሁ

ልቤንም በፊትህ አዋርጄ አቅርቤ
በጾም በጸሎትም እንባዬን አፍስሼ
ምንም መልስ ባጣ ድምጽህ ቢርቅብኝ
ጆሮዬን ለሌላ ለባዳ አልሰጥም

የጠላት ጦር መጥቶ ከቦ ቢያስፈራራኝ
አላማዬ ሊያስት ልቤን ቢያሸብረኝ
ቸኩዬ እንደ ሳኦል ምንም አላደርግም
ሳሙኤል እስኪመጣ ስፍራዬን አልለቅም

እንደ ዮሴፍ ችግር ቢፈራረቅብኝ
እስራት ውስጥ ከቶ ጉዳት ቢያመጣብኝ
ዙሪያው ገደል ሆኖ ቢጨላለምብኝ
አይኔን ካንተ አንስቼ ሰዎችን አላይም

የት አለ አምላኩ ብለው ቢሉህ ሰዎች
ስጋዬን ጨምሮ ዲያብሎስ ቢከሰኝ
በተስፋ በእምነት እጠብቅሃለሁ
ዘንበል በል ኢየሱስ ስፍራዬ እቆሜአለሁ
',0),(NULL,'ይኼውና ብዬ ለሰው የማሳየው','Berhanu2','ይኼው እና ብዬ ለሰው የማሳየው
አንድ ሁለት ሶስት ብዬ ቆሜ ማስቆጥረው
በዚህች ምድር ስኖር በስጋም የማቀርበው
ምንም ሃብት የለኝም ሃብቴ አንድ አምላክ ነው
ምንም ቅርስ የለኝም ቅርሴ ኢየሱስ ነው /2/

ብል የማይበላብኝ ዝገት ማያጠፋው
ሌባ ማይሰርቅብኝ ምንም ማያገኘው
በሰማይ በምድር አብሮኝ የሚኖረው
ቋሜ ሃብት ንብረቴ ጌታ ኢየሱስ ነው /2/

ሌላ ሃብት የለኝም ለዘመድ የምለው
ልጄ ሆይ እንሆ ብዬ ምናዘዘው
ገንዘቤ ንብረቴ ቅርሴ ነህ የምለው
የናዝሬቱ ኢየሱስ ሃብቴ አንድ አምላክ ነው /2/

ለሃብታም ለድሃ ዘውትር የምቸረው
ያልቅብኛል ብዬ ሰስቼ የማልይዘው
ለዘመድ ለልጄም አውርሼ የማልፈው
የጥንቱን አንድ አምላክ ጌታ ኢየሱስ ነው /2/

ወገኖች አድሙጡኝ ስሙኝ ልንገራችሁ
ጥላና ጤዛ ነው ሃብት አያታልላችሁ
ስጋና ደም ቢሆን ነገ ወደ አፈር ነው
ዘላለም ቋሚ ሃብት አንድ አምላክ የሱስ ነው/2/
',0),(NULL,'አለን መልካም እረኛ','Berhanu2','መንጋውን ሌተቀን ሳይደክም የሚመራ
በለመለም መስክ ላይ ዘወትር የሚያሰማራ
ነፍሱ ስለነፍሳችን በመስቀል ላይ ሰዋ
አለን ጌታ ኢየሱስ ታማኝ/መልካም እረኛ /2/ 2

አለን እረኛ ከተበተንበት
አለን እረኛ ሰብስቦ ያዳነን
አለን እረኛ ስለ ስሙ በጽድቅ
አለን እረኛ መንገድ የመራን
አለን አለን - አለን ጌታ ኢየሱስ ታማኝ እረኛ
በሌሊት በቀንም ዘወትር የማይተኛ
አለን አለን - አለን ጌታ ኢየሱስ መልካም እረኛ
በሌሊት በቀንም ዘወትር ማይተኛ
አለን እረኛ የደከመን አጽናኝ
አለን እረኛ የታመመን  ሚያክም
አለን እረኛ የተሰበረ  ጠጋኝ
አለን እረኛ የጠፋ  ሚፈልግ
መንጋውን ....

አለን እረኛ - በሃይልና በግፍ
አለን እረኛ - መንጋውን ማይገዛ
አለን እረኛ - ዘወትር በፍቅር
አለን እረኛ - ሳይደክም የሚመራ
አለን አለን - አለን ጌታ ኢየሱስ ትጉ እረኛ
ነፍሱ ስለነፍሳችን በመስቀል ላይ ሰዋ /2/

አለን እረኛ - በለመለመው መስክ
አለን እረኛ - ነቅቶ ሚያሰማራ
አለን እረኛ - በእረፍት ውሃ ዘንድ
አለን እረኛ - ደግሞ የሚመራ
መንጋውን .....

አለን እረኛ - ዝናብን በጊዜው
አለን እረኛ - ለምድር የሚሰጥ
አለን እረኛ - የምድረበዳን ዛፍ
አለን እረኛ - እንዲያፈራ የሚያደርግ
አለን አለን - አለን ጌታ ኢየሱስ መልካም/ታማኝ እረኛ
በለመለም መስክ ላይ ዘወትር የሚያሰማራ /2/
አለን እረኛ - ለተኩላ ለአንበሳ
አለን እረኛ በትኖ ማይጠፋ
አለን እረኛ በትጋት በንቃት
አለን እረኛ  ተግቶ የሚያሰማራ
',0),(NULL,'ለምንድነው ወዲያ ወዲህ','Berhanu2','ለምንድነው ወዲያ ወዲህ የምንሯሯጠው /2/
ጌታ የሱስ ሁሉን ቻይ አምላክ ነው
የችግር ሁሉ መፍትሄ ሰጪ ነው /2/ 2

አምስት እንጀራ እና ሁለት አሳ ቀርቦ
አምስት ሺህ ሰዎች አጥግቦ መግቦ
አስራ ሁለት መሶብ ቅሩስራስሽ ያስነሳው
ጌታችን ኢየሱስ ሁሉን ቻይ አምላክ ነው /2/

በኢዮሩሳሌም በቤተ ሳይዳ
ከሚንቀሳቀሰው በውሃው መጥለቂያ
ለብዙ ዘመናት ከአልጋ የተኛውን
ኢየሱስ አይደለም ወይ ቀርቦ የፈወሰውን /2/

የሚረዳን አጥተን ከውሃው ዳር ብንተኛ
ጉልበትና አቅም ፈጽሞ ብናጣ
አንድ ቀን ኢየሱስ በኛ አጠገብ ያልፋል
አልጋህን ተሸክመህ ተነስ ሂድ ይለናል /2/

በሕይወት ጎዳና በጉዞ ላይ እያለን
ችግርና እንቅፋት ፈተናም ቢገጥመን
ኢየሱስን ጠርተን እጄን ያዘኝ እንበለው
ወደ ሌላ አናድላ መፍትሄ ከእርሱ ነው /2/
',0),(NULL,'ቢኖረኝ ባይኖረኝ','Berhanu2','ባገኝም ባጣ ቢኖረኝ ባይኖረኝ
እኔ ግን በእግዚአብሔር እጅግ ደስ ይለኛል
ሃሴት አደርጋለሁ ለስሙም ክብር ዘምርለታለሁ
ኢየሱስ ተመስገን ክበር እለዋለሁ
በምስጋና ውስጥ ድልን አገኛለሁ
በምስጋና ውስጥ ሃይልን አገኛለሁ
ሰይጣን አፍሮ አያለሁ

ቢኖረኝ ባይኖረኝ ተመስገን እላለሁ
ባገኝም ባጣም ላንተ ዘምራለሁ
አላጎረመርምም ሁሌ ደስ ይለኛል
መንፈስህ በውስጤ እርካታን ሰጥቶኛል /2/

አጥቼአለሁ ብዬ እኔ አላኮርፍም
አግኝቻለሁ ብዬም ልቤ አይታበይም
በምስጋና መንፈስ በቤትህ እኖራለሁ
ስለሁሉም ነገር ዘወትር አከብርሃለሁ /2/

በኢየሱስ በአምላኬ እጅግ ደስ ይለኛል
የልቤን መሻት እርሱ ይሰጠኛል
ቢኖረኝ ባይኖረኝ ባገኝም ባጣም
እምነቴም ተስፋዬም ኢየሱስ ነውና /2/

ሰይጣን ተስፋ ቁረጥ እኔ የኢየሱስ ነኝ
በምስጋና ሁሌ ድልን የሚሰጠኝ
በሚሆነው ነገር አልጠራጠርም
ሃይል የእግዚአብሔር ነው አንተ አታሸንፍም /2/


',0),(NULL,'እኔ ማን ነኝ?','Berhanu2','እኔ ማን ነኝ የሱስ? እኔ ማን ነኝ?
ከየት አንስተህ ነው ደግሞ ከየት አንስተህ ነው
ትብያና አፈር ሳለሁ የመረጥከኝ/የወደድከኝ
እንዳገለግልህ በፊትህ ያቆምከኝ/
ሳገለግልህ ሞገስ የሰጠኸኝ

 ምንም የማልረባ የማልጠቅም ሳለሁ
በፍቅርህ መውደድህ በቤትህ ተገኘሁ
እኔ ማን ነኝና ራሴን አውቀዋለሁ
ይህን ሁሉ ሞገስ በኔ ላይ ያኖርከው

 ከሃጥያተኛ ዋና ለሃጥያት ተሸናፊ
ጥራጊና ጉድፍ የአለም ትራፊ
መሆኔን እያወቅክ እንዴት እኔን መረጥከኝ?
ማዳንህ አነሰና አገልጋይህ አረከኝ

ያንድነትን ሚስጢር ለኔ ገለጽክልኝ
በስምህ ለውጠህ ደስታን አለበስከኝ
የርስቴን መያዣ መንፈስህን ያተምከኝ
ከየት አንስተህ ነው ለዚህ ያበቃኸኝ

እንደ ዳዊት ጠርተህ በፊትህ ያቆምከኝ
ዘማሪ አሸብሻቢ ላንተ ያደረከኝ
ምኔ አስደስቶህ ነው በኔ መጠቀምህ
ክቡር አምላክ ሆነህ ግን በኔስ መጠራትህ

ብዙ ታላላቆች በፊትህ እያሉ
በእውቀት በጥበብ እጅግ የበለጡ
ታድያ ደካማና ታናሽ ሆኜ ሳለሁ
መገልገያ አረከኝ እኔን ላንተ ------
',0),(NULL,'እግዚአብሔር ቸር ነው','Berhanu2','እግዚአብሔር ቸር ነው ቸር ነው
ምህረቱ ለዘለአለም ነው
ጌታ የሱስ ቸር ነው ቸር ነው
ምህረቱ ለልጅ ልጅም ነው /2/

የናሱኑም ደጆች የሰባበረልን - ቸር ነው ቸር ነው
የብረቱንም መወርወሪያ የቆራረጠልን - ቸር ነው ቸር ነው
ከእስራታችንም ፈቶ ነጻ ያወጣን - ቸር ነው ቸር ነው
ምህረቱን ለዘለአለም ለልጅ ልጆችም ነው - ቸር ነው ቸር ነው

በተጨነቁ ጊዜ ጩኸትን የሚሰማ - ቸር ነው ቸር ነው
አውሎውን ጸጥ አድርጎ በድል የሚመራ - ቸር ነው ቸር ነው
ሞገዱን ዝም አድርጎ አቅርቦ ሚያጽናና - ቸር ነው ቸር ነው
ፈጣን ረዳት ነው የሱስ የኛ ጌታ - ቸር ነው ቸር ነው

ውሃ በሌለበት ምድረ በዳ ላሉ - ቸር ነው ቸር ነው
ተርበው ተጠምተው በራብ ለወደቁ - ቸር ነው ቸር ነው
ነፍሳቸው በውስጣቸው በሃዘን ላለቀ - ቸር ነው ቸር ነው
መርዳት የሚችል አምላክ ኢየሱስ ብቻ ነው - ቸር ነው ቸር ነው

በጨለማ አገር በሞት ጥላ ላሉ - ቸር ነው ቸር ነው
በችግር እግር በረት ታስረው ለተቀመጡ - ቸር ነው ቸር ነው
በበሽታ ታመው በአልጋ ላይ ላሉ - ቸር ነው ቸር ነው
ሁሉም የሚረዳ አምላካችን - ቸር ነው ቸር ነው

ከምስራቅ ከምእራብ ከሰሜን ከደቡብ - ቸር ነው ቸር ነው
በእግዚአብሔር ቸርነት የዳናችሁ ሁሉ - ቸር ነው ቸር ነው
እጃችሁን ከልባችሁ ጋራ አንስታችሁ - ቸር ነው ቸር ነው
ቸር ነህ ለዘለአለም ብላችሁ አመስግኑት - ቸር ነው ቸር ነው

',0),(NULL,'እግዚአብሔር ሰው አይደለም','Berhanu2','እግዚአብሔር ሰው አይደለም - እንደ ሰው አያይም
በመልክም ተማርኮ ሲፈርድም አይስትም
ውስጣዊ ሕይወቱ ልቡን ተመልክቶ
የተናቀ ያነሳል ያገልግለኝ ብሎ

እግዚአብሔር ሰው አይደለም
መልክን ቁመናን አይቶ አይመርጥም
የተዋረደን የተናቀን መሰብሰብን ያውቃል

ይሄ ደካማ ነው ለኔ አይጠቅመኝም
አይልም እግዚአብሔር በሚስኪን ሲጠቀም
ሰውን ለማሳፈር ደካማውን ይመርጣል
የተናቀን ጠርቶ መሰዊያው ላይ ያቆማል

ሐና በእግዚአብሔር ፊት እራሷን አዋርዳ
በእንባ በጸሎት ስታቀርብ ልመና
አምላክዋ ከሰማይ ልመናዋን ሰምቶ
ሳሙኤልን ሰጣት ነቀፈቴዋን አይቶ

ሳሙኤል ወደ እሰይ ቤት ዘይት ይዞ ሲመጣ
ኤሊያብን አይቶ ሊቀባው ሲነሳ
እግዚአብሔር ግን ሰው እንዲያይ እኔ አላይም ብሎ
ዳዊትን አስቀባው ከእረኝነት ጠርቶ

ሐማ አይሁዶችን ለማጥፋት ቢነሳ
ደብዳቤ ቢያጽፍም አዋጅም ቢያስነፋ
እግዚአብሔር የአይሁድን ጸሎታቸውን ሰምቶ
ከጥፋት አዳናቸው ደብዳቤውን አሽሮ
',0),(NULL,'ከብረህ እንይህ ጌታ ሆይ','Berhanu3','ከብረህ እንይህ ኢየሱስ ከብረህ እንይህ
ከብረህ እንይህ ጌታ ሆይ ከብረህ እንይህ /2/*
በአገራችን በምድራችን 
በሕዝባችን ላይ በወገኖቻችን
ይህ ነው የኛ  ምኞት ጸሎታችን 
ከብረህ እንይህ ኢየሱስ አምላካችን
ይህ ነው የኛ ዘወትር  ጸሎታችን 
ከብረህ እንይህ እባክህ ኢየሱስ አምላካችን 

 የጣኦት አምልኮ ከምድራችን ጠፍቶ
የአሸዋው መሰረት ተንኮታኩቶ ወድቆ 
በሐዋሪያት ወንጌል ምድራችንን ባርከህ 
እናመስግን በአንድነት ኢየሱስ ብቻ ከብረህ

 የተቅበዘበዘች ነፍስ ሁሉ እረክታ
 አምላኳን በማወቅ እፎይ ብላ አርፋ
እጆቿን ዘርግታ ስታመሰግንህ 
እንይህ ኢየሱስ በሕዝባችን ከብረህ

 ሰላም እና ጤና በምድራችን ሰፍኖ 
ችግር እርኃብም ጦርነት ተሽሮ
ሕዝብህም በሰላም ወጥቶ እንዲገባ
ክፋት ተወግዶ በጎነትህ ይወራ

ጦርነትን ሽረህ ቀስትንም ሰባብረህ
የጠላትን ጉልበት ሃይሉን አንበርክከህ
እንደ ቃል ኪዳንህ አገራችን ባርከህ
ከብረህ እንይህ ኢየሱስ ሁሉንም ለውጠህ
',0),(NULL,'አይጓደልብህ','Berhanu3','በማለዳ ምስጋና በቀትርም ምስጋና
በምሽትም ምስጋና በለሊትም ምስጋና
አይጓደልብህ አይጓደልብህ
አይጓደልብህ ኢየሱስ/አምላኬ አይጓደልብህ

 ስምህን እጠራለሁ አመሰግንሃለሁ
ለአህዛብ በሙሉ ስራህን አወራለሁ
ዘምርልሃለሁ እቀኝልሃለሁ
በቅዱሱ ስምህ ማለዳ እጓደዳለሁ
እንዳይጓደልብህ ምስጋና ዘወትር እተጋለሁ

 ኢየሱስ ታላቅ ነህ ምስጋናህ የበዛ
ቅዱስነት ግርማህ  በመቅደስህ ዙሪያ
አሜን ይገባሃል  በእውነት ምስጋና
ሳይጓደልብህ ዘወትር ጠዋትና ማታ
በቀትር በለሊት ይቅረብ አንተ አምላክ ነህና

 ታላላቅ ተአምራትን ብቻህን የሰራህ
ሰማያትን በብልሃት መድረኳ ላይ ያጸናህ 
ለጨረቃ ለከዋክብት ሌሊትን ያስገዛህ
ይገባሃል ክብር ሳይጓደል ምስጋና
የአማልክት አምላክ የጌቶቹ ጌታ

አቤቱ በፍጹም ልቤ አመልክሃለሁ
ወደ ቅዱስ መቅደስህ ዘወትር እሰግዳለሁ
ምስጋናዬም ያርግ ዙፋንህን ይክበበው
በላይ በማደሪያህ መልካም ሽታ ይሁነው
በረከት ፈውስህን ከዚያ ነው የማገኘው

 ኢየሱስ አምላኬ በአንተ ደስ ይለኛል
ንጉሴም ስለ ሆንክ ሃሴት አርግ ይለኛል
ስለዚህ በዝማሬ አመሰግንሃለሁ
ምስጋናህም ዘወትር በጉሮሮዬ ነው
እንዲጓደል አልሻም ሁሌ አገልግሎቴ ነው
',0),(NULL,'ኢየሱስ ጌታ ስለ ሆነ ነው','Berhanu3','ጌታ ኢየሱስን የማመልከው
በፊቱ ወድቄ የምሰግደው
የምዘምረው የማሸበሽበው 
ስለ ውለታው ብቻ መቼ ሆኖ ነው
ኢየሱስ አምላክ ስለ ሆነ ነው
ኢየሱስ ጌታ ስለ ሆነ ነው
ኢየሱስ ንጉስ ስለ ሆነ ነው
ኢየሱስ አዳኝ ስለ ሆነ ነው /2/*

 እንደ አምላክነቱ የማመልከው
ለጌትነቱ የምሰግደው 
ለንጉስነቱ የምገዛው 
አዳኝ ነህ ኢየሱስ ሁሌ የምለው
ከእርሱ ሌላ አምላክ ስለ ሌለ ነው 
ከእርሱ ሌላ ጌታ ስለ ሌለ ነው
ከእርሱ ሌላ ንጉስ ስለ ሌለ ነው
ከእርሱ ሌላ አዳኝ ስለ ሌለ ነው /2/

 ስጋዬን ለኢየሱስ የማስገዛው 
ጌታዬ አምላኬ ብዬ የማመልከው
ልቤንም በፊቱ የማፈሰው 
ነፍሴም ወደ እርሱ የምትገሰግሰው
ኢየሱስ አምላክ ስለ ሆነ ነው
ኢየሱስ ጌታ ስለ ሆነ ነው
ኢየሱስ ንጉስ ስለ ሆነ ነው
ኢየሱስ አዳኝ ስለ ሆነ ነው /2/

 ምስጋናን ለሌላ የማልሰዋው 
ክብርንም ለምስሎች የማልሰጠው
ስብከትና አምልኮ የሚገባው
 አዳኜ ኢየሱስ ስለ ሆነ ነው
ስለዚህ ኢየሱስን አምላኬ የምለው 
ስለዚህ ኢየሱስን ጌታ የምለው
ስለዚህ ኢየሱስን ንጉስ የምለው 
ስለዚህ ኢየሱስን አዳኝ የምለው /2/
',0),(NULL,'ውለታህን እያሰብኩኝ','Berhanu3','ውለታህን እያሰብኩኝ
ያደረክልኝንም እየቆጠርኩኝ
ላመስግንህ ኢየሱስ ላመስግንህ
 ላመስግንህ ጌታ ሆይ ላመስግንህ /2/ 2*

ከጨለማ አውጥተህ ብርሃን ላይ ስላቆምከኝ
እስራቴን ፈተህ በድል ስለ መራኸኝ
እስቲ ልነሳና ኢየሱስ ላመስግንህ
በመሰዊያህ ላይ ቆሜ ክብርን ላንተ ልስጥህ /2/

 ከጣዖት አምልኮ ከአሸዋው መሰረት
ከምድረ በዳም ውስጥ ምንም ከሌለበት
ጌታ ኢየሱስ ደርሰህ አንተ አድነኸኛል 
ወጥመዱንም ሰባብረህ ነጻ አውጥተኸኛል /2/

 የኤርትራ ባህር ከፊቴ ቢንጣለል
የፈርዖን ሰራዊት ከኋላዬ ቢከተል
አምላኬ አንተ ደርሰህ ሁሉን ረግጠህልኛል
እኔን በድል አሻግረህ ጠላቴን አስጥመሃል /2/

እጅ መንሻ ጉቦ መማለጃ አላልከኝም
ወደ ቤትህም ስመጣ አላስጨነከኝም
ፈቃርና ርህሩህ ትሁትም አምላክ ነህ
ምስጋና የሚገባህ መልካም አባቴ ነህ /2/
',0),(NULL,'ቃልህ ሲሰበክ','Berhanu3','ቃልህ ሲሰበክ ቃልህ ሲዘመር 
ቃልህ ሲነበብ ቃልህ ሲመሰከር
በውስጤ ገብቶ የምትሻዉን ሳያደርግ
የላከውንም ኢየሱስ ሳይፈጽም 
   በከንቱ አይመለስብኝ /4/  /2/*

 ባዶነቴን ይሙላው ጉድለቴን ያስተካክል
ያለኝንም ባርኮ አብዝቶ ይጨምር
ይቅረጽ ያስተካክለኝ ለአንተ ያሳምረኝ 
  በከንቱ አይመለስ ቃልህ ይለውጠኝ  /2/

እንደ ማር ወለላ ሁል ጊዜ ይጣፍጠኝ
አጣጥሜ ልዋጠው አንድም አይቅርብኝ
እርም የሆነውን ነገር ገብቶ ይንቀልልኝ
    ቃልህ ውስጤን ያንጻው ንጹህ ሰው ያድርገኝ  /2/

 በመንፈስ ቅዱስ ኃይል ሰባኪው ሲሰብክ
ዘማሪው ሲዘምር መስካሪው ሲናገር
 በማስተዋል ልስማ ቃልህን ልቀበለው 
   ሳይሰራኝ እንዳያልፍ እንዳልሆን ከንቱ ሰው /2/

 ኢየሱስ እንድጠራህ ደግሞም እንዳከብርህ
ለቤተክርስቲያን ታዝዤም እንድኖር 
ቃልህ በውስጤ ይግባ እሺ ባይ ያድርገኝ
  በከንቱ አይመለስ ፈጽሞ ይለውጠኝ  /2/
',0),(NULL,'ለኢየሱስ ክብር ይሁን','Berhanu3','መዘመሬ ማሸብሸቤ 
በመሰዊያው ላይ ቆሜ ማገልገሌ
ለኢየሱስ ክብር ይሁን ለኢየሱስ 
  ለአምላኬ ክብር ይሁን ለአምላኬ /2/ 2*

የትኛው ዕውቀቴ ደግሞስ ጥበቤ ነው
ዝናን ከበሬታን ለኔ ምፈልገው
ማዜምና ድምጽን ኢየሱስ ነው የሰጠኝ
አምላኬ ይክበር እንጂ እኔማ ምን አለኝ
ኢየሱስ ይክበር እንጂ በእኔማ  /2/

 ኢየሱስን ሳከብር ስዘምር በፊቱ
ጉባኤው ቢባረክ ቢወርድ መንፈሱ 
አሜን ሃሌሉያ  ጭብጨባው ቢበዛ 
ይሁን ክብሩ ለእርሱ እኔ ግን ልገዛ
ይሁን ክብሩ ለእርሱ ለአምላኬ ልገዛ 

 በለሊት ዝማሬን በአፌ ለጨመረ
በመሰዊያው ስቆም ሞገስ የሆነልኝ
ክብርና ምስጋና ለእርሱ ይሁንልኝ
እኔ ዝቅ እላለሁ ነግሶ ይታይልኝ
በሁለንተናዬ ከብሮ ይታይልኝ 

ከፊቱ ቀድሜ መታየት አልሻም 
ዳተኛም በመሆን ላሳዝነው አልወድም 
እከተለዋለሁ ኢየሱስ ይቅደምልኝ
እኔ ዝቅ ብዬ ከፍ ብሎ ይታይልኝ
እኔ ዝቅ ብዬ ከብሮ ይታይልኝ 

 ክብርን ለኢየሱስ ለአምላኬ ስጡልኝ
በጾም በጸሎት ዘወትር ተሸከሙኝ
የኋላዬን ትቼ የፊቴን እንድይዝ 
የአገልግሎት ጸጋ ሁሌ እንዲበዛልኝ
የአገልግሎት ጸጋ ሁሌ እንዲበዛልኝ
',0),(NULL,'ተመለስ','Berhanu3','ትላንት በኢየሱስ ቤት ስትሰብክ የነበርህ
ስትዘምር ስታመልክ በመሰዊያው ላይ
ዛሬ ምን ነክቶህ ነው በሩቁ የቆምከው 
የእርያዎች አገልጋይ መሆን የፈለከው

ተው ወንድሜ ሆይ ተው ተው /2/
ይጠራሃል ኢየሱስ እጆቹን ዘርግቶ 
ለሰራኸው በደል ሳይፈርድ ሰልችቶ
ተመለስ /3/ ይልሃል 
ወደ ፍቅሩ መንግስት ሊያገባህ እራርቷል /2/

ሁሉ በአባትህ ቤት ሞልቶ ተርፎ ሳለ
ልብህ ለሽፍትነት ለምን  ኮበለለ
ውጭ ውጭ ማየትህ ለምንስ ይበጃል
ውስጡን አስጠልቶ ወደ እሳት ያስጠጋል

 አምላክ የሰጠህን የጸጋ ስጦታ 
አባክነህ ጨርሰህ እንዲሁ በአንድ አፍታ
ጠላት ኪሳራ እንጂ ምንስ ትርፍ ይሰጣል
ከህይወት አውጥቶ ለሞት ያዘጋጃል

ዛሬም የአንተ አባት እርህሩህ ነውና 
ምህረቱን እረስቶ አይጨክንምና
ይቅርታን ጠይቀው ልብህን አዋርደህ 
እንደ አንዱ አድርገኝ በለው ከማያቶኞችህ

 ረሃብ በበዛበት በባእዳን አገር 
በዚያ የምትመኘዉ የእርያን አሰር 
ስለ ሄድክ ነውና በጨለማ ሰፈር 
ና ወደ ብርሃን በደስታ እንዘምር
',0),(NULL,'በእኔ ላይ ስልጣን የአንተ ነው','Berhanu3','ከእጅህ ፈልቅቄ እስካልወጣሁ ድረስ 
ፊቴን መልሼ ከአንተ ካልኮበለልኩ
ምንም አይነካኝ ስጋትም የለኝ
አጥሬ ከለላዬ ኢየሱስ ስለ ሆንክ /2/

በእኔ ላይ ስልጣን የአንተ ነው ኢየሱስ
 በእኔ ላይ
በእኔ ላይ ስልጣን የአንተ ነው ጌታ 
በእኔ ላይ /2/*

አቤት ኢየሱስ ጌታ አምላኬ ነህ 
ሃይሌ ጉልበቴም ክንዴም ድጋፌም ነህ 
አሜን ኢየሱስ እገዛልሃለሁ 
ፈቅጄ ወድጄም አከብርሃለሁ /2/

ነፍሴን በምህረት ኢየሱስ አይተሃታል 
በደምህ አጥበህ መዳን ሰጥሃታል
ስለዚህ ኢየሱስ እኔ የአንተ ነኝ
   እንደ ፈቃድህ እንዳሻህ አርገኝ /2/

 እኔ ዝቅ ልበል ኢየሱስ ክበርልኝ
ተወደስ ተመስገን ዘወትር ንገስልኝ
ነፍሴ ሆይ በእውነት ባርኪው አምላክሽን
በፍቅሩ ስቦ ልጁ ያረገሽን /2/
',0),(NULL,'ና ኢየሱስ ና ክበርብኝ ','Berhanu3','ና ኢየሱስ ና ክበርብኝ /3/   
በደምህ የተገዛሁ ቅዱስ ዕቃህ ነኝ /2/
 ና ኢየሱስ ና ንገስብኝ /3/ 
ያንተ ማደሪያ ቤተመቅደስህ ነኝ /2/

የልቤን በር ኢየሱስ ይኼው ከፍቻለሁ 
ግባ ወደ ውስጤ ንገስ እልሃለሁ
አንተ ስትከብርብኝ ስትሆን ንጉሴ
እኖራለሁ በደስታ እየረካች ነፍሴ

የአሮጌውን ሰው ሥራ ከውስጤ ለማውጣት 
ፈቃዴን በሙሉ ለአንተ ለማስገዛት
በቃል በመንፈስህ መሪነት ለመጓዝ
በልቤ ጽላት ላይ ይታተም መታዘዝ

 ለአገልግሎቴ ዘወትር እንዲመቸኝ 
ኢየሱስ ስትጎበኘኝ በእኔ እንዳታዝንብኝ
መስዋዕት አድርጌ ራሴን አቅርቤአለሁ
ተጠቀም በእኔ ለአንተ ፈቅጃለሁ 

ያለፈውን ትቼ በአዲስ ሕይወት ዛሬ
ከእራስ ጥፍሬ አንስቶ እስከ እግር ጥፍሬ
የአንተ ይሁን ብያለሁ በልቤ ወስኜ 
ተዘጋጅቻለሁ ና ክበር በእኔ
',0),(NULL,'ተቀበለኝ እንካ','Berhanu3','እንካ ኢየሱስ ተቀበለኝ እንካ /4/
እንካ አምላኬ ተቀበለኝ ይኸው /4/
ምስጋናህን እንካ ዝማሬህን እንካ
ሽብሸባህን እንካ እልልታህን እንካ
ተቀበለኝ ይኼው  ተቀበለኝ እንካ /2/
እጨምራለሁ እንካ  በምስጋና ላይ ምስጋና 
እጨምራለሁ ይኼው በክብር ላይ ክብር 
ምስጋናህን እንካ ዝማሬህን እንካ
ሽብሸባህን እንካ እልልታህን እንካ
ተቀበለኝ ይኼው  ተቀበለኝ እንካ /2/
ተቀበለኝ ኢየሱስ ተቀበለኝ እንካ 
ተቀበለኝ ይኼው  ተቀበለኝ እንካ 

 ብዘል ባሸበሽብ  ክብሬን ብጥልልህ
ሲያንስብህ ነው እንጂ ኢየሱስ መች በዛብህ
ዛሬም በተራዬ ቆሜያለሁ በፊትህ 
  እንካ ተቀበለኝ ምስጋና ይብዛልህ /4/

ቢደላኝ ባይደላኝ ሁሌ አከብርሃለሁ
እዚህ አይደለም ቤቴ አገሬ ሰማይ ነው
ብቻ ኢየሱስ ክበር ምስጋና ይብዛልህ
ከሕይወቴ አትጣ  የምስጋናን መንፈስ /4/

ምስጋና ምስጋና ምስጋና ይብዛልህ
ክብር ክብር ክብር የሱስ ይሁንልህ
እጨምራለሁኝ እየደጋገምኩኝ
በምስጋናህም ላይ ክብር እየደረብኩኝ  /4/
እጨምራለሁ እንካ በምስጋና ላይ ምስጋና
  እጨምራለሁ ይኼው በክብር ላይ ክብር /2/

 ኢየሱስ በመንፈስህ  ደስ ደስ ይለኛል
አመስግነው አክብረው አንግስ ያሰኘኛል
ልዋረድ በፊትህ ዝቅ ዝቅ ልበል
አምላኬ አንተ ብቻ ከብረህ ከፍ ከፍ በል /4/
ከፍ በል ኢየሱስ ከፍ በል ጌታ /4/

 እስቲ በአንድነት ቆመን እናክብረው
ለኢየሱስ ምስጋና  ክብርንም እንስጠው
የእግዚአብሔር ካህናት ሌዋዊያን በሙሉ 
ክብርን በምስጋና ለአምላካችን ስጡ /4/
ተቀበለኝ ኢየሱስ .....
እንካ ኢየሱስ ......
',0),(NULL,'አይዞህ የሚል አምላክ ነው','Berhanu3','ተስፋ ለቆረጠ መድረሻ ለጠፋው 
 ሕይወት ለመረረው የሚረዳው ላጣ 
ኢየሱስ የፍቅር መልስ አለው መልስ አለው
አይዞህ ቅረበኝ ልጄ ብሎ የሚጣራ ነው /2/
አይዞህ/3/ የሚል አምላክ ነው
አይዞሽ /3/ የሚል አምላክ ነው /2/

 የኔ ነገርማ ከእንግዲህ አበቃለት 
ሞተ ተቀበረ ድንጋይ ተጫነበት 
ብሎ ተስፋ ቆርጦ ላዘነ ለቆዘመ
ኢየሱስ መልስ አለው ልቡን ለከፈተ

 እንግዲህ አበቃልኝ ምንስ ተስፋ አለኝ
ከእኔ ጋር ማን አለ አይዞህ በርታ የሚለኝ
ብሎ ወደ ኤማሁስ ጉዞ የጀመረው
ተገልጾ ይመልሳል ------ የጣለው

 በፍርሃት ተዘግተው አዝነው ለሚኖሩ
ያስጨነቃቸውን ነገርን ለሚያስቡ
በተዘጋው ቤት ውስጥ መግባትም ይችላል
ችግሩን ለመፍታት ሰላም ላንተ ይላል

በሕይወታችን ዛሬ ሸክም የከበደን
እጅጉን አጉብጦ መሄድም ያቃተን
በእምነት እንቅረብ ወደ ጸጋው ዙፋን
ሸክማችን አንስቶ በድል እንዲመራን
',0),(NULL,'ባንተ ነው ኢየሱስ  ','Berhanu4','ባንተ ነው ኢየሱስ ባንተ ነው
ባንተ ነው ጌታ ባንተ ነው /4/
መልክና ውበት ያገኘነው
መልካም መዓዛ የሸተትነው
ታሪካችንም የተለወጠው
ስማችን እንዲህ ያማረው
ባንተ ነው ኢየሱስ ባንተ ነው
ባንተ ነው ጌታ ባንተ ነው /2/

ቀድሞ ያንተ ወገን ያልነበርነውን
ከምህረትህ ሸሽተን በሩቅ የቆምነውን
ዛሬ ግን በፊትህ በቤትህ የታየነው
በአንተ ምህረት ነው ኢየሱስ የቀድሞው የተሻረው
በአንተ ነው ኢየሱስ /ጌታ/ በአንተ ነው /2/
በአንተ ነው የቀድሞው የተሻረው

 ያ መጥፎ ባህሪ ጥሩ ያልነበረው
ሰዎች እንዲሸሹን እንዲሩቁን ያረገው
ዛሬ ተቀይሮ ውስጣችን ያማረው
የሱስ በህይወታችን ስለከበርክ ነው
በአንተ ነው ኢየሱስ /ጌታ/ በአንተ ነው /2/
በአንተ ነው መልካም ሰው የሆንነው
ባንተ ነው...

 ክፋትና ተንኮል ምቀኝነት ጠፍቶ
በጎነት ቸርነት በልባችን ነግሶ
ሰዎችን ማስደነቅ ማስገረም የያዘው
ታሪካችን ባንተ ስለተቀየረ ነው
በአንተ ነው ኢየሱስ /ጌታ/ በአንተ ነው /2/
በአንተ ነው መጥፎው ከእኛ የራቀው

 መልክና ውበት ሞገስ ያገኘነው
ግሩም ድንቅ ሆነን ዳግም የተወለድነው
ለሰዎች እስኪታይ ህይወታችን ያበራው
በስምህ ጥምቀትና በመንፈስ ቅዱስ ሀይል ነው
በአንተ ነው ኢየሱስ /ጌታ/ በአንተ ነው /2/
በአንተ ነው ዳግም የተወለድነው
',0),(NULL,'ምንም እንዳይዘኝ እንዳይገዛኝ','Berhanu4','ፀጋህ ሲበዛ ሞገስ ሳገኝ
ባርኮትህ ባርኮኝ ከፍ ከፍ ሲያደርገኝ
አንቱ ተብዬ ቦታ ሲሰጠኝ
ከበሬታም ሳገኝ በወንድም በእህቶቼ
ያን ግዜ ዝቅ ዝቅ እላለሁኝ
ምንም /የቱም/ እንዳይዘኝ እንዳይገዛኝ /2/

 የነበርኩባትን የትናንት ስፍራዬን
ዝቅ ብሎ መኖርን አረሳም ጌታዬን
ዛሬ ያገኘሁት የሰጠኸኝ ሁሉ
ከመዳኔ አይበልጥም ጭማሪ ነው እርሱ
የሱስ ሆይ በፊትህ ደግሞ እዘረጋለሁ
ቀሪውንም ለማግኘት ዝቅ ዝቅ እላለሁ

 የሱስ የሰጠኸኝ ያደረክልኝ
ጣኦት ሆኖ ይዞ እንዳያስቀረኝ
የመስቀል ላይ ስራህን ፍቅርህን እያየሁ
ወደ ኋላ ሳላይ ወደፊት እሮጣለሁ
የእምነቴን እራስና ፈጻሚ እያየሁ
የፊቴን ለመያዝ ደግሞ እዘረጋለሁ
ፀጋህ .....

አንዳች ነገር የለም ምንም ከእኔ የሆነ
ያገኘሁት ሁሉ ካንተ ስለሆነ
ዝቅ ዝቅ እላለሁ ይበልጥ ወደ ታች
የሱስ ክብሩን እንድትወስድ እኔ እንዳልታይ
ክበር እንጂ የሱስ ያከበርከኝ አምላክ
ኧረ እኔ ምንድ ነኝ ክብር የሚገባኝ

 ጸጋ ሞገስ ክብርህ ባርኮትህ ቢበዛ
ታላቅነት ባገኝ አንቱታው ቢመጣ
ምንስ ያስኮራኛል ደግሞ ያስታብየኛል
ትእቢት ውድቀት እንጂ መች ህይወት ይሰጣል
ህይወት እምትሰጠውን አንተን ብቻ እያየሁ
በተሰጠኝ ጸጋ ይበልጥ ዝቅ እላለሁ
በፊትህ ዝቅ ዝቅ እላለሁኝ
ምንም /የቱ/ እንዳይዘኝ እንዳይገዛኝ /2/
',0),(NULL,'ያከበርከኝ አምላክ ላክብርህ','Berhanu4','ዛሬም ተነሳሁ ቆምኩኝ በፊትህ
ያከበርከኝን አምላክ ላክብርህ
ያዳንከኝን ጌታ ላመልክህ /2/

 የቱ ጽድቄ ነው መልካምነቴ
ለዚህ ለክብር ያበቃኝ ጌታዬ
ቆም ብዬ ሳስብ ሳሰላስለው
አንድም ነገር አጣሁ ጽድቄ ነው ምለው
ለካ ምህረትህ ፍቅርህ ገኖልኝ ነው
ለዛሬው እኔነቴ ክብሬ /ሞገሴ/ የሆነው /2/

 ከእግዚአብሔር ርቄ ያለ ክርስቶስ ሆኜ
በዚህ ዓለም ተስፋን ሁሉንም አጥቼ
የስጋ የልቤን ፈቃድ እያደረኩኝ
በበደል በኃጢአት ሙት የነበርኩትን
አየኸኝ የሱስ ወደ አንተ አቀረብከኝ
የምስራች ብለህ ሰላምን ሰበክልኝ/
ክብሬ ሞገሴ ውበቴም ሆንክልኝ /2/

 ከጥፋት ጉድጓድ ከረግረግም ጭቃ
ከጥልቅ ከማይታይ ከድቅድቅ ጨለማ
አወጣኸኝ ኢየሱስ አዳንከኝ አምላኬ
በዓለት ላይ አቆምከኝ አጽንተህ ጉልበቴን
አዲስ ዝማሬ ለስምህም ምስጋና
ጨመርክ በአፌ ህይወቴን ቀየርክና /2/

 ሁሉን በምትችል በአንተ በአምላኬ
እየኖርኩኝ ነው በዝቶልኝ ሰላሜ
እውነትና አጥር ከለላ ሆንክልኝ
ክፉ ከእኔ ሸሸ በስምህ ታሰረልኝ
አምላኬ ኢየሱስ ሁሉን ስለሆንክልኝ
ክብርና ምስጋና ይኸው እሰጥሃለሁኝ /2/
',0),(NULL,'እበረታለሁ','Berhanu4','እበረታለሁ /8/
የሱስ የፍቅርህን ስፋት ርዝመት
የሱስ የፍቅርህን ከፍታ ጥልቀት /2/
ለማወቅ እበረታለሁ /4/

 ነፍሴን ለማዳን ህይወት ለመስጠት /3/
ሞቴን በሞትህ ሽረህ ለማጥፋት /3/
ከላይ ከሰማይ ከአርያም ወርደሃል
ጥልቁ ፍቅርህን በመስቀል ገልፀህልኛል /2/

 ቀራንዮ መስቀል ላይ የዋልከውን /3/
በስቃይ በጣር የከፈልከውን /3/
አልረሳም ኢየሱስ አልዘነጋውም
በነፍስ በስጋህ ለእኔ ያረከውን /2/
እበረታለሁ .....

 ፍቅርህን ዘወትር ከልቤ አይጠፋም /3/
በቀን በሌሊት ሁሌ ይወደሳል /3/
ክብርና ግርማ ለአንተ ይሁን
ወዳጄ /አምላኬ/ ኢየሱስ ፍቅር ስለሆንክ /2/

ኢየሱስ ፍቅርህ ልቤን ማረከው /3/
አንተን በውስጤ ከፍ ከፍ አረገው /3/
እጄን ጉልበቴን ለአንተ አስገዝቶ
ይኸው አለሁኝ ፍቅርህ ውስጤን ማርኮ /2/
ክብርና ግርማ ....
',0),(NULL,'ኢየሱስ አብ ነው','Berhanu4','ኢየሱስ /2/ ጌታ ነው /2/
ኢየሱስ /2/ ንጉስ ነው /2/
የዘላለም አምላክ አብ ነው /4/

 የትኛው መጽሐፍ የትኛውስ ቃል ነው
ሁለተኛ አምላክ እግዚአብሔር ወልድ ያለው
ብሉይ ላይ አልተጻፈም አዲስም ላይ የለም
የሱስ ጌታ እንጂ ፍጡር ነው አላለም
እግዚአብሔር ሶስት የሚል በአንድም ስፍራ የለም
አምላክ አንድም ሶስትም ሆኖ አልተገለጠም

 በነቢያት ዘመን በቃሉ የሰራው
በአዲስ ኪዳን ደግሞ ቃል ስጋ የሆነው
ዛሬ በእኛ ጊዜ በመንፈስ ሚሰራው
ስሙም ድንቅ መካር ሃያል የተባለው
ህጻን ሆኖ የመጣው የሱስ ራሱ አብ ነው
ቤተክርስቲያንን በደሙ የዋጀው

የእግዚአብሔር ቃል መጽሐፍ ቅዱስ ነው
መጨመር መቀነስ ፍጹም ማይቻለው
ጌታ ኢየሱስ አብ ነው ወልድም ሆኖ መጥቷል
እኛን ሊያድን ብሎ ክብሩን ትቶ ወርዷል
በመስቀል ላይ ሞቶ ሞታችንን ሽሯል
በስጋው ሰውነት መዳን ሆኖልናል

 ከሰማይ የወረደው ወደ ሰማይ ወጥቷል
በክብር አርጎ ከፍ ከፍ ብሎ ታይቷል
በስሙም ተጠምቀው በመንፈስ ታተሙ
ተነጥቀው በአየር ወደ እርሱ ይሄዳሉ
የበጉን ሰርግ ግብዣ በዚያ ይታደማሉ
እልልታ ዝማሬም በደስታ ያቀርባሉ
',0),(NULL,'የታአምራት አምላክ ተመስገን','Berhanu4','በህይወት በኑሮአችሁ ጌታ የሰራላችሁ
ታአምራት አድርጎ ብዙ ያሳያችሁ
እስኪ ተነሱ እና ዛሬም እናመስግነው
ተመስገን ኢየሱስ ደጋግመን እንበለው /2/
ተመስገን ኢየሱስ ተመስገን /4/
የተአምራት አምላክ ተመስገን
ሁሉን አድርገሃል ተመስገን
እኛ ያቃተንን ተመስገን
አንተ ፈጽመሃል ተመስገን /2/
ተመስገን /3/ ኦ ተመስገን እንበለው
ይህም ሲያንስበት ነው

በአልጋ ላይ ሆናችሁ ብዙ የማቀቃችሁ
ጌታ ኢየሱስ ደርሶ ቃሉ የፈወሳችሁ
እጃችሁን አንሱና ስሙን እየጠራችሁ
የሱስ ሆይ ተመስገን በሉት ደጋግማችሁ /2/
ተመስገን ኢየሱስ ተመስገን /2/

 ተስፋችሁ ተሟጦ ጨልሞ ኑሮአችሁ
ወድቃችሁ የነበረ እረዳት አጥታችሁ
ዛሬ ግን በበረከት ቤታችሁ የተሞላ
አመስግኑት የሱስን ይገባዋልና /2/
የተአምራት አምላክ ...

 ምግብና መጠጥ መጠለያ አጥታችሁ
በስደት በሰው ቤት የተቀመጣችሁ
የችግር እግር ብረት በጽኑ ያሰራችሁ
በሁሉ አመስግኑት በእርሱ ድል አላችሁ /2/
ተመስገን ኢየሱስ ተመስገን /2/


 የእግዚአብሔር ካህናት ቅባቱ ያለባችሁ
ሌዋውያን በሙሉ ለክብሩ የቆማችሁ
ሙሉ ጤና ሰላም እረፍት እሚሰማችሁ
እጥፍ ድርብ ምስጋና ማቅረብ አለባችሁ /2/
ተመስገን ....

 ይኸው እኔም ዛሬ እንደ ሰው ተቆጥሬ
ድንቅ አድርጎልኛል በነፍስ በስጋዬ
ኮልታፋ ብሆንም ቃሌ ባይመጥነው
ከህዝቡ ጋር ሆኜ ተመስገን ልበለው /2/
ተመስገን ኢየሱስ ... / 
የተአምራት አምላክ ...
',0),(NULL,'ወደ እግዚአብሔር ተራራ','Berhanu4','ወደ ያዕቆብ አምላክ ወደ እግዚአብሔር ተራራ
ወደ ያዕቆብ አምላክ ወደ እግዚአብሔር መኖሪያ /2/
እናምጣ ምስጋናውን እናምጣ /2/
እናምጣ አምልኮውን እናምጣ /2/
እናምጣ ዝማሬውን እናምጣ /2/
እናምጣ እልልታውን እናምጣ /2/ 2

ከማደሪያው ከመኖሪያው ከመቅደሱ
ከፍ ካለበት ከነገሰበት ከዝፋኑ
ያርግ ይውጣ ደስ ያሰኘው ይክበበው
እምናመጣው አምልኮአችን ዝማሬው
ደስ ያሰኘው ኢየሱስን ደስ ያሰኘው
ደስ ያሰኘው እግዚአብሔርን ደስ ያሰኘው /2/

ከንጹህ ልብ በፍቅር የሚወጣ
ነውር ነቀፋ ማስመሰል የሌለበትን
እናምጣለት እንጠነው መቅደሱን
እንዲነሳ እንዲባርከን ደስ እንዲለው
እናምጣለት ምስጋናውን በንጹህ ቅን ልብ
እናምጣለት አምልኮውን በፍቅር /2/
እስትንፋስ ያለው ሁሉ ያመስግነው
እስትንፋስ ያለው ሁሉ ከፍ ያድርገው
እስትንፋስ ያለው ሁሉ ያምልከው
እስትንፋስ ያለው ሁሉ ያሞጋግሰው
ኢየሱስ ይበለው ደስ ኢየሱስ /4/

 ሁልጊዜ እግዚአብሔርን እንባርከው
ከአፋችን ምስጋናውን አናርቀው
ሰዎች ሰምተው ደስ ብሏቸው ተለውጠው
እንዲያመልኩት ከእኛ ጋራ አንድ ሆነው
ኢየሱስን ከእኛ ጋራ ታላቅ ያርጉት
ስሙን ይጥሩ ከፍ ያድርጉት ያሞጋግሱት /2/
ኢየሱስ ይበለው ደስ ....

 እግዚአብሔርን እናመስገን ስሙን እንጥራ
እንዘምር እንቀኝለት ስራውን እናውራ
እንነሳ እንናገር ተአምራቱን
እንጓደድ በእግዚአብሔር ፊት በቅዱስ ስሙ
እንነሳ እንጓደድ ስሙን እንጥራ
ደስ እንዲለው ከዙፋኑ እንዲነሳ /2/
እናምጣ ....
',0),(NULL,'ዛሬም በእኛ ዘመን ተገልጠህ እንይህ','Berhanu4','ተነስ /4/
የእግዚአብሔር ክንድ ሆይ ተነስ /4/ 2
ሰማያትን ቀደህ ደመናን ሰንጥቀህ
በቀድሞው አሰራርህ ክብርና ግርማህ
ዛሬም በእኛ ዘመን ተገልጠህ እንይህ /2/
ተገለጥ /3/ በክብርህ
ተገለጥ /3/ በሀይልህ

 የሰራዊት አምላክ ጌታ እግዚአብሔር ሆይ
ምድር አንተን በማወቅ ተሞልታ እንድትታይ
ጉልበት ተንበርክኮ ለአንተ ክብር ሲሰጥህ
አንደበት ተከፍቶ በመዝሙር ሲያመልክህ
ልናይ እንጓጓለን እንናፍቅማለን
አቤቱ ይህን አድርግልን በሀይልህ ተገልጠህ /2/
ተገለጥ ....
 የአመጽ አሰራር አይሎ ባለበት
ሰው ሁሉ ወደ ጥፋት በሚሯሯጥበት
ተው ባይ የሚገስጽ አንድም በጠፋበት
ክፋት ምቀኝነት ተንኮል በበዛበት
በዚች በምድር ላይ ኢየሱስ ተገልጠህ
ልናይህ እንጓጓለን ሁሉንም ቀይረህ /2/

 ሞትና እንቅፋት ከቤትህ እርቆ
ሰው ሁሉ በአንተ በአለቱ ላይ ቆሞ
ሊገለጥ ያለውን ክብርህን እያየ
እንዲጠብቅህ በእምነት ጸንቶ እየታገሰ
አቤት ጌታ ኢየሱስ ተነሳ በሀይልህ
   ልብን ሁሉ አጽና መንፈስህን ሰጥተህ /2/
ተገለጥ ....
 ጨለማው እንዲገፈፍ ብርሃን እንዲበራ
የሰው ሁሉ ሸክሙ ማሰሪያው እንዲፈታ
የተያዘባቸው ወጥመድ ተሰባብሮ
በህይወት እንዲጓዝ ነጻነት አግኝቶ
ይህ ነው ጸሎታችን የልብ መሻታችን
   ተገልጠህ ኢየሱስ መልስ ልመናችንን /2/ 
',0),(NULL,'እጥፍ ድርብ መንፈስህ በህይወቴ ይፍሰስ','Berhanu4',' የመንፈስህ እሳት ሕይወቴን እንዲለውጥ
ኃጢያአቴ እንዲሰረይ በደሌ እንዲወገድ
በአገልግሎቴም ብቁ ሆኜ እንድገኝ
እጥፍ ድርብ መንፈስህ በሕይወቴ ይፍሰስ
በባአለ ሃምሳ ቀን የወረደው
ቤቱን መልቶ ተርፎ ያጥለቀለቀው
እጥፍ ድርብ መንፈስህን እሻለሁ የሱስ እሻለሁ
እጥፍ ድርብ መንፈስህን እሻለሁ ጌታ አሜን /ዛሬ/ /2/

 በመንገዴ ሁሌ ከፊቴ እንዲቀድመኝ
በቀንም በሌሊት በድል እንዲመራኝ
የመንፈስህ እሳት ያብራ በዙሪያዬ
ዘወትር ይሁንልኝ አጥሬ ከለላዬ

 ለአንተ የተለየሁ የክብር እቃ ሆኜ
ስምህን አክብሬ ራሴን አዋርጄ
በትእግስት በቤትህ አንተን እንድጠብቅ
የሱስ ሆይ ሕይወቴን በመንፈስህ ቀምም
እጥፍ ድርብ መንፈስህን ....

 ጉልበቶቼን በእግርህ ስር ዘወትር እንዳበረክክ
ልቤንም በፊትህ አምላኬ እንዳዋርድ
በእውነት በመንፈስ ዘወትር እንዳመልክህ
አሜን ይቆጣጠረኝ ቅዱሱ መንፈስህ 
እጥፍ ድርብ መንፈስህን ....
',0),(NULL,'የሱስ መፍትሔ አለው በቃሉ ተደገፍ','Berhanu4','ኑሮዬ አልተሳካም ሐዘን አልራቀኝም
ምነው ይሄስ ዘመን ለእኔ አልሆነኝም
ቀሪውስ ዘመኔ ኧረ እንዴት ይሆናል
ከእኔስ መቆም የሞተ ይሻላል
ብለህ በሀዘን በችግር ውስጥ ያለህ
የሱስ መፍትሔ አለው በቃሉ /በእሱ/ ተደገፍ /2/

 የመጪውን ዘመን ኑሮህን ለማወቅ
ጠንቋይ አስማተኛ ሌላም አትፈልግ
ሃዋሪያት ነብያት ብዙ ተናግሯል
መጽሐፍ ቅዱስን አንብብ ይመክረሃል
ህይወት ይሰጠሃል
ለህይወት መጠጊያ መሸሸጊያ የሚሆነው
ለሰው ልጆች ሰላም እረፍት የሚሰጠው
መጪውን ዘመን በደስታ እሚያኖረው
የፍጥረታት አምላክ ጌታ ኢየሱስ ነው
አምነህ ኢየሱስን ተደገፈው /4/

የሰው ልጆች ጉዞ እየተፋጠነ ነው
መጽሃፍ ቅዱስ ያለው በመፈጸም ላይ ነው
ስለዚህ ልብህን በሌላ ላይ አታርገው
ችግርህን ጥለህ ኢየሱስን ያዘው
እርሱን ብቻ እመነው
ከዚች ጠፊ አለም ምንም አትጠብቅ
ጊዜያዊ መኖሪያህ ድንኳን መሆንዋን አስብ
አርነትን ሰጥተህ ስጋህን አትልቀቀው
የእግዚአብሔር ሕዝብ እረፍት መንግስተ ሰማይ ነው
እረፍት በኢየሱስ ነው በኢየሱስ ነው /4/
ኑሮዬ ....

 ነገን እንዴት ይሆን እኔስ የምውለው
ምንድ ነው ምበላው ምጠጣውስ ከየት ነው
በማለት በጭራሽ ለስጋህ አታስብ
ዛሬን ላዋለህ አምላክ ነገንም አስረክብ /2/
',0),(NULL,'መች እንዲህ','Berhanu4','መች እንዲህ እንደ ቀላል
ኢየሱስ ደግሞ እንደዋዛ
አይተኸኝ ዝም አላልከኝም
በምህረትህ ጎበኘኸኝ
አይተኸኝ አላለፍከኝም
በምህረትህ አነሳኸኝ
በፍቅር አይተህ በደምህ አጥበህ
ጌጤኛው ልብስን አንተን አልብሰህ
አባባ አባባ የምልበትን
   ሰጠኸኝ ቅዱስ መንፈስህን /2/

በላይ በሰማይ ከነገስክበት
በክብር በግርማህ ከፍ ከፍ ካልክበት
ክብርህን ጥለህ ወደ ምድር ያመጣህ
ፍቅር ነው ኢየሱስ ሁሉንም ያስጣለህ
ጥፊ ዱላውን ዛቻውንም ችለህ
ልትሽር ብለህ ነው ሞቴን በሞትህ

 የሕይወት ትርጉሙ የጠፋብኝን
መድረሻ አጥቼ ግራ የገባኝን
አየኸኝ ኢየሱስ በምሕረትህ ጎበኘኸኝ
በፍቅርህ አንስተህ ወደ ራስህ ሳብከኝ
ልጄ ሆይ አትፍራ አንተ የኔ ነህ ብለህ
አምላኬ ሆንከኝ ታሪኬን ቀይረህ
መች እንዲህ ....

 እንቆቁልሼ በአንተ ተፈታ
ህይወት አገኘሁ ሰላሜም በዛ
በደምህ ታጠብኩ ነጻሁ ከኃጢያቴ
አንተን ለበስኩኝ ጌጤኛውን ልብሴን
ቅዱስ መንፈስህም ህይወቴን ቀደሰው
ጥሩ ሸተትኩኝ መጥፎን ከእኔ አራቅከው

 አቤት ኢየሱስ ፍቅር እኮ ነህ
ሰውን ለማዳን እራስህ የሰጠህ
መማለጃ አላልክ ወይም እጅ መንሻ
ነፍስን ለማዳን ስትጣራ ጌታ
ዘርግተህ እጆችህን ዛሬም ኑ ትላለህ
ፍቅርህ አይቀዘቅዝ ሁልጊዜም አዲስ ነህ
መች እንዲህ .....
',0),(NULL,'ይመቸኛል ኢየሱስ','Berhanu4','ይመቸኛል ኢየሱስ ይመቸኛል
ይመቸኛል አምላኬ ይመቸኛል /2/
ኑሮ ቢመች ባይመች ይመቸኛል
ቢደላኝም ባይደላኝ ይመቸኛል /2/
በእቅፉ መዋል ማደር መኖሬ
ይመቸኛል ኢየሱስ ለስጋም ለነፍሴ
በእቅፉ መዋል ማደር መኖሬ
ይመቸኛል ኢየሱስ ሰላሜ ነው እረፍቴ

 ኢየሱስ ስላለኝ ስለተሸከመኝ
እንደ እናት እንደ አባት ስላቀማጠለኝ /2/
ይኸው እኖራለሁ ዛሬም ተመችቶኝ
የማምለጫ አለት መሸሸጊያ ሆኖኝ/
እምነት ፍቅር ደስታ ሰላምንም ሰጥቶኝ /2/
ይመቸኛል ....

ጣፋጭ ነው ብዬ ያልኩት ዛሬ ቢመርብኝ
እሾህ አሜኬላ ሆኖ ቢወጋጋኝ /2/
ይምረር ይወጋጋኝ አማራጭ አልሻም
ከአባቴ እቅፍ ከጉያው አልወጣም /2/

የሱስ መልካም አምላክ አባት ሆኖልኝ
ቃሉን እየበላሁ በቤቱ አለሁኝ/
መንፈሱን እየጠጣሁ ፊቱ ቆሜአለሁኝ /2/
ክብሬና ማዕረጌ ሞገሴም ሆኖኛል
ኧረ ምን አጥቼ ተትረፍርፎልኛል /2/

 ጠላቴ ቢከሰኝ ጥርሱን ቢያፋጭብኝ
ሲኦል ነው እማወርደው ብሎ ቢዝትብኝ /2/
ይነሳ ይሸልል ፉከራውን ያሰማ
ኢየሱስ ስላለኝ በፍጹም አልፈራም /2/
',0),(NULL,'ጌታ ሆይ ያልተሰራው አካሌን ስራው','Berhanu4','ጌታ ሆይ የሱስ ሆይ
ያልተሰራው አካሌን ስራው /3/
በፍቃድህ በውዴታህ
ውስጤን በመንፈስህ አስተካክለው /3/

ለሰውም ያልታየ ለኔም ያልታወቀ /2/
መራራ የሆነ ስር ሰዶ የበቀለ /2/
ህይወቴን እንዳያድግ ውስጤን ያቀጨጨ /2/
ይኖራልና የሱስ አስተካክለው ቀርበህ /2/
ዛሬ ለኔ መልካም መስሎ የሚታየኝ
ወንድሜን እህቴን ግን የሚያቆስልብኝ
ስራህን የሚንቅ ደግሞ የሚያክፋፋ
እንዳይኖር በህይወቴ የሱስ ሆይ ልሰራ /2/

ባደባባይህ ላይ ቆሜ ባገለግል /2/
ስምህን ብጠራም ለክብርህ ብዘምር /2/
እኔ ካልተለወጥኩ ውስጤ ካልተሰራ /2/
ምንም ዋጋ የለኝም ውስጤን ስራው ጌታ /2/
በቤተክርስቲያን ውስጥ ባስቀመጥከኝ ስፍራ
በሕዝብህ ላይ ሰልጥኜ እንዳልታይ ጌታ
ለባሪያዎችህ እና ለቃልህ እንድታዘዝ
መንፈስህ በውስጤ እለት እለት ይፍሰስ /2/
ጌታ ሆይ ....

መንፈስህ በውስጤ ፈሶ ያስተካክለኝ /2/
ጠማማውን ያቃና መራራውን ያጣፍጥልኝ /2/
ሀሜት ቅንአት ቁጣን ከውስጤ ያውጣልኝ /2/
በጎ ታማኝ ባርያህ አድርጎ ያቁመኝ /2/
አንተ ስትሰራ ገንዘብህ እንድሆን
እምነት ፍቅር ተስፋም በውስጤ እንዲገኝ
በአህዛብ መካከል በህይወቴ እንዲነበብ
አምላኬ ኢየሱስ በልቤ ሁሌ ክበር /2/
',0),(NULL,'እርገጥ ብሎኛል','Carol1','እርገጥ ብሎኛል እባብ ጊንጡን
ስልጣን ሰጥቶኛል አሲዞኝ ስሙን
በትሬ ሆኗል ምሻገርበት
ትልቁን ባህር የምከፍልበት /2/

አቤት ከስሞች በላይ/2*
ይኼ ስም የለው መሳይ/2*
ከሞት ጥፋት ያድናል/2*
አድኖም ይጋርዳል/2*

እንደ ሌሎች አይደለም የኔ በትር ይለያል
የፈርኦንን እባቦች አሸንፎ ይውጣል
የባርነትን ቀንበር ሰብሮ ነጻ ያወጣል
ዳጎን እንኳን ተስኖት የለም በፊቱ ወድቋል
ስሙ ነው ማምለጫ አለቴ/2*
በትሬ ነው ስማ ጠላቴ/2*

የስሙ ጉልበትማ ጫካን ይገላልጣል
ሊቋቋመው አይችልም ተራራውም ይናዳል
አቻ አይገኝ ለኃይሉ ወደር የለው ብርታቱ
ዛሬም በእኔ ይሰራል ያውነው እንደ ጥንቱ
ስሙ ነው..........
ስሙ ኃያል መካር ነው ከለላ ጋሽ ይሆናል
ታምነው በእምነት ቢጠሩት ታሪክ ይገለብጣል
ጽኑ በትር ይዤ ነው ምድረ በዳን የማልፈው
ይኼን ስም ለብሼ ነው ከነአን የምገባው
እርገጥ..........
ኢየሱስ ድንቅ ስም ኢየሱስ የሚፈውስ
ኢየሱስ ኃያል ስም ኢየሱስ ፈጥኖ ሚደርስ /2/
',0),(NULL,'ተነክቻለሁ','Carol1','ውስጤን ነክቶ አንድ ነገር
ይጎተጉተኝ ጀመረ
ሌላ እንዳልመኝ ምርኮኛ ያረገኝ/2*
ለካስ (አባ) ፍቅርህ ነው አንተን የሚያሰኘኝ/2*

የኃጥያቴን ከፍታ
ደምስሶታል ቸሩ ጌታ
መተላለፌንም ሽሮ
ምሮኛል እዳዬን ከፍሎ
ወዶኛል ቀንበሬን ሰብሮ

ተነክቻለሁ በፍቅርህ ተነክቻለሁ
ተማርኬአለሁ በፍቅርህ ተማርኬአለሁ
ተለውጫለሁ በፍቅርህ ተለውጫለሁ
ተፈውሻለሁ በፍቅርህ ተፈውሻለሁ

በዚያ በቀራንዮ ሲቃ
የእዳ መዝገቤ ተዘጋ
አርፌአለሁኝ በቃ
ሆነልኝ መልካም ጠበቃ
አግኝቼ ዋስ ጠበቃ
ውስጤን ነክቶ...
ተነክቻለሁ በፍቅርህ ....

ተነክቻለሁ ተማርኬአለሁ
ከእንግዲህ የግልህ ሆኛለሁ
ተለውጫለሁ ተፈውሻለሁ
     የሕይወቴን ጌታ አግኝቻለሁ /2/*
',0),(NULL,'የሕይወቴን ጅማሬ','Carol1','የሕይወቴን ጅማሬ እስከ መጨረሻ
አስቀድሞ አውቆታል የኔን መዳረሻ
እንዲህ ሆነ ብዬ አላጉረመርምም
በሥራው ጻድቅ ነው 
     እኔ አላማርርም/እርሱ አይሳሳትም /2/*

ንፋሱ አይሎ ማእበል ቢነሳ
የማያልፍ መስሎ ወጀቡ ቢበዛ
ሁኔታን አይቼ አላፈገፍግም
ታይቶልኛል/አይቶልኛል ክብር እርሱን ልጠብቅ /2/*

በሥራው ጻድቅ ነው
በምክሩ ግሩም ነው
እርሱ አይሳሳትም
አምላኬ ታማኝ ነው/ 
    ወዳጄ መልካም ነው  /2/*
የሕይወቴን ጅማሬ....

የሆነው ሆኖ ወደ ግብፅ ብሸጥ
ፍፁም አይቀየር ታሪኬ አይለወጥ
አንዴ ይዞኛል ፍፁም ላይተወኝ
    የገባልኝን ቃል እስከ ሚያሳየኝ /2/*
በሥራው ....

አምላኬ ታማኝ ነው/ 
    ወዳጄ መልካም ነው  //*

',0),(NULL,'እዘምራለሁኝ','Carol1','ማልጄ ልነሳ ዛሬም ላሰማ
የድል ምስጋና በአዳዲስ ዜማ
ጨለማው በርቶ ሌሊቱ ነግቶ
ዝም አያሰኘኝ መንገዴ ቀንቶ /2*

እዘምራለሁኝ እዘምራለሁኝ እኔስ
እኔስ እቀኛለሁ ቅኔን እቀኛለሁ /2/*
ልማዴ ሆኖልኛል ምስጋና በአፌ ሞልቷል
ብዘምር አልሰለችም
 ኢየሱስ ብዬ አላፍርም /2/*

በሕይወቴ ያለፉት ታምሮች ቢወሱ
አቀበት ቁልቁለት ኧረ ስንቶች ተረሱ
ቆጥሬ አልዘልቃቸው አንድ በአንድ ብዬ
     ግን ይኼን አውቃለሁ ረዳኸኝ ጌታዬ /ባንተ ነው ወዳጄ/ 2*

ኦሆ ይኼን ነው የማውቀው
ኦሆ ሁሉን አልፌአለሁ
ኦሆ ይኸው ቀን ወጥቶልኝ
    ኦሆ ባንተ አማረብኝ  /2/*

መዝሙር አይሰለቸኝ አይጠፋብኝ ከአፌ
መዘመር መቀኘት ሁሌ አዲስ ነው ለኔ
በአንደበቴ ሞልቷል አዳዲስ ዝማሬ
ሐዘን ለቅሶ የለም አዲስ(ልዩ) ሰው ነኝ ዛሬ /2/

እዘምራለሁኝ እዘምራለሁኝ እኔስ…..

መለስ ብዬ ሳየው ቆሜ ሳስተውለው
 ያለፍኩትን ሁሉ ዛሬ ሳስታውሰው /2/*

አቤት(ኧረ) ስንቱን ስንቱን አለፍኩ
በክንድህ እየተደገፍኩ
ስምህ ይክበር ሌላ የለኝ
እጅ መንሻ የሚሆነኝ /6/
',0),(NULL,'ልቤ ጨክኗል','Carol1','ልቤ ጨክኗል እዘምራለሁ/2*
መንፈሴ እጅግ ቀንቷል ቅኔ እቀኛለሁ/2*
ገና ዘምራለሁ የወህኒ ደጅ ይከፈታል
ገና አመልካለሁ እስራትም ይፈታል
ገና ዘምራለሁ እሳት ከላይ ይወርዳል
ገና አመልካለሁ የሱስ በምድር ይከብራል

አምልኮን ስጨምር ሰማይ ይከፈታል
የብዙዎች እስራት ቀን በር ይሰበራል
የወህኒው መሰረት ችሎ ጸንቶ አይቆምም
ደጁም ይከፈታል ተዘግቶ አይቀርም /2/
ገና ዘምራለሁ..........

የበአል ነቢያት ሲፎክሩ እያየሁ
እኔም በአምላኬ ስም ተወራርጃለሁ
አሁን ተረኛ ነኝ ቆሜ ዘምራለሁ
መስዋዕቱን በሙሉ እሳት እስኪበላው/2/
ገና ዘምራለሁ.......

ስሙ በአለም ይገናል 
ፍጥረት ሁሉ ይገዛል
ብቻውን ይመለካል.
ምንድን ነው ዝምታው የምን መቀመጥ ነው
እያሪኮ ፈርሳ ስትነድ እያየሁ
ዘመኗ አብቅቷል አሁን ዘምራለሁ
ስሟም እስኪረሳ ገና ቀጥላለሁ
ልቤ ጨክኗል…..
ገና ዘምራለሁ.......
',0),(NULL,'እሮጣለሁ','Carol1','ኃጥያት ከቦኝ በማጥ ውስጥ ተዘፍቄ
ሰላም እረፍት እርቆኝ ተጨንቄ
ድምጽ ተሰማ የጥሪ ከመቅደሱ
    ሊያነጻው ነው በደሌን በክቡር ደሙ /2/*

እሮጣለሁ ወደ እርሱ እገሰግሳለሁ
ሸክሜን ከእግሩ ስር እጥላለሁ
እሄዳለሁ ሚስጥሬን አዋየዋለሁ
የልቤን ሁሉ እነግረዋለሁ
እሄዳለሁ ጉድለቴን አዋየዋለሁ
የልቤን ሁሉ እነግረዋለሁ

በምድረ በዳ ጉዞ በበረሃ
ነፍሴ ስትዝል እጅጉን ስትጠማ
አሻቅቤ /መለስ ብዬ/ መስቀሉን ስመለከት
ይሰማኛል ሲሞላ ዉስጤ በእረፍት /2/*

እሮጣለሁ ወደ እርሱ…..

ሸክም ሲከብደኝ የሚራራልኝ
ሀዘን ሲሰማኝ የሚያጽናናኝ
በልቤ ያለው አንዳች ሳልደብቅ
    የማዋየው አምላክ አለኝ /3/*
',0),(NULL,'ጽዮናዊ ነኝ','Carol1','እድለኛ ነኝ ከሞት ግዛት(ከሲኦል ደጅ) ያመለጥኩኝ
እጩ ነኝ የጽዮንን ጉዞ የጀመርኩኝ /2/*
ልጠብቀው ይህን መዳኔን
እንዳልጥለው ውድ ንብረቴን
ዋጋ ያለው እርስቴ ነው
  በምንም ነገር የማልመዝነው /2/*

በምድር አትርፌ ተደላድዬ
ሁሉ ተሳክቶ ነፍሴን አጉድዬ
መቅረት አልሻም ከኢየሩሳሌም
  ሌላው ቀሪ ነው አያዋጣኝም /2/*

ኢየሩሳሌም ኢየሩሳሌም
የምናፍቃት ተስፋይቷ ሀገሬ
ከቅዱሳን ጋር ልኖር አብሬ
እጓዛለሁ ሁሉ ትቼ
አምላኬን ላምልክ ክብሩን አይቼ
በዙፋኑ ፊት ፍጹም ረክቼ
ተወኝ ስጋ አትሞግተኝ
ተይኝ አለም አታባብይኝ
ሰላም እረፍት ደስታ ያለባት
ሀገር አለኝ የምናፍቃት
የኔ ሀገር ኢየሩሳሌም ናት /2/

ከዚህ አይደለሁ ይህ ድንኳኔ ነው
ለምን ልከጅል ጠፍቶ ለማየው
ፍጻሜ ላለው በርትቼ ልሩጥ
 ለስጋ ምኞት አርነት ሳልሰጥ /2/*
ኢየሩሳሌም ኢየሩሳሌም…….

በከበረ ደም የተዋጀሁኝ
ለትልቅ ግብዣ የተጠራሁኝ
የደስታ ሕይወት የሚጠብቀኝ
ዜግነት ያለኝ ጽዮናዊ ነኝ /2/*
ኢየሩሳሌም ኢየሩሳሌም …..

ስለ መዳኔ እንዲህ ብዬለሁ
    የሚያስጥልኝ ኧረ እርሱ ማን ነው /2/*
',0),(NULL,'ያውቅበታል','Carol1','ያውቅበታል ማሻገሩን ያውቅበታል
ያውቅበታል ማጽናናቱን ያውቅበታል
ችሎበታል ድል ማድረጉን ችሎበታል የኔ ኢየሱስ
ችሎበታል የማይቻለውን ችሎበታል

የሱስ ልዩ ነው እኔ አይቻለሁ
ካሰብኩት በላይ እርሱ ትልቅ ነው
ስለእርሱ ዝና ቆሜ አወራለሁ
ካወኩት በላይ የሱስ ጌታ ነው /2/*

ትውልድ ይመስክር ስለ እርሱ ዝና
አምላክነቱ ዛሬም ይወሳ
እኔ አልሰለችም ሁሌም ባወራ
ተንዶልኛል ያኛው ተራራ/
ተደርጎልኛል ብዙ ውለታ /2/*

ከምለው በላይ በላይ በላይ ነው
ካሰብኩት በላይ በላይ በላይ ነው
ከትልቅ በላይ ትልቅ ትልቅ ነው
    ከጀግናም በላይ በላይ ጀግና ነው /2/*

የሰማሁትን በአይኔ አይቻለሁ
ከሰማሁት በላይ ሆኖ አግኝቻለሁ
ቃላት አይገልጹም ትልቅነቱን
ብቻ ልዘምር አባትነቱን /ሃያልነቱን /2/
ከምለው በላይ…..

ምንም ቢገጥመኝ ፍጹም አልፈራም
ኢየሱስ እያለ ቅንጣት አልሰጋም
በሚገጥመኝ ላይ እዘምራለሁ
  ኢየሱስ ጌታ ነው (የርሱን ጌትነት) እነግረዋለሁ /2/*
ያውቅበታል ማሻገሩን ያውቅበታል ….
ከምለው በላይ…..

በላይ በላይ የሁሉ የበላይ
በላይ በላይ የሱስ/ጌታዬ የበላይ /2/*
',0),(NULL,'ሰበቤ ተወገደ','Carol1','ሰበቤ ተወገደ ምክንያቴም ተቆረጠ
ሸክሜ ኢየሱስ ወሰደው
ልቤ በእሱ ቀለጠ /2/
ኦሆሆ አመልከዋለሁ በእልልታ ተሞልቼ
ጠላት አይኑ እያየ በዘይት ተቀብቼ
ኦሆሆ እዘላለሁ ከበሮዬን አንስቼ
ጠላት ስማ ተፈቷል እግሮቼ

የባርነት ወራቴ አልፎ ላይመለስ
ሀዘን ለቅሶ ጭንቀቴን በቃ ረሳሁ ላላስታውስ
አሁን ልበቀለው ነው የዝሜታ ጊዚያቴን
ባደባባይ ላይ ዘምሬ ላውጅ ነው ነጻነቴን/ላሳፍረው ጠላቴን /2/

ወርዶብኝ የዳዊት መንፈስ
አሰኘኝ ማዜም ማሸብሸብ ልነሳ
እኔም በተራዬ አለኝ ለጌታዬ
ይኸው ለጌታዬ አለኝ ለየሱሴ/ለንጉሴ /.../

በምስጋና ከፍታ ላመልከው ይኸው ቆሜያለሁ
በጠላቴ ፊት ለፊት ገና በዘይት እቀባለሁ
እያገሳ ቢዞረኝ ቢያስፈራራ ቢቆጣ
እኔ እንደሆን ይብስብኛል አላቆም በሱ ዛቻ /2/
ያ ዘምረኛል /3/ ክብሩ ውስጤን ነክቶታል
ያዘምረኛል /3/ ተነስ ዘምር ይለኛል /2/

ጠላት ዘመን መጣብህ በመንደርህ ልዘምር ነው
ብቻዬን አይደለሁም ጀግናው ኢየሱስ ከኔ ጋር ነው
በግዛትህ ውስጥ ያሉ ገና እንደኔ ይፈታሉ
ሰንሰለት ወድቆላቸው ኢየሱስን ያመልካሉ /2/
ያ ዘምረኛል ......
',0),(NULL,'አልችልም እኔ','Carol1','አልችልም እኔ ያላንተ መጓዝ
አልችልም እኔ እጆችህን ልያዝ
አልችልም እኔ ብቻዬን መሮጥ
እምነት አጥቼ በውሃው እንዳልሰምጥ /2/*
እጆችህን ልያዝ ልታበረታኝ
እባክህ ጌታዬ መንገዴን ምራኝ /2/*

ጭላንጭላው እምነት በማእበል ወጀብ ብዛት
ኋላ እንዳትጠፋ ጭራሽ ንፋሱ ሲነፍስባት
አይለያዋት አይኖቼ በመንፈስህ አቀጣጥላት
ብርሃንህ በአለም ፈክቶ ጨለማው እንዲሸሽላት
እጆችህን ልያዝ ልታበረታኝ
እባክህ ጌታዬ መንገዴን ምራኝ /2/*
ያላንተማ ጉዞ ከባድ ነው
ያላንተማ ትርፉ ድካም ነው
ያላንተማ እኔስ አቃተኝ 
  ያላንተማ ምንም አይቻልም /2/*

ወጣ ገባው መንገዴ እንዳይሰለቸኝ ረዝሞ
ጉዞዬን እንዳላቆም ጉልበቴ ተሎ ደክሞ
የላይኛው ሃይልህን በላዬ አፍስሰውና
እንደገና ልጀምር ጉልበቴ ይታደስና

እጆችህን ልያዝ ...

እንደ ንስር ካደስከኝ በከፍታ እበራለሁ
የአለምን ስበት በሃይልህ አሸንፋለሁ
እንደገና ልታደስ እንድበር በከፍታ
ትግሉን እንድታገል ዛሬም እንድበረታ
አልችልም ....
',0),(NULL,'በቃ በለን','Carol1','በቃ በለን ጌታ ሆይ ይበቃ በለን
በቃ በለን ኢየሱስ ሆይ ይበቃ በለን /2/*
 
በልማድ መጓዙ ይበቃናል
በይሉኝታ መተብተብ ይጥለናል
የመንፈስህ ምሪት ይሻለናል
ድምጽህን መከተል ይበጀናል

ክብርህን ተዳፍረን እንዳንጠፋ
የሚባለው እሳት በኛ ላይ ሳይከፋ
ልቦናችን ይብራ ውድቀት ሳይመጣ
   እጅህ ዘርግተህ ምህረትህ ትምጣ /2/*

ድምጽህን መከተል ይሻለናል
ወደ ሕይወት መንገድ ይመራናል
ከመቅደስህ መሆን ይበጀናል
ከእግርህ ስር መቀመጥ ያዋጣናል
ድምጽህን መከተል ይሻለናል 

ድምጽህን መከተል ይሻለናል
ወደ ሕይወት መንገድ ይመራናል
ከመቅደስህ መሆን ይበጀናል
ከእግርህ ስር መቀመጥ ያዋጣናል

በቃ በለን ጌታ ....
',0),(NULL,'ምንድ ነው አላማህ','Carol1','ምንድ ነው የምታሻው ጌታ ሆይ
ምንድ ነው አላማህ አባት ሆይ
ፍቃድህን ልወቅ ልረዳ
አላማህ መልካም ናትና /2/*

በራሴ አላም ዝም ብዬ እንዳልጓዝ
በስጋዬ ፍቃድ እንዳልወድቅ እጆቼን ያዝ
አንተን ልታዘዝህ እሽታን ልሞላ
በጭፍን እንዳልሄድ ልቦናዬን አብራ

ምንድ ነው ....

አንተ የምታስበው ለሕይወቴ ይበጃል
ምክርህ ይሻለኛል ሌላው ይበቃኛል
ሩጫዬ ከንቱ ነው ድካሜ ዋጋ የለው
አሳውቀኝ ጌታ ፍቃድህ ምንድ ነው?

ና ግባ በልቤ
ና ንገስ በሕይወቴ
ባዶነቴን ሙላ
   ውስጤን አድስና /2/*
',0),(NULL,'መለስ ቀለስ','Carol2','መለስ ቀለስ አያሰኝም አስቾኳይ ነው ጥሪው
ወድያ ወዲህ አያስብልም መጎናጸፊው /2/
እርፉን በእጄ አስይዞኛል
ጥማሬን አስጥሎኛል
ሃይሉን አፍስሶብኛል
ቃሉን አስታጥቆኛል /2/*

ከዛ ከታሰርኩበት - ሊያሰፈታኝ ትእዛዝ ወጥቷል
በላዬ ሊነግስብኝ - ሊቀመጥብኝ ወዷል
ልእሉ ሊከብርብኝ - እኔን ከመረጠና
ምክንያት ሰበብ አይኖረኝ ሞገስ ካገኘሁማ /2/

ሰልፉ የእግዚአብሔር ነው ድሉ ግን የኔ ነው
መለከቴን ይዤ ድምጼን አሰማለሁ/ዛሬ እዘምራለሁ /2/*
ሰልፉ የእግዚአብሔር ነው ድሉ ግን የኔ ነው
መለከቴን ይዤ ወደ ሰልፉ እገባለሁ /2/*

እንዲሁ አያስቀምጥም የኤልዛቤል ስራዋ
ሰላም እረፍት አይሰጠኝ ክፋት ጉልምትናዋ
በላዬ ከፈሰሰው/ከወረደው ከቅባቱ የተነሳ
ለክብሩ ቀንቼአለሁ ሰይፌን ዛሬ ላነሳ /2/*

ሰልፉ ..../3/
አልፈራም /3/ የሱስ እያለ አልሰጋም /2/
',0),(NULL,'ለዚህ ነው','Carol2','ስራውን አድንቄ ስለ ዝናው ዘምሬ
እኔ አልጠገብኩም/አልረካሁም ገና ድንቃድንቁን አብስሬ /2/*
ግዛቱ ወሰን የሌለው - ብርታቱን አይቼዋለሁ
ስለ እርሱ እናገራለሁ - አላፍርም ልቤ ሙሉ ነው /2/*

ምድርን እና ሞላዋን የእርሱ ሞገስ ሞልቷታል
አለቅነት ስልጣናት ለሃይሉ ተገዝቶለታል
ለግዛቱ ወሰን የለው - ሃይላትን ሁሉ አንበርክከዋል
ዘመን አመታትን ሽሮ - በዙፋኑ ጸንቶ ይኖራል /2/

ለዚህ ነው እንዲህ ማለቴ
ኮራሁኝ እኔስ ባባቴ/ባባዬ
ብናገር አፌን ሞልቼ
አላፍርም ስላዩ አይኖቼ /2/*

ሰማያት አክብሩት
ፍጥረታት ሁሉ አድንቁት
ልጆቹ አምልኩት
ድንቃድንቁን ዘምሩት /2/*

ድንቃድንቁን ዘምሩት /2/
ስራዎቹን አብስሩት /2/

የተቀጠቀጠውን ያንን ሸምቦቆ አጽንቷል
የሚጭስ ክር እንኳን በመንፈሱ ዘይት ነዷል
ምስኪኑ በእርሱ ላይ ታምኖ - አፍሮ መቼ ይመለሳል
በመጠበቅያው ታግሶ - ባዶ በረቱ ሞልቶ ያያል /2/

ለዚህ ነው .....
ሰማያት .....
',0),(NULL,'እንደ አይኑ ብሌን','Carol2','ውጦ አላስቀረኝ ድቅድቁ ጨለማ
ጠውልጊ አልጠፋሁ በዛ በረሃ
ወጥቼ አልቀረሁ በምድረ በዳ
የሚያየኝን ጌታ አየሁት እኔን/መጥቶ ሲረዳ /4/

አይሆንለት መቼ የነፍሴ ጉዳይ
ዘወትር ተተክሏል አይኖቹ በኔ ላይ
ለአፍታ እንኳን የማይተወኝ ፍጹም የማይጥለኝ
እኔስ ወዳጅ አለኝ ዋስትና የሆነኝ /2/*

እንደ አይኑ ብለይን ለኔ ተጠንቅቆ
ታድጎኛል የሱስ ከክፉ ጠብቆ /2/*

ዝዬ ስብረከረክ ሲከዳኝ አቅሜ
ተስፋ የማደርገው ሳጣ ባጠገቤ
ለካስ እያየ ኖሯል ያኔ መጠማቴ
ደርሶ አርክቶኛል አጽንቷል ጉልበቴ /2/*

እንደ አይኑ ....

ሃዘኔን ጭንቀቴን ውድቀቴን አይቶ
ከላይ ከአርያም ለኔ ታርሶ
ክንዶቹን ዘረጋ ሚስኪኑን ሊረዳ
አይቶ አላለፈኝ ይህ ጻድቅ ጌታ /2/*
እንደ አይኑ ...

ለካስ ያየኛል በፍቅር አይኖቹ
ደርሰዋል የማዳን እጆቹ
ውዴ አይቶኛል በዘላለም ፍቅሩ
ረድቶኛል በማዳን እጆቹ /2/*
',0),(NULL,'ተጓዝኩና','Carol2','ተጓዝኩና አለፍኩና /2/
ተጓዝኩና /2/ ካንተ ጋር ረጁሙን ጎዳና
አለፍኩና /2/ ይኸው ቆምኩኝ ለምስጋና /2/*

ዛሬ የለም ያ ጠላቴ
በጉዞት ያስጨነቀኝ ያኔ
እንደ ሃሳቡ መቼ ሆነለት
እሱ ሰጥሞ እኔ አለሁ በሕይወት /2/*

ለኔ መጥፊያ መውደቂያ
ጉድጓድ ምሶ አበጃጅቶ
የሚሆንለት መስሎት
ጠላት ከፊቴ አድምቶ

ዙሪያዬ መታጠሩን መከበቡ ዘንግቶ
ለኔ ባዘጋጀልኝ አሃ አየው እሱ ራሱ ገብቶ /2/*

ምስጋና/እልልታ/ሙጎሳና ነው በልቤ ያለው ምስጋና ነው
ታሪኬን ለውጦልኝ ዛሬ እንዲህ ያሳመረው

ፈርኦን አልመለሰኝ
ዛልቻውም አላስፈራራኝ
ዮርዳኖስ አላስቆመኝ
ጌታዬ ካሰበልኝ

ከሚያገሳው አንበሳ አሃ በውስጤ ያለው በለጠ
እኔ ካሰብኩት በላይ አሃ ታሪክ ተገለበጠ /2/*
ምስጋና ነው ....

ከኔ ምትሻው ምስጋና/እልልታ ነው ወይ
ይኸው ምስጋና/እልልታ ውስጤ ተሞልቷል
ይኸው ምስጋና/እልልታ አፌ ተሞልቷል /2/*

ኦሆ ምስጋናን ነው ወይ - ምስጋና
ኦሆ እልልታን ነው ወይ
ኦሆ አምልኮን ነው ወይ
ይኸው ይፍሰስ ጌታዬ /4/*

ምስጋና ውሰደው
ይኸው ይፍሰስ ጌታዬ /2/*
',0),(NULL,'ሆ ሳበኝና','Carol2','የእምነት ተስፋ አባቴን አብርሃም ነው
ድምጽህን አድምጦ እንሆ ያለው
ሁሉን ወደኋላ አሃ ጥሎ የወጣው
ተስፋውን በእምነት አይኖቹ ያየው
ከነዓን ልታደርሰው ልታበዛው ልትባርከው
አስቀድመህ አንተ ከዚያ ስበህ አወጣኸው
ወደ ምድረበዳ ጠርተኸው ለይተኸው
ከቤቴል አድርሰህ መሰዊያህን አሰራኸው

ከመረጥከኝ ከጠራኸኝ - ለክብርህ 
በኔ ላይ መልካም ከሆነ - ፈቃድህ
ከወግና ከልማዴ - አውጣኝና
አድርሰኝ እባክህ ከቤቴል – ከመሰዊያ

ሆ ሳበኝና ወደ ክብርህ ልግባ
የስጋ የምድርን ክልል ልጣስና
ሆ ለየኝና ወደ አንተ ልጠጋ
የስጋ የምድርን ክልል ልጣስና

ቀንበር ሸክም ስቃይ በላዩ በዝቶበት ባርነት
እስራኤል በግብጽ ምድር ሆኖ ሲናፍቅ አርነት
ጠላት አቅም ጉልበቱን ሁሉ ሲበዘብዝበት
ያንተን ሕዝብ ላንተ ልታኖረው ጣልቃ ገባህለት

አንተው -ገዝተህ መርተህ መሰዊያህን ልታሰራው
በጸናችው ክንድህ ለይተኸው አሻገርከው
ፋሲካ ሆነለት - ውስንነት ተሰበረለት
ጥሶ ገባ ሄደ ክብርህን አየ - ገልጠህለት
የስጋ ውስንነቴን ስበርና
ጥበቴን በክብርህ ስፋት ለውጥና - አሃ
ወግ ልማዴን አጥር ቅጥሬን - ልጣስና
ልቤን መንፈሴን ጉልበቴን - አንተው ግዛ አሃ

ሆ ሳበኝና ወደ ክብርህ ልግባ
የስጋ የምድርን ክልል ልጣስና
ሆ ለየኝና ወደ አንተ ልጠጋ
የስጋ የምድርን ክልል ልጣስና /2/

አሻግረኝና ወደ ክብርህ ልግባ
አንተ ከማይበት ከፍታ ላይ ልውጣና
ለውጠኝና ወደ አንተ ልጠጋ 
ከምትገኝበት ከፍታው ላይ ልውጣ
',0),(NULL,'ያኔ የታመንኩት','Carol2','ያኔ የታመንኩት ጌታ ትምክህቴ ነው ያልኩት
ያኔ የተደገፍኩበት ድጋፌን ያረኩት
ያኔ የጠራሁት ጌታ ይሰማኛል ያልኩት
ይኸው አላፈርኩበትም ታምኖልኝ አየሁት /2/*

ይሄ ነው የሱሴ ይሄ ነው ጌታዬ
ይሄ ነው ወዳጄ ለኔ መታመኛዬ /2/*

ልቤ ሲሸበርብኝ አይኔን ወደሱ አንስቼ
ወደ ላይ ተጣራሁኝ ግራ ቀኜን አይቼ
ወድያው ዘንበል ብሎልኝ ጭሆቴን አደመጠው
ውሽንፍሩን አዘዘው ማእበሉን ጸጠ አረገው /2/

ይሄ ነው .....

በእጄ የነበረውን ሁለት አሳን ልስጥ
አይኔ አይቶ ሲጠራጠር ልቤ ግን ታመነበት
የሰማያትን መስኮት አስፍቶ ከፈታቸው
ሸሎቆዎቼን በሙሉ በበረከቱ ሞላቸው /2/

ያኔ የታመንኩት .....
ይሄ ነው.....

ለኔ/ኢየሱስ መታመኛዬ /2/
ለኔ/ኢየሱስ መደገፊያዬ /2/ /5/*
',0),(NULL,'ሕይወቴን ልኑረው','Carol2','የሕይወቴ ውበቱ የመዳኔ ሚስጥሩ
መረዳት ብቻ አይደለም መኖሩ ነው ትርጉሙ
እርሃብና ጥማቱ የጎልጎታው ህመሙ
እንዲሁ በከንቱ አይደለም የፈሰሰልኝ ደሙ /2/*
ቅዱሱን ልመስለው ሕይወቱን ልኖረው
የመስቀል የቀራንዮ አላማው ይኸ ነው /2/*

የሀጢአት ዘር ግንዴ በሞቱ ከሰበረ
የዚያ የሞት  ፍሬ በደሙ ካበከለ
የስጋዬ ምኞት መሻቱ ተሰቅሎ
ካህኑን ይመስለው ለዚህ አለም የሞተው

ተው ልቤ ልብ በል ቅዱሱን ልትመስል
ተው ተው ልቤ ተመልከት የቀራንዮ ውበት
ተው ልቤ አስተውል ቅዱሱን ልትመስል
ተው ተው ልቤ ተመልከት የመስቀሉን ውበት

ይታይልኝ ብዬ ቢረዝም ካባዬ
አይሰምርም ጉዞዬ ይውረድ መለከቴ
ባንደበቴ ሳይሆን በሕይወቴ መስክሬ
ማለፉን እሻለሁ የእርሱን ሕይወት ኖሬ

ነጩን የጽድቅን ሸማ - ህያው ማንነቴ
ያን የመስቀሉን ዋጋ - ልጠብቀው መክሊቴ
ሕይወት እንዲሆንልኝ - እንዲትረፈረፍልኝ
ለዚህ ነው ተዋርዶልኝ - በሞቱ ያከበረኝ /2/*

ተወዳጅ ወዳጁን መልሶ ቢወደው
መልካሙንም በመልካም መመለሱን አይከብደው
ግራውን ሲመቱት ቀኙንም መስጠቱ
እርሱ ነው ማንነት የክርስቶስ ሕይወት
ተው ልቤ .... 
ነጩን ....
',0),(NULL,'ሰባሪው ሰባብሮ','Carol2','ሰባሪው ሰባብሮ ከፊት አልቋልና
እኔም ልከተለው በድል በምስጋና
መወርወሪያውን ቆርጦ መዝጊያው ሊሰባብር
ታምርን ሊያሳየኝ አልፏል እግዚአብሔር /2/*
ልከተለው ከኋላ ልከተል ድሌ የኔ ነው
በሰልፉ የበረታ እርሱ እግዚአብሔር ነው /2/*

የድሉ ጌታ ከፊቴ ቀድሟል - በጠላት ሰፈር
ልከተልና ገብቼ ልምረጥ - ከዛኛው መንደር
በቃ አሁን የለም ተንዶ ወድቋል - የጠላት ቀጥር
ምሽጉን ፈርሷል ጠላትም ሸሽቷል - ሆኗል አሽብር
አለ የሚያኮራኝ የማላፍርበት
ከምንም በላይ ምታመንበት /2/*
አሁን የለም በቃ ተሰብሯል - የብረት መውጊያው
ልግባና ልውረሰው እያልኩኝ - ሃሌሉያ /2/*
ሃሌሉያ /3/ አሁንም አለ ልቤ ጸና /2/
ያኔ ሲሳለቅ ቆሞ ሲፎክር - ሲገዳደር
ማን ገምቶታል ይወድቃል ብሎ - በትንሽ ጠጠር
በባዶ አይደለም ውዴን ይዤ ነው - እኔስ ብፎክር
ብታመንበት ብጓደድበት - እርሱ አያሳፍር

አለ .....
አሁን .....
አቅዶ ነበር ሊያሸንፍ ጠላት - በፈረስ ብዛት
ማን በነገደው ምንም ቢያሰልፍ - እንደማይሆንለት
የኔስ መዋጊያ ሰረገላ አይደል - ምታመንበት
ሃያል ጌታ እርሱ እግዚአብሔር ነው - ምደገፍበት
አለ ....
አሁን ...
ልቤ ጸና በጌታ - ልቤ ጸና ተ መካር
ልቤ ጸና በጌታ - ሰባሪው ስላፈረሰው
ፍርስራሹን ረግጨውአለሁ/ቆሜአለሁ /4/*
',0),(NULL,'ጎዳናዬን','Carol2','ታውረው ተጋርደው - የልብ አይኖቼ
እንዴት እጓዛለሁ - ካላየሁ አጥርቼ /2/
ፍጹም ተራርቆ ሃሳብህ ካሳቤ
እንዴት እደርሳለሁ ከጽዮን አገሬ /2/

ልመልከት ብድራቴን አይኖቼን ክፈትና
አቅናልኝ አረማመዴን እንዳልቀር በምድረበዳ /2/*

ከሆነ ድንግዝግዝ - አመለካከቴ
እዚሁ ያስቀረኛል ከላይኛው ርስቴ /2/
ጠላት ባስቀመጠው ወጥመድ እንዳልያዝ
ጨለማው ተገፎ አስተውዬ ልጓዝ /2/

ጎዳናዬ መዳረሻዬ - ሳላይ አጥርቼ
ፍጻሜዬ ውድቀት እንዳይሆን መንገዱን ስቼ /2/*

አንተ ካላሰፋህ የጠበበ አድማሴን
ከሩቅ ላየው አልችልም ያንን ብድራቴን /2/
ቅርፊቴን አንስተህ ልመልከት ተስፋዬን
ያኔ እበረታለሁ እረሳለሁ ድካሜን /ሃላዬን /2/

የእምነት እይታዬን መንፈሴን መርምረው
ያለማመን ግርዶሽ እንዳያሳውረው /2/
ያንተን ክብር ግርማ አጥርቼ እስካላየሁ
ፍጹም እስኪፈወስ ደጋግመህ ዳስሰው /2/
ጎዳናዬ ....

አይኔን አጥራልኝ ጌታዬ - ክብርህን እንዳይ/ልየው አስተውዬ
ከአይኔ ተነስቶ ቅርፊቴ - ፊትህን/አንተን ማየት ነው መሻቴ /4/*
',0),(NULL,'ክብር ለእግዚአብሔር','Carol2','ክብር /10/
ገነነ የእግዚአብሔር ምህረት
ለክብሩ ተነስቶ ባየሁት /2/*
ውሃውን ሊፈውሰኝ ጨለፋውን ሊሰብረው
ጨለማውን ሊያበራው በሞገስ ሊገለጥ ነው /2/*

ጨንገፋን ከምድራችን የሱስ ሊደመሥስ
ያስማትና የድግምት ስራ ሊያፈራርስ
የረሃብ ጨነፈሩን ሰንሰለት ሊበጥስ
ተነስቷል በቅናቱ ክንዱን ሊያንቀሳቅስ /2/

ክብር /3/ ለእግዚአብሔር
ክብር /2/ በሰማይ በምድር /2/*
ክብር ለእግዚአብሔር /2/
ብቻውን ለሚኖር - ክብር ለእግዚአብሔር
ለአንዱ ለእግዚአብሔር - ክብር ለእግዚአብሔር
ተከብሮ ለሚኖር - ክብር ለእግዚአብሔር

ውሃው ተፈውሶሎት መርገሙ ተቆርጦለት
የሚፈታ ሕዝብ አለ የሱስ ተዋግቶለት
ካለፈው ዘመን ይልቅ በዝቶለት ምህረት
ጥሶ የሚወጣ አለ ከወድያኛው በረት /2/

ክብር /3/ ለእግዚአብሔር ..../2/
',0),(NULL,'አለኝ ብዬ','Carol2','የሰማዩን ደመና ተስፋ ላደርገው
ሸሎቆም ባይሞላ ልቤ አይታወክ
ሆኖልኝ ልማዴ ኑሮ በታምራት
በቂዬ ነው ለኔ ስሙን ብቻ መጥራት

አለኝ ብዬ የምኮራበት
ታምኘበት ያላፈርኩበት
ልቤ ፈቅዶ የተገዛለት
ይኸው የሱስ ምርጫዬ/ቅድሚያዬ ያረኩት /2/*

ይኸ ነው ኢየሱስ የተመካሁበት
ይኸ ነው ኢየሱስ ሁሌ ምኮራበት
ለዚህም ነው ዛሬ የምዘምርለት
ስለዚህ ነው ሁሌ የምገዛለት /2/*

ከሞተ አንበሳ ማር እየወጣልኝ
ታሪክ ተገልብጦ ድንቅ እየሆነልኝ
ቁራ እንኳን ታዘሉኝ መና እየጠገብኩኝ
እስከ ዛሬ አለሁኝ ቸርነቱ በዝቶልኝ
ይኸ ነው .....

ያለፍኩት ፈተና ለኔ መጥፊያ አልሆነኝ
ይልቅ ለከፍታ መወጣጫ ሆነኝ
የሱስ ከባረከ በጥቂቱ አያውቅም
አሰራሩ ግሩም በረከቱ አያልቅም

ብዘምር ብዙ ነው አልዘልቀው
ስላንተ አንደበቴ የሚለው
ብናገር ብናገር አልዘልቀው
  ስላንተ አንደበቴ የሚለው                                         

ይኸ ነው ....
',0),(NULL,'አመሰግንሃለሁ','Elfu1','አመሰግንሃለሁ/4*
ምስጋናዬ አይነስብህ
የልቤን መስዋዕት ልስጥህ
በሰማይ ሰማይ ዙፋንህ
   በክብር ከፍ ይበል ስምህ /2/

በጠራሁህም ቀን ቀርበህ አትፍሪ አልከኝ
ለነፍሴ ተሟግተህ ሕይወቴን ተቤዠህ
እያመሰገንኩኝ በደስታ በዕንባ /2*
ወደ መቅደስህም በዝማሬ ልግባ/2*

እንደ ኃያልና ሆነህ እንደ ጨካኝ
አለህ ከእኔ ጋራ ድል እየሰጠኸኝ
በዘመኔ ሁሉ ከፍ አደርግሃለሁ/2*
አንተ አምላኬ ነህ አመሰግንሃለሁ/2*

ነፍሴንም ከጥፋት ጉድጓድ አዳንካት
ኃጥያቷን ወደኋላ ጣልክላት
በእድሜዬ ሁሉ እዘምራለሁ/2*
አውታር ባለው ዕቃ ቅኔ እቀኛለሁ/2*

ፍጹም በማይረሳ በሕያው ቃል ኪዳን
አሰብከኝ አምልኬ የማልገባውን
ምስጋና በልቤ ተትረፍርፎ ሞልቷል/2*
ለኔ ያደረከው ውለታህም በዝቷል/2*
',0),(NULL,'ተነስ የእግዚአብሔር ክንድ','Elfu1','ተነስ የእግዚአብሔር ክንድ
ጠላት በፊትህ አይጓደድ
       እንደ   ጥንቱ 
እናምናለን ነህና ብርቱ /2/

የኤርትራን ባህር ከፍለህለታል
ለሕዝብህ መከታ ሆነህለታል
ዛሬም ለእኛ ተነስልን /2*
ኃይልህን ለብሰህ ታጠቅልን/2*

በምድረ በዳ ውስጥ መንገድ እንደሆንክ
እስራኤላውያንን በድል የመራህ
እንደ ጥንቱ ዛሬም ምራን/2*
ዘንዶውንም ቀጥቅጥልን/2*

እንደ ጥንቱ ዘመን ዛሬም ተነስ
በጽዮንም ንገስ ኃይልህንም ልበስ
ምህረትህን አብዛውና/2*
ይታይ ክንድህ እንደገና/2*

ታምራትህ ይቀጥል ነህና ብርቱ
በበትርህ ይሰንጠቅ ደግሞ አለቱ
የሕይወት ውሃ ዛሬም ይፍሰስ/2*
ሕዝብህ ይጠጣ ይበለው ደስ/2*
',0),(NULL,'ሁለትም  ሦስትም','Elfu1','ሁለትም ሦስትም በአንድነት ተሰብሰቡ
ለስሜ የሚገባውን ክብሬን ሁሉ አቅርቡ
በመሃካላችሁ እኔው እገኛለሁ
ሕዝቤን እያበዛሁ እባርከዋለሁ
ብሏል ጌታ ኢየሱስ በቃሉ የታመነው

አንድ ልብና ሐሳብ እንደ ሰጠኋችሁ
የዲያቢሎስን እራስ በስሜ ቀጥቅጣችሁ
ድሉ የአንተ ሆኗል ብላችሁ ቅረቡ
እልል እያላችሁ ለስሜ ዘምሩ

እንደ ምድር አሸዋ እንደ ሰማይ ክዋክብት
አበዛችኋለሁ ለአብርሃም የማልኩት
መለያየት ይቅር በሕብረት ተሰብሰቡ
ለስሜ የሚገባውን ክብሬን ሁሉ አቅርቡ

የተስፋዬንም ቃል ለልጅ ልጆቻችሁ
በስሜ ለተጠሩ በሩቅም ላላችሁ
ነፍሳችሁን በቅዱስ ደሜ እያጠባችሁ
ተሰብሰቡ ክብር ለበጉ እያላችሁ

ከጎሳ ከብሔር ከቋንቋ ለይቼ
አንድ ያደርኳችሁ ክብሬን ሁሉ ትቼ
የመስቀሌን ፍቅር እያስተዋላችሁ
ልጆቼ አንድ ሁኑ ልዩነት ትታችሁ
',0),(NULL,'አላማው','Elfu1','በመስቀል ላይ የሱስ ለኔ ሲል ተሰቅሏል
ቁስሌን ሊፈውስ ስለ እኔ ቆስሏል
የማልገባውን ከትቢያ ያነሳው
ውዴ ኢየሱስ ለእኔ አላማው ፍቅር ነው

ታድያ ለዚህ አምላክ ምንን እከፍላለሁ?
እንዲያው በምስጋና እቀኝለታለሁ
እግዚአብሔር ኃይሌ ነው እቀኝለታለሁ
ውዴ ለዘላለም ከፍ አደርገዋለሁ

አላማው/3* ለእኔ ፍቅር ነው

በሚያልፍ ነገር በወርቅና በብር
አይደለም የገዛኝ በምድር ላይ በሚቀር
በከበረ ደሙ ኢየሱስ አጠበኝ
የተጣልኩ ስሆን እርሱ ይቅር አለኝ
ታድያ ለዚህ ….
እኔን ከሞት ማዳን ነው
የኢየሱሴ አላማው
ፍቅር ሆኖ ፍቅርን ለብሶ
ፈውሶኛል ውስጤን ዳሶ
አላማው/3* …..
ከሚያስፈራ ግርማ ከገናናነቱ
ከሰማይ ወረደ ሊሰጠኝ ሕይወቱን
በአባትነት ፍቅሩ በክንፉ ሸሽጎ
ለዚህ አደረሰኝ ሁሉን አዲስ አርጎ
የማልገባውን የሱስ ከወደደኝ
በማያልቀው ፍቅሩ እኔም ዛሬ ልቀኝ

እግዚአብሔር ኃይሌ …. 
',0),(NULL,'እወድሃለሁ','Elfu1','አቤቱ ኢየሱሴ/ጉልበቴ እገዛልሃለሁ
ከእግሮችህ በታች እሰግድልሃለሁ
አቤቱ አምላኬ እገዛልሃለሁ
ከእግሮችህ በታች እሰግድልሃለሁ  2
እወድሃለሁ/4*/ 

አስቀድመህ እኔን ወደኸኛልና - እወድሃለሁ
ከእናቴ ማህፀን መርጠኸኛልና - እወድሃለሁ
አንዳች ጭንጋፍ ስሆን አይተኸኛልና - እወደሃልሁ
ነፍሴን ከአዳኝ ወጥመድ አድነሃልና - እወድሃለሁ

ሸክሜን ከጫንቃዬ ሰባብረህልኛል - እወድሃለሁ
ቀንበሩን ከአንገቴ አውርደህልኛል - እወድሃለሁ
በእውነት ቃል አርነት ወጥቼ ቆሜአለሁ - እወድሃለሁ
ዛሬ በዝማሬ ከፍ አደርግሃለሁ - እወድሃለሁ

ዕጣዬ ባማረ ስፍራ አስቀመጥካት - እወድሃለሁ
በሕያዋን ምድር እግሬን አቁመሃት - እወድሃለሁ
ዛሬ በነፃነት ይኸው እኖራለሁ - እወድሃለሁ
የአንደበቴን ፍሬ ምስጋና ሰዋለሁ - እወድሃለሁ
',0),(NULL,'እግዚአብሔር መሃሪ ይቅር ባይ ነው','Elfu1','አስራ ሁለት አመት ደሟ እጅግ ፈሷል
ሀብቷ ንብረቷ በከንቱ አልቋል
ምህረት ፍለጋ ስትባዝን /2*
አያት ኢየሱስ ያችን ምስኪን/2*

እግዚአብሔር እግዚአብሔር ነው/2*
መሃሪና ሞገስ ያለው
ባለ ብዙ ምህረት ለዘላለም ይቅር ባይ ነው

ከጎስቋላው ጋር አብሮ ይገኛል
ከአመጽ ደጃፍ መንጥቆ ያወጣል
ለመበለቷ ፈጥኖ ይፈርዳል/2*
ለደሃ ቆሞ እርሱን ይመክታል/2*

እግዚአብሔር - እግዚአብሔር ነው /5*
መሃሪ - ይቅር ባይ ነው/5*

ለበደል ይግባኝ ብሎ የሚያሳድድ
ምህረትን ጠልቶ መቅሰፍት የሚወድ
አይደለም ከቶ እግዚአብሔር/2*
ይቅር የሚል ነው ሕዝቡን የሚወድ/2*

እግዚአብሔር - እግዚአብሔር ነው /5* …
እግዚአብሔር እግዚአብሔር ነው/2*….

እርሱ ይሰብራል እርሱ ይጠግናል
እርሱ ይገድላል ደግሞም ያድናል
አይኖቹ በምድር ዙሪያ ያያሉ/2*
እጆቹ ለምህረት ይዘረጋሉ/2*

እግዚአብሔር - እግዚአብሔር ነው /5* …
',0),(NULL,'ጠላት ጉድጓድ ቆፍሮ ሲጣራ','Elfu1','ጠላት ጉድጓድ ቆፍሮ ሲጣራ
አበቃላት ተብሎ ሲወራ
እግዚአብሔር ግን ወዶ ተቀበለኝ/2*
ኃጥያቴ በባህር ውስጥ ጥሎ አዲስ ሰው አረገኝ/2*

ጠላቴ ሲፎክር አበቃላት ብሎ
አምልኬ አወጣኝ ማልችለውን ችሎ
ቅጥሩንም ዘለልኩኝ በአምላኬ በርትቼ
በአደባባዩ ላይ ዛሬ ቆሙ እግሮቼ

ነፍሴ ከአዳኙ ወጥመድ አመለጠች
ጨለማው ተገፎ ብርሃንን አየች
በብዙ ምስጋና ተሞልቷል ሕይወቴ
ተሰበረ ዛሬ ቀንበሩ ከአንገቴ

ማን አለ እንደ ኢየሱስ በሰማይ በምድር
ኃጢያትን በደልን ሁሉ የሚል ይቅር
ዛሬ አዲስ ፍጡር አዲስ ሰው ሆኛለሁ
በደሙ ቃል ኪዳን ተጠግቼዋለሁ
',0),(NULL,'በክርስቶስ አንድ ሆነናል','Elfu1','በክርስቶስ አንድ ሆነናል
በኢየሱስ ስም ተጠምቀናል
በፈሰሰልን ደም ተዋጅተናል
     እግዚአብሔር ይመስገን ሰብስቦናል /2/

ባሪያ ጨዋ ሴትም ወይም ወንድም
የግሪክ ሰው የለም የአይሁድም
አንድ ሆነናል በጌታ በየሱስ ስም
ማንም ከቶ ቢመጣ አይለየንም

በጎልጎታ የፈሰሰው ክቡር ደሙ
አንድ አርጎናል ዛሬ ታላቅ ስሙ
በሕብረት ሆነንለት እንዘምራለን
የአምላካችንን ማዳን እናወራለን

የአንድ አባት ልጆች በእርሱ ሆነናል
ከመንፈስ ቅዱስ ምንጭ ጠጥተናል
የፍቅር አምላክ ነው የለበስነው
ማንም ከቶ ሊለየን አይቻለው

በመንፈስ አንድነት ተያይዘን
ለአምላካችን ምስጋናን እናቀርባለን
በጽዮን ጉዞአችን በሕብረት ሆነን
የበጉንም ክብር እናያለን
',0),(NULL,'አልሞትም በሕይወት እኖራለሁ','Elfu1','አልሞትም በሕይወት እኖራለሁ/3
የጌታዬ ሥራ አወራለሁ
አልሞትም በሕይወት እኖራለሁ/3
የየሱሴን ወንጌል አወራለሁ

ለባለውለታዬ ለእርሱ እገዛለሁ/2*
ያደረገልኝን ሁሉ አወራለሁ/2*
ጠላቴ ሆይ እፈር ብወድቅ እነሳለሁ/2*
በአሸናፊው አምላክ ሁሉን እችላላሁ/2*

ወጥመዱ ተሰብሮ እኔም አምልጫለሁ/2*
የዘላለም ሕይወት በአምላኬ አግንቻለሁ/2*
አልሞትም በሕይወት በቤቱ እኖራለሁ/2*
ያዳነኝን አምላክ አገለግላለሁ አመልካለሁ/2*

አልተውህም ብሎ ቃልም ገብቶልኛል/2*
የረገጥኩትንም ምድር ያወርሰኛል/2*
እናገራለሁኝ ቸርነት ምህረቱ/2*
አያለሁኝ ብዙ ነፍሳቶች ሲፈቱ/2*

የስሙንም ሥልጣን ላውራው ማዳኑን/2*
ጠርቶኛል አምላኬ ልናገር እውነቱን/2*
የጠላቴን እራስ እየረጋገጥኩኝ እየረገጥኩኝ
ብዙዎች ሲድኑ በአይኔ አያለሁኝ/2*
',0),(NULL,'ባለ ውለታዬ ነው','Elfu1','ነፍሴን ከአዳኝ ወጥመድ መንጥቆ ያወጣኝ
የዘላለም ሕይወት ከነትርፉ የሰጠኝ
የውርደት ማቄንም በኃይሉ የቀደደው
ባለውለታዬ ኢየሱስ ብቻ ነው

ባለ ውለታዬ ነው የሱስ/2*
ባለ ውለታዬ ይህን ያደረገው/2*

ከሰዶም ከተማ በእጆቹ ጎትቶ
ከጠፊዋ ምድር አወጣኝም መርቶ
ፍቅርና ሰላሙን በሕይወቴ አብዝቷል
ባለውለታዬ የሱስ ብቻ ሆኗል

ግንበኞች የናቁት የማዕዘን እራስ
ባለ ውለታዬ ሆነልኝ ኢየሱስ
በእውነት አምድ ላይ አጽንቶ አቁሞኛል
የመዳንን መንገድ ለእኔ አሳይቶኛል

ጨለማ ሕይወቴ በብርሃኑ አብርቶ
ድንጋዩንም ልቤ ከውስጤ አውጥቶ
የሱስ የመንፈሱ ማደሪያ አድርጎኛል
ውለታውን ለማውራት ቃላቶች ያጥሩኛል
',0),(NULL,'እናመሰግንሃለን','Elfu2','እናመሰግንሃለን/ 4*
ድምጽህ እንደ ብዙ ውኖች ያስፈራል
ፊትህ እንደ ጸሃይ ደምቆ ያበራል
አቤት ኢየሱስ ለቅድስናህ እንሰግዳለን ለልዕልናህ
        ኃይልና ጥበብ ባለጸግነት

ምስጋና ክብር ብርታት በረከት
በሰማይ  በምድር ከምድርም በታች

ፍጥረታት ሁሉ እንዲህ ይበሉ

ሃሌሉያ/2* ሁሉን የሚገዛ ጌታ

አምላካችን ነግሷልና  2*
        የቅድስናህ ውበት ልዩ ነው
ክብርህ ሞገስህ እጅግ ድንቅ ነው

አዕላፍ ጊዜ አዕላፍ መላዕክት
ይቀድሱሃል በቀን በሌሊት
ክብርህን እያየን እናመልክሃለን

ክብርህን እያየን ገና እንዘምራለን

ክብርህን እያየን ከምድር ዳርቻ

ክብርህን እያየን ምስጋናን እንሰጣለን
        ሁሉን ፈጥረሃል በፈቃድህ

ክብር ውዳሴ ይሁንልህ
አክሊላቸውን በፊትህ አኑረው

ሽማግሌዎች ሰገዱለት ወድቀው

በሰማያት የማይቋረጥ ቅዳሴ

ይገባዋል ለልዑል ብዙ ውዳሴ

አምላካችን ትልቁን  ሃይል ስለ ያዝክ

ስለ ነገሰህ እናመሰግንሃለን

እናመሰግንሃለን /4/

ሃሌሉያ /2/ ሁሉን የሚገዛ ጌታ

አምላካችን ነግሷልና  /2/
',0),(NULL,'በቃ ምሬሻለሁ በቃ አድኜሻለው','Elfu2','ድንጋይ ለመወርወር የተሰበሰቡ

ፍጹም እንዳላመልጥ ዙሪያዬን የከበቡ
ዞር ዞር ብዬ ብመለከታቸው

ትተውኝ ሄደዋል ለካ የሱስ አንተን አይተው


       በቃ ምሬሻለው በቃ አድኜሻለው /2*

በሰላም ሂጂ /2*

አልከኝ አልከኝ ኢየሱስ ተመስገን

አልከኝ አልከኝ ወዳጄ ተመስገን

        በእንባ በጸጉሬ እግርህን ማበሴ
ውለታህ ቢበዛ ብትባርክህ ነፍሴ

ተይ አንቺ ኃጢያአተኛ አትንኪው ጻድቁን
ሰዎች ቢሉኝ እንኳ አውቃለሁ እንዳዳንከኝ

በቃ ምሬሻለው….

         የልጆችህ ትራፊንም ተመኘሁ

የሱስ ካንተ ሌላ ሚረዳኝ ስላጣሁ
ባለጸጋ አምላክ ምህረተህ በዛና

ማርከኝ ያለፈውን ሁሉ ረሳህና


በቃ ምሬሻለው … 

    በደስታ ወጣሁኝ በሰላም ተሸኘሁኝ /2* 

ነጻ ወጣሁ ተፈታሁኝ ነጻ ወጣሁ
ነጻ ወጣሁ የሱስ ባንተ ነጻ ወጣሁ/ 2*  
',0),(NULL,'ስለ አንተ ሲወራ ሰምቼ ነበረ','Elfu2','ስለ አንተ ሲወራ ሰምቼ ነበረ / 2*
ስለ አንተ ሲነገር ሰምቼ ነበረ  2*
ግን ከሰማሁትም ካየሁትም በለጥክ 
የሚመስልህ የለም ልዩ ነህ የኔ አምላክ 2* 
ጨርቅህን ስነካ ስዳስስህ 
የሚያስገርም ሃይል አለህ 
ኢየሱስ ብዬ ስምህ ስጠራ 
ፈጥኖ ተናደ ብርቱ ተራራ / 2*

          ኦ ኦ ምታስገርመኝ  ኦ ኦ ምታስደንቀኝ 

ይዤ ብመጣ የኔን ስጦታ 
አይመጥንህም  ለካ የኔ ጌታ 

ልቤንም ቅዱስ ህያው መስዋእትህ 
አድርጌ ላቅርብ ልስገድ በፊትህ 
  ጨርቅህን ስነካ ስዳስስህ …

          ኦ ኦ ጨርቅህን  ኦ ኦ በእምነት ስነካ

ታላቁ ሃይል ካንተ ሲወጣ 
መከራ ቆመ ዳግም ላይመጣ 

አላፍርም ዛሬ ቀና ብያለሁ 
ታምራትህም እናገራለሁ 
      ጨርቅህን ስነካ ስዳስስህ …


       ኦ ኦ ታማኝነትህ ኦ ኦ የለበስክ 
ከወንድም ይልቅ የምትጠጋ 

ቃልህን ልትፈጽም የምትተጋ 
ይሁን ስትለው የሚሆንልህ 

ንፋስ ባህሩ ሚታዘዝልህ 
    ጨርቅህን ስነካ ስዳስስህ …
',0),(NULL,'ቀድሞ ወገን አልነበርኩም','Elfu2','ቀድሞ ወገን አልነበርኩም ወገን አደረከኝ
ከማይጠፋ ዘር ዳግመኛ በእውነት ቃል ወለድከኝ
ካሰብከኝ እኔስ ምን እላለሁ
ለክብርህ ዘምርልሃለሁ
ካየኸኝ እኔስ  ምን እላለሁ
ለክብርህ እቀኝልሃለሁ

ልጅህ ተባልኩ አቤት የአንተ ሥራ
ቀላቀልከኝ ከቅዱሳን ጋራ
ተዋበልኝ አማረ እጣዬ
ብቀኝልህ ያንስሃል ጌታዬ

ሌባ ከቶ በማይሰርቀው
ብልም ፍጹም በማይበላው
ስሜን ፃፍከው በሰማይ መዝገብ ላይ
ይህን አረክ የለብህም ከልካይ

ይቅር አልከኝ ያን የውርስ ኃጥያት
አገኘሁኝ በስምህ ስርየት
ላይነሳ ከሳሼ ተጣለ
ያላረከው አምላኬ ምን አለ

ማያረጅ ልብስ የሱስን ለበስኩኝ
የአንተ ወገን የአንተ ህዝብ ተባለኩኝ
አዳንከኝ ብርሃን አብርተህ
ከትውልድ ከዘሬ ለይተህ
',0),(NULL,'የእኔ አምላክማ የሚሰማ','Elfu2','የእኔ አምላክማ የሚሰማ /2* የእኔ ወዳጅማ የሚሰማ/2*
የእኔ አባትማ የሚሰማ/2* የእኔ ኢየሱስማ የሚሰማ/2*
አይነቃነቅ ዙፋኑ ለትውልድ ሁሉ ማዳኑ
ትላንትም ዛሬም ዘላለም ብርታቱ ህያው ነው አይዝልም

መስጠት የማያውቁ ግን የሚቀበሉ
የአህዛብ አማልክት እጅግ ብዙ አሉ
የችግረኛውን ጩኸት መች ሰምተው
በተቀመጡበት አሉ ተኝተው
  አይን ሲያበጁለት አላይም እያለ
  ጆሮ ሲያበጁለት አልሰማም እያለ
  እንኳንስ ሊሰማ እንኳን ሊያደርገው
  ዳጎን በግንባሩ ወድቆ አረፈው 

በእጁ የያዘ የሞት የሲኦል ቁልፍ
ጸንቶ ለዘላለም የሚኖር የማያልፍ
ዙፋናት ሥልጣናት የሚገዙለት
የእኔ አምላክማ የአማልክት አምላክ
አይኖቹ ያያሉ በምድር ዙሪያ ሁሉ
ብዙዎችን ያድናል ሕያው በሆነው ቃሉ
ይሄ ነው እግዚአብሔር ይሄ ነው የኔ ተስፋ
ከቶ የማይተኛ የማያንቀላፋ

በምድር ሁሉ ላይ ኃያላን ነን ያሉ
ሞት አሸንፋቸው ዛሬማ የት አሉ
መታሰቢያቸውን ከምድር ያጠፋ
የሱስ ብቻ አምላክ ነው የቅዱሳን ተስፋ
ሰማያት በአምልኮ የሚደምቅለት
ፍጥረታት በሙሉ የሚገዙለት
የሚሰገድለት በእውነት በመንፈስ
ለሚታመኑበት ፈጥኖ የሚደርስ
',0),(NULL,'ናፈቅከኝ','Elfu2','አብረን በልተናል ከአንድ ማዕድ ከአንድ ማጀት
ከሰማይ አምላክ አብረን ተካፍለን ሄደን በእምነት
ተራራውና አቀበቱንም ቁልቁለት
አላደከመንም ነበረ እኮ ያኔ ጥንት
ዛሬ ተለየኝ (ተለየኸኝ) ምነው ወንድሜ
ናፍቆቴ በዛ በውን በህልሜ
የመለከቱ ቀን ሲቃረብ
ናፈቀህ አንተን የእኔ ልብ

ናፈቅከኝ ወንድሜ ናፈቅከኝ/4/

እንደ ማርያም ከእየሱስ እግር ሥር ሆነሽ
ናፈቀኝ ዛሬ የልብሽ ፍቅር ቅንነትሽ
ዛሬ ባላይሽ ከአይኖቼ ብትርቂምም
በአንቺ ልመና እኔ ግን ዛሬ አለሁኝ
ፀሎትና ልመናሽ ምኞት ትጋትሽ
ይናፍቀኛል ከሩቅ ሳስብሽ
ነይ እናሸብሽብ በመሰዊያው
የእምነት ቃልሽን ዛሬም ልስማው
ናፈቅሽኝ እህቴ ናፈቅሽኝ/4/

የዘመርክበት የሰበክበት መሰዊያው
ያ በእምነት ለቅሶ ብዙ ነፍሳትን ያፈራው
ስደት መከራን ሳትፈራ እረሀብ እርዛትን
በመልካም ገድል አስብ ያን ዘመን ያለፍከውን
ሙሉ ደሞዝህን ልትቀበል
ፍጠን ወንድሜ ና ቶሎ በል
ለስሙ ያረከውን ቅንነትህ በእምነት
የሱስ አይረሳም ና እባክህ
ናፈቅከኝ ወንድሜ ናፈቅከኝ/4/
',0),(NULL,'ክብርህን አሳየኝ ','Elfu2','ክብርህ/3/ ክብርህን አሳየኝ
ክብርህን አሳየኝ ኢየሱስ
ክብርህን አሳየኝ
ክብርህን አሳየኝ ጌታዬ
ክብርህን አሳየኝ/2/

ያከበሩህን አከብራለሁ
የናቁህንም ትንቃለህ
የሚፈራህ ጸድቆ ይኖራል
እየሱስ በአንተ ጥላ ውስጥ ያድራል
ክብርህ . . .

ነብዩ ኢሳያስ ክብርህን አይቶ
ጠፋሁኝ ወዮ እንዳለ ፈርቶ
ሞገስ ያለህን ቅዱስ ገናና
እኔም ላምልክህ ክብርህን ልይና
ክብርህ . . .

እጄን በአፌ ላይ የሚያስጭነኝ
ራሴንም እንድንቅ የሚያደርገኝ
ትልቅነትህ ክብርህ ግርማህ ነው
ሰማይ ይከፈት ክብርህን ልየው
ክብርህ . . .
',0),(NULL,'አላፍርም አንተን ይዤ አላፍርም','Elfu2','አላፍርም አንተን ይዤ አላፍርም
አልፈራም አንተን ይዤ አልፈራም  2*
የኔ የሱስ ብርቱ መጠጊያ
በመከራ ቀን መሸሸጊያ  2*
ነፍሴ እንደ ወፍ ከአዳኝ ወጥመድ
አመለጠች ወደ አንተ ስትሄድ 2*

አምላክ አለኝ እኔ የምኮራብህ
ሰይፌ ነህ መዝዤ የምዋጋብህ
ከስም ሁሉ በላይ ስም አለህ የሱሴ
ትባርክህለች የዳነችው ነፍሴ

እጅጉ ሲፎክር ከሩቁ ሲያስፈራ
የባለዕዳዎቼ ዛቻና ፉከራ
በዘይት ተሞላ ባዶ ማድጋዬ
ዛሬ ለኔ ተርፎአል ተከፍሎ እዳዬ

እንኳን ዳንሁኝ በስምህ ስልጣን
የሱስ ታምኜብህ እረ ምን ልሆን
ስምህ ምርኩዜ ነው ምደገፍበት
ቃልህ ጋሻዬ ነው የማመልጥበት
',0),(NULL,'ልጁ ነኝ እራሴን አልንቅም','Elfu2','ልጁ ነኝ እራሴን አልንቅም/2*
አምላኬ ወዶኛል በፍቅሩ ዘላለም
ልጁ ነኝ ጠላቴ አትናቀኝ /2/
አይንህ እያየ ነው ነፍሱን የሰጠኝ

በምወረውረው በትንሹ ጠጠር
ጎልያድ የሚወድቅ መቼ መስሎት ነበር
ለጣቶቼ ሰልፍን አምላኬ አስተማረ
ዳግም ላይነሳ ጎልያድ ተዘረረ

በሰላም ወንጌል ላይ ተጫምቻለሁ
የመንፈሱን ሰይፍ በእጄ ይዣለሁ
ቃሉ እቃ ጦሬ የምዋጋበት
ጨለማውን አለም ማሸንፍበት

ደካማውን ብርቱ ብሎ የሚጠራ
የሥጋ ለባሽ አምላክ ግርማው የሚያስፈራ
የሱስ ነው አምላኬ እኔን የጠራኝ
የረገጥኩትንም ሁሉ ሊያወርሰኝ
',0),(NULL,'እንኳን መጣህ','Elfu2','ኃጢያቴ ተከደነ
በሰማይ ላይ እንዳለ ጉም በነነ
ይቅር አልከኝ በደሌን
ህይወት ልትሆን ልትበዛልኝ
መጣህ ወደ እኔ  /2/

እንኳን መጣህ ወደ እኔ እንኳን መጣህ
እንኳን መጣህ እየሱስ እንኳን መጣህ
እንኳን መጣህ ጌታዬ እንኳን መጣህ
እንኳን መጣህ ወዳጄ እንኳን መጣህ
ወደ እኔ ባትመጣማ
ማን ሊያበራው ያን ጨለማ
ካንተ ሌላ  /2/

ልትገባ አይገባኝም ከእቤቴ ጣራ
ቃል ብቻ ተናገር ይናዳል ተራራ
ቤቴ ብቻ አይደለም በልቤ ዙፋን ላይ
ገብተሃል አምላኬ ልትሆን የበላይ

ለሀጢያቴ ቅጣት በድንጋይ መወገር
ታሪኬ ተዘግቶ መዋል ከመቃብር
ጠላቴ ማ ሲለኝ አለቀልሽ በቃ
ከሞት ቀድመህ መጣህ የኔ ዋስ ጠበቃ

እንቆቅልሽ ፈቺ የሱስ የእኔ አባት
የተዘጋ በርም ችለህ የምትከፍት
ሌሊቱ ነጋልኝ ወደኔ ስትመጣ
በፊትህ የሚቆም ማነው የእኔ ጌታ
',0),(NULL,'አሜን ማራናታ ቶሎ ና','Elfu2','ጽዮንን በውዴታህ አሰማምራትና
የሱስ ምርኳችንን ፈጥነህ መልስና
ከእንግድነት ኑሮ ከምድር ውጣ ውረድ
  መርጠናል ኢየሱስ ወዳንተ ለመሔድ  /2/

ና ና………አሜን ማራናታ ቶሎ ና
ና ና………አሜን ኢየሱስ ቶሎ ና
ና ና……….አሜን የኔ ጌታ ቶሎና
አሜን መድሃኒቴ ተሎ ና

ያበቃልን ጊዜ እንባችን መፍሰሱ
በምድር ውጣ ውረድ ዘወትር ማልቀሱ
አይናችን ኢየሱስ ባንተ ይታበሳል
በሰማይ ቤታችን ይህ ሁሉ ያበቃል /2/

የላሉ ጉልበቶች ይጽኑ ባንተ የሱስ
ፈሪ ልብም ያለው ወዳንተ ይገስግስ
ወደ ሰባው ግብዣ ወደ ዕረፍቱ ቤት
ለሜሄድ ጓጉተናል ፊትህን ለማየት

የኃያልን ጉልበት ይንበርከክልህ
ነገስታት ክብራቸውን ላንተ ይጣሉልህ
የሚድኑትንም በኛ ላይ ጨምረህ
ኢየሱስ ቶሎና በክብርህ ታጅበህ
',0),(NULL,'ሰማያት በእልልታ የሚደምቁለት','Elfu2','ሰማያት በእልልታ የሚደምቁለት
ፍጥረታት በሙሉ የሚገዙለት
ተፈርቶ የሚኖር በክብር ምስጋና
ኢየሱስ ብቻ ነው ሁሌም ባለ ዝና

በሰማይ ገናና ኦሆሆ ገናና/2*
በምድርም ገናና ኦሆሆ ገናና/2*
ኢየሱስ እንዳንተ ኦሆሆ ገናና/2*
ማንም የለምና ኦሆሆ ገናና/2*

ዘመን አይሽረው ወይ ዘመነኞች
የተናገርከው የእውነት ቃሎች
ግዙፉ ሰማይ ግዙፉ ምድር
ሲያልፉ በቃልህ ጸንተህ የምትኖህ 
ኦሆሆ ኢየሱስ አንተ ነህ

ከአንተ በፊት አምላክ የለም
ከአንተም በኋላ ከቶ አይሆንም
ሰማያትንም የዘረጋህ
ምድርን በቃልህ ደግሞ ያጸናህ
ኦሆሆ ኢየሱስ አንተ ነህ

ከማንም ጋራ ማትወዳደር
በማንም ፍጹም የማትመሰል
ዙፋንህ ታላቅ የዘላለም
እንዳንተ ያለ ማንም የለም
ኦሆሆ ለዘላለም

ፍጥረት በሙሉ ይሰግዳሉ/2*
የሱስ ገናና ነህ እያሉ/2*  2
በሰማይ ገናና በምድር ገናና /2*
ኢየሱስ እንደአንተ ማንም የለምና/2*
',0),(NULL,'ኢየሱስ የእኔ ነው','Jerry1','ኢየሱስ የኔ ነው የኔ ነው/2*
አምላኬ የኔ ነው የግሌ ነው /2/*
ስሙ እያየልኝ ለምን እፈራለሁ
በጠላቴ ላይ እፎክራለሁ
ስሙ እያየልኝ ለምን እፈራለሁ
ባስጨነቀኝ ላይ እረማመዳለሁ /2/*
እረማመዳለሁ ስሙን ይዤ/4*

ስሙ ኃይል አለው/2*
ስሙ ያስመካል/2*
ስሙ ታላቅ ነው/2*
    ስሙ የጸና የማይፈርስ ግንብ ነው/2* /2/*

ክብር የሚገባው ከስሞች ሁሉ በላይ
ሚሰገድለት በምድር ሆነ በሰማይ
ኃይላት ስልጣናትም ሚንበረከኩለት
የኢየሱስ ስም ነው ሁሉ ሚገዛለት /2/
ስሙ እያየልኝ…...

ታላቁን ስም በአፌ አላረክሰውም
ለክብሬ ብዬ የአምላኬን ክብር አልጥልም
አጋንንትን ፈጥኖ ሚያወጣ ኃይል ያለው
እኔን ተቤዥቷል ሁሌ እጠራዋለሁ /2/
ስሙ እያየልኝ…...

ሽባን ያዘለለ እውሩንም ያበራ
ደዌን የፈወሰ ሙታንንም ያስነሳ
በእምነት ሲጠራ ታምር የሚሰራ
     ዛሬም ትምክህቴ ነው አለ ከእኔ ጋራ /2/
ኢየሱስ…
ስሙ እያየልኝ…...
እረማመዳለሁ…..
',0),(NULL,'ሁሉን ወራሽ ባደረገው','Jerry1','ሁሉን ወራሽ ባደረገው
ደግሞም አለማትን በፈጠረበት በልጁ
አለማትን በፈጠረበት በቃሉ
እግዚአብሔር/ኢየሱስ/ እኛን ታረቀን/4

ቀድሞ ወገን ያልነበርነውን
ዛሬ በእርሱ እኛን ተጠጋን
ከባርነት ቀንበር ተላቀን
በቤቱ የመኖርን  ሥልጣን አገኘን/2
እንዴት ድንቅ ነው ኢየሱስ እንዴት
እንዴት ልዩ ነው ኢየሱስ እንዴት
የማንችለውን ችሎ አሳይቶናል
የማናልፈውንም እርሱ አሳልፎናል/2*

ጥንት ጀምሮ በቃሉ የሠራ
ሰማያትን ሁሉንም ያጸና
በአዲስ ኪዳን ቃሉን ሥጋ አድርጎ
በደሙ ዋጀን ክብሩን ጥሎ ወርዶ /2/
በእኛም የማስታረቅን ቃል ሲያኖር/2*
አለማትን በፈጠረበት በልጁ
አለማትን በፈጠረበት በቃሉ
እግዚአብሔር/ኢየሱስ/ እኛን ታረቀን /2/                                    እንዴት ድንቅ…..
',0),(NULL,'እስቲ ላውራው','Jerry1','እስቲ ላውራው የቀራንዮ ውለታህን
እስቲ ላውራው ያን መልካምነትህን
እስቲ ላውራው አዳኝነትህን
እስቲ ላውራው ስለ እኔ መሞትህን /2/

ሳልወድህ ወደድከኝ
ሳልመርጥህ መረጥከኝ
ይህም አነሰ ብለህ
ሰጠኸኝ ሕይወትህን /2/*

ስለዚህ ለአንተ ምስጋና እልልታ
የእጅ መንሻዬን መስዋእቴን እንካ
ለአንተ ምሰጥህ በቂ ባይሆንም ብቻ ክበርልኝ /2/*

ሲሰድቡህ ሲመቱህ ሲገርፉህ ሲሰቅሉህ
ታግሰህ እንድታልፋቸው ያደረገ ፍቅር ነው /2/*
ኢየሱስ በእውነት አንተ ልዩ ነህ
የሚመስልህ አቻ የሌለህ
ፍቅርህ እጅግ ውስጤን ማርኮኛል
የሱስ ገዝተኸኛል /2/*

እስቲ ….
',0),(NULL,'ገና ከሩቅ','Jerry1','ገና ከሩቅ ዝናውን ሰምቼ (ስራውን አይቼ)/2
አመለኩት/አደነኩት ጌታን አመለኩት(ኢየሱስን አደነኩት)/2
ስራው ያስገርማል ስራው ስራው ያስደንቃል ስራው/2
ከሰማሁት በላይ አየሁ በአይኖቼ/4
ድንቅ ነው ብያለሁ የሱስን
ልዩ ነው ብያለሁ የሱስን/2*
የሚመስለው የሌለው እርሱ ብቻውን
የሚመስለው የሌለው ኢየሱስ ብቻውን/2

ከሰማሁት በላይ መጥቼ አየሁ
ስራውን በአይኔ አይቼ ተገረምኩ
እሱ ኃያል ታላቅ ገናና ነውና
ይገባዋል ሊልቅ ዛሬም እንደገና/2
ይገባዋል ሊልቅ/5(ሊመለክ/4)
በእውነት በመንፈስ
ሲያመልኩት ይወዳል ኢየሱስ
ሲያከብሩት ይወዳል ኢየሱስ
መንፈሱንም ያወርዳል
ሰላሙንም ያበዛል /2/*

ስለ እርሱ ስሰማ የነበረውን
አሁንም በአይኔ አየሁ ታላላቅ ተአምር
እንደሱ ያለ ወዳጅ እኔ ስላላየሁ
እያከበርኩት ንጉሴ እለዋለሁ /2/
ይገባዋል ሊከብር/5 (ሊመለክ)/4
በእውነት በመንፈስ

ሲያመልኩት ይወዳል ኢየሱስ …

ገና ከሩቅ ዝናውን …..
',0),(NULL,'ኦ ኢየሱስ ስራኝና አቁመኝ','Jerry1','ኦ የሱስ ስራኝና አቁመኝ
ኦ! ጌታዬ ስራኝና ደግፈኝ /2/
ያልተሰራው አካሌን ሥራና
በመንፈስህ በቃልህ ለውጠኝና
ልቁም ኢየሱስ በንጹህ ልብ እንደገና
ሕይወቴ ይታደስና

ፈጣሪዬ ነህ ፈቅጃለሁ
እኔነቴን እንደወደድክ አድርገው
ኢየሱሴ ተጠቀምብኝ
ያለ አንተማ ማን ሊሆነኝ ለእኔ መታመኛ
ክበር ኢየሱስ በእኔ እንደገና

እኔን ኢየሱሴ ሥራኝና/
እኔን ኢየሱሴ አስብና/
እኔን ኢየሱሴ ቀይርና/
እኔን ኢየሱሴ ቀድስና/
ለውጥ አቁመኝ እንደገና
ስራኝ ፈቅጃለሁ ይኸው ሕይወቴን እሰጥሃለሁ
አንተ በእኔ ክበርና ተጠቀም እንደገና/
አንተ ለእኔ አባቴ ነህና ክበር በእኔ እንደገና

ወደ አንተ ፊት ቀርቤያለሁ
እንድትቀይር የእኔን ማንነት
እስከ ሰማይ እንድትሸከመኝ
መድህኔ አትልቀቀኝ ያዘኝ በእጆችህ
ከፊትህም ኢየሱስ አትጣለኝ

እኔን ኢየሱሴ ሥራኝና ….
',0),(NULL,'ስንት ነገሬን ሸፈንክልኝ ኢየሱስ','Jerry1','ስንት ነገሬን ሸፈንክልኝ ኢየሱስ
ስንት ነገሬን ለወጥክልኝ ኢየሱስ /2/*
አንተ/ የሱስ የእኔ ነህ እኔም የአንተ ሆኛለሁ
በፍቅርህ ገመድ ታስሬአለሁ /2/*

ከአንተ የሚለየኝ አንድም ነገር የለም
አገዛዝህ ተመችቶኛል ግዛኝ አንተ ለዘለዓለም
ሚስጥሬን የምትጠብቅ ጓዳዬን ሸፋኝ
የልብ ወዳጅ ሚሆነኝን ማንንም አላገኝም

አገዛዝህ ተመችቶኛል
ፍቅርህ ውስጤን ማርኮኛል
ኢየሱሴ እባክህ አትራቅ
ነህና የነፍሴ ወዳጅ /2/*

ማንም ላይለየኝ በአንተ ፍቅር ተይዤአለሁ
እንዲሁ አልመጣሁም እኔ በደምህ ተዋጅቼ ነው
ለሰራህልኝ ሥራ ላረክልኝ ነገር
የምሰጥህ ባይኖርም አንተ ብቻ ክበርልኝ
ውጤት ነኝ እኔ የደምህ ውጤት/2/
አንተም አትለቀኝ እኔም አልለቅህ
ተያይዘናል በፍቅርህ ገመድ /2/*

አንተ/ የሱስ የእኔ ነህ …
አገዛዝህ ተመችቶኛል ….
ውጤት ነኝ …..
',0),(NULL,'ቅድስናህንም ጠብቅ','Jerry1','ኢየሱስ ሳይመጣ ምህረትን ፈልግ
በሩ ሳይዘጋ ምህረትን ፈልግ
አላውቅህም ሳይልህ ምህረትን ፈልግ
መንግስቱን ለመውረስ ምህረትን ፈልግ

ቅድስናህንም ጠብቅ
መብራትህም ይብራ
 ዘይትህም ይሙላ /2/*

መምጫው በተቃረበ ሰዓት
ትንቢቶች ተፈጽመው ሳሉ
አንተ ለምን ችላ ትላለህ
የየሱስን ምጽአት እንደ ቀላል እንዴት ታያለህ?
በኋላ ዋይታ ለቅሶ እንዳይሆን
ማብቂያው ትካዜ ማዘን እንዳይሆን /2/*

ኢየሱስ ለመውስድ ሚመጣው
ተግተው የተዘጋጅቱን
ዘይታቸው በመቅረዝ ሞልተው
መብራታቸውን እያበሩ ሚጠብቁትን
እነሱ ሲሄዱ በምድር ዋይታ
ሃዘን መረበሽ መጨነቅ ብቻ /2/*

አንድ ጊዜ በር ከተዘጋ
ፈጽሞ አይከፈትምና
ይህንን ወንድም ጠንቅቀህ እወቅ
ምጽአቱን እንዲሁ እንደቀላል አትመልከት
ስትወጣ ስትገባ አስብ መምጫው
ንሰሃ እየገባህ ኑር በቤቱ  /2/

ታጠብ በኢየሱስ ደም
ታጠብ በአምላክህ ደም
ሳትደርስ መጨረሻ
    ሳትሆን የጠላት መጫወቻ /2/
',0),(NULL,'ከምንም በላይ መዳኔ ይበልጣል','Jerry1','መዳኔ ለኔ ድንቅ ነው
ከምንም ጋር የማላወዳድረው
መዳኔ ለኔ ልዩ ነው
ከምንም ጋር የማላስተካክለው /2/*

ከምንም በላይ መዳኔ ይበልጣል/4/ 2

በብር በወርቅ የማይገመት
ትልቅ ሃብት ነው ሰላም በረከት
ክብሬና ጌጤ የምመካበት
ለዘላለም የማላፍርበት /2/*

ባለሁበት መዳኔን እጠብቃለሁ
 ሃይማኖቴን አጥብቄ እይዛለሁ /2/*
ከምንም በላይ …..

ብዙ ጠቢባን እያሉ በምድር
ባይገባኝም ይህ ታላቅ ክብር
መርጦኝ ኢየሱስ ከለየኝ ለርስቱ
እኖራለሁ ጸንቼ በቤቱ /2/*

መዳኔ ለእኔ ድንቅ ነው …
 
እንደቀላል እንደተራ ነገር
ልቆጥረው ፍጹም አይገባኝም
ከምንም በላይ እጅግ አብልጬ
 እጠብቃለሁ በልቤ አድርጌ /2/*

ባለሁበት መዳኔን ….
ከምንም በላይ …..
',0),(NULL,'እኔ ማን ነኝ','Jerry1','ማን ነኝ እኔ እኮ ማን ነኝ
ተራስ ለኔ የተሰጠኝ
የሰውን ኃጥያት ላወራ
ምን ጽድቅ አለኝ የሚያኮራ
ከሁሉ የምበልጥ ኃጥያተኛ
መሆኔን ያን አውቃለሁ
በኢየሱስ ፊት የሚያቆመኝ
ምህረቱ ነው ምህረቱ ነው
እኔ ማን ነኝ የሰውን ኃጥያት ልናገር
ይህ እንዲህ ነው እንዲያ ነው ልል /2/*
ራሴን በፍርድ ወንበር ለማስቀመጥ
ማነኝና የትኛውስ ጽድቄ
ጽድቅ የለኝም ጽድቄ የመርገም ጨርቅ ነው
በፊቱ ሚያቆመኝ ምህረቱ ነው /2/*

ምህረቱ በፊቱ የሚያቆመኝ
ምህረቱ ልጁ ያደረገኝ
ምህረቱ ከትቢያ ያስነሳኝ
ምህረቱ እዚህ ያደረሰኝ

ራሴን እንዳጸድቅ ቆጥሬ
ስለ ሰው ሳወራ ከርሜ
የእኔንስ ክፋት ማን አውቆ
ሸሽጌ በራሴ ጎጆ
ስለሰው አብዝቼ ሳወራ
የራሴን ሳልገልጥ የሌላን
የፍርድ ወንበር ላይ ቁጭ ብዬ
ስበይን ሳለሁ ታብዬ
ፈራጁ የሆነው የሱስ ሲመጣ
ያኔ ነው ጉዴ የሚወጣ /2/

በመላ ለሌላው ልፈርድ
እራሴን ታማኝ ላደርግ
የሌለ ታሪክ ላወራ
ማንስ ሰጠኝ ለእኔ ተራ
አውቃለሁ ኃጥያቴን በደሌን
ምህረት ማይገባኝ መሆኔን
በኢየሱስ ፊት የሚያቀርብ
አንዳችም እንኳን እንደሌለኝ
እንደዚህ አይነት ሆኜ እኔ ታድያ
   እንዴት ብዬ ስለ ሰው ላውራ /2/

ምህረቱ በፊቱ የሚያቆመኝ …
',0),(NULL,'በእኔ ኃይል አይደለም የሆነው','Jerry1','በኔ ኃይል አይደለም የሆነው በኔ ኃይል /2/
በጥበቤ አይደለም የሆነው በጥበቤ /2/
የሱስ አንተ ረድተኸኝ ነው ያለፍኩት
የሱስ አንተ ረድተኸኝ ነው የኖርኩት
የሱስ አንተ ረድተኸኝ ነው የቆምኩት
  የሱስ አንተ ረድተኸኝ ነው ያለሁት /2/

ያለ አንተ ኢየሱስ ምን እችላለሁ
ካልረዳኸኝ እንዴት አደርጋለሁ
አንዳችም ነገር ያለ አንተ አልችልም
እባክህን ከእኔ አትለይ

ከእኔ አትለይ ኢየሱስ ከእኔ አትለይ /2*
ከእኔ አትለይ አምላኬ ከእኔ አትለይ /2*
በእኔ ኃይል አይደለም ….

እዚህ መድረሴ በብርታትህ ነው
ኃይል ያገኘሁት ከአንተ ዘንድ ነው
በራሴ ያደረኩት ምንም የለም
አሁንም ጌታ አንተን እሻለሁ
አንተን እሻለሁ ኢየሱስ አንተን እሻለሁ /2*
አንተን እሻለሁ አምላኬ አንተን እሻለሁ  /2*

የአንተ እርዳታ ያስፈልገኛል
ጥበቃህ ዘወትር ይበጀኛል
አትራቀኝ የነፍሴ ንጉስ
ፈቅጃለሁ በልቤ እንድትነግስ
በልቤ ንገስ ኢየሱስ በልቤ ንገስ  /2*
በልቤ ንገስ አምላኬ በልቤ ንገስ /2*

በእኔ ኃይል አይደለም ….
',0),(NULL,'በእኔ ኃይል አይደለም የሆነው','Jerry1','በኔ ኃይል አይደለም የሆነው በኔ ኃይል /2/
በጥበቤ አይደለም የሆነው በጥበቤ /2/
የሱስ አንተ ረድተኸኝ ነው ያለፍኩት
የሱስ አንተ ረድተኸኝ ነው የኖርኩት
የሱስ አንተ ረድተኸኝ ነው የቆምኩት
  የሱስ አንተ ረድተኸኝ ነው ያለሁት /2/

ያለ አንተ የሱስ ምን እችላለሁ
ካልረዳኸኝ እንዴት አደርጋለሁ
አንዳችም ነገር ያለ አንተ አልችልም
እባክህ ከእኔ አትለይ

ከኔ አትለይ የሱስ ከኔ አትለይ /2*
ከኔ አትለይ አምላኬ ከኔ አትለይ /2*
በኔ ኃይል አይደለም ….

እዚህ መድረሴ በብርታትህ ነው
ኃይል ያገኘሁት ከአንተ ዘንድ ነው
በራሴ ያደረኩት ምንም የለም
አሁንም ጌታ አንተን እሻለሁ
አንተን እሻለሁ የሱስ አንተን እሻለሁ /2*
አንተን እሻለሁ አምላኬ አንተን እሻለሁ  /2*

የአንተ እርዳታ ያስፈልገኛል
ጥበቃህ ዘወትር ይበጀኛል
አትራቀኝ የነፍሴ ንጉስ
ፈቅጃለሁ በልቤ እንድትነግስ
በልቤ ንገስ ኢየሱስ በልቤ ንገስ  /2*
በልቤ ንገስ አምላኬ በልቤ ንገስ /2*

በእኔ ኃይል አይደለም ….
',0),(NULL,'ኧረ አይቻልም ይቅር ያልኩትን  ','Jerry1','የማይቻለውን ሲችል አየሁ በአይኔ ሲችል /4/
ኧረ አይቻልም ይቅር ያልኩትን
ደረሰ ጌታ/ኢየሱስ ሊሰራ ሁሉንም /2/
ይሄ ከባድ ነው ይቅር ያልኩትን
ደረሰ ጌታ/ኢየሱስ ሊለውጠው 
እጄን በአፌ ላይ አስጫነኝ
እኔም ዝም አልኩኝ ተገረምኩኝ /2/
በእጆቹ ሥራ ተማረኩኝ
ተአምራቱን በአይኔ አየሁኝ /2/

እጅግ ከባድ መስሎ የታየኝ
በእርሱ ዘንድ ተችሎ አየሁኝ
በዘመኔ ተአምራት አድርጎ
እንቆቅልሼንም ሁሉ ፈቶ
እጄን በአፌ ላይ አስጫነኝ ….

ከሞተ አራት ቀን የሆነውን
ሸቶ በመቃብር ውስጥ ያለውን
አልአዛርን ከሞት አስነስቶ
በሕይወቱ ተአምራትን ሰርቶ
እጄን በአፌ ላይ አስጫነኝ ….

ከአስራ ሁለት አመት ጀምሮ
ስትሰቃይ ሳለች ደሟ ፈሶ
ተስፋዋ በሙሉ እጅግ ተሟጦ
የሚረዳትም ከእርስዋ ርቆ
አንድ ቀን በእምነት ልብሱን ስትነካ
ተፈውሳ ቀረች ከህመሟ
በመዳንዋ እጅግ ተገርማ/አመሰገነች ከሁሉ ቀድማ/
በድንቅ ስራው እጅግ ተገርማ
በነጻ ሄደች ሸክሟን አራግፋ
የማይቻለውን ሲችል ……
',0),(NULL,'በፍጹም የማላፍርበት','Jerry1','በፍጹም የማላፍርበት
አምላክ አለኝ የምኮራበት /2/*
እርሱ/የሱስ ነው የኔ መድሃኒት
ነፍሴን ያዳናት ከሞት /2/* 2
ያወጣኝ ከግዞት ቤት
የሰጠኝ ነጻነት እረፍት /2/*

በከበደኝ ላይ ስሙን ስጠራው
ሸክሜን በሙሉ ወስዶልኝ አየሁ
በመንገዴም እየቀደመልኝ
ጌታ ኢየሱስ ታምር ሲያሳየኝ
እኔ አይቻለሁ የእጆቹን ስራ
ድንቅ ነው እግዚአብሔር ግርማው የሚያስፈራ /2/

ኢየሱስ እያለ /2/ 
ለምን እፈራለሁ/እሰጋለሁ ኢየሱስ እያለ
የሚያስመካኝ ኢየሱስ
የሚደግፈኝ ኢየሱስ
የሚያበረታኝ ኢየሱስ
ሃይል የሚሆነኝ ኢየሱስ /2/

የማን ልጅ ሆኜ ነው የምፈራው
ለምንስ ብዬ የምደነግጠው
የንጉሥ ልጅ ነኝ እጅግ የከበርኩ
ከማንም በላይ በእርሱ የተመረጥኩ
አያምርም ጭራሽ በኔ ፍርሃት
ልኩራ በየሱስ ልኑር በድፍረት /2/

ኢየሱስ እያለ /2/ .......

የነገስታትን ንጉስ ይዤ
እንዴት እሰጋለሁ እርሱን አምኜ
የሚያኮራና ሚያስመካ አምላክ
ክንዱን የማይዝል ሁሉን የሚያንበረክክ
ኢየሱስ አምላኬ ታላቅ ነውና
ልታመን በእርሱ ዛሬ እንደገና /2/

ኢየሱስ እያለ /2/ .......
',0),(NULL,'ኢየሱስ ብቻ','Erkenesh1','ሳዝን ስንገላታ የሚይዘውን ሳጣ
ሰይጣን ደስ ብሎት ሊውጠኝ ሲያጓራ
አለም ስትጎትተኝ ሥጋ ሲያንገላታኝ
ማን ነው የሚያጽናናኝ ኃይልን የሚሰጠኝ 
ማን ነው?

ኢየሱስ ብቻ/4*

እምነቴ መንምኖ ማዕበል ሲያሰጥመኝ
አዕምሮዬ ዝሎ ልቤ ዕረፍት ሲያጣ
ሰይጣን ሲያስፈራራኝ ሥጋ ሲያንገላታኝ
ማን ነው የሚያጽናናኝ ኃይልን የሚሰጠኝ 
ማን ነው?

ወዳጅ ዘመዶቼ ለፍርድ ሲያቀርቡኝ
በውሸት በሐሜት ስሜን ሲያጠፉ
በፍርሃት ተውጬ የሱሴን እንዳልጥል
ማን ነው የሚያጽናናኝ ኃይልን የሚሰጠኝ 
ማን ነው?

ችግር አሰቃይቶኝ ታምሜ ተኝቼ
ተስፋዬን ቆርጬ ሳዝን ሳመነታ
ሰነፎች ሲስቁኝ የወድኩ መስሏቸው
ማን ነው የሚያጽናናኝ ኃይልን የሚሰጠኝ 
ማን ነው?
',0),(NULL,'ክብርህ  ይስፋ ','Erkenesh1','ክብርህ ይስፋ/3*
ጌታ ኢየሱስ ሆይ ክብርህ ይስፋ /2/

ጤንነታችን ሕይወታችን
ለመለመ ኑሮአችን
በኃያል ስሙ ተጠምቀናል
በመንፈስ ቅዱስ ተሞልተናል

ዓይንም ከቶ ያላየው
የሰው ጆሮ ያልሰማው
በሰው ልብ ያልታሰበው
አግኝተናል በረከትን

ማዳንህን አይተናል
በምህረትህ ረክተናል
ተአምራትህን አይተናል
ቸርነትህን ቀምሰናል

በአንድ ጌታ በአንድ መንፈስ
በአንድ ሃይማኖት በአንዲት ጥምቀት
እንድንቆም ረድተኸናል
ክብርህ ይስፋ ይገባሃል
',0),(NULL,'እጅግ ያጓጓኛል የሰማዩ ቤቴ','Erkenesh1','እጅግ ያጓጓኛል የሰማዩ ቤቴ
በቀንም በሌሊት ወደዛ ነው ናፍቆቴ
ያለኝን እየሸጥሁ
ራሴንም እየካድሁ
ለየሱሴ ልኖር እታገላለሁ

በምድር ስደተኛ መሆኔን አውቃለሁ
ለሰማዩ ቤቴ አገለግላለሁ
ከአለም ከንቱ ነገር ምኑ ሊቀርብኝ
ብኖርም ብሞትም ሁሌ የኢየሱስ ነኝ

ጌታዬ ሲገለጥ በሚያስፈራ ክብር
በሥጋዬ ምክንያት እንዳልቀር በምድር
መክሊቴን ልስራበት ልትጋ በቀን በሌት
መዝገቤን በሙሉ ልሰብስብ በሰማይ

ጌታዬ መድህኔ የሞትክልኝ የሱስ
በሰራህልኝ ቤት ከአንተ ጋር እንድነግስ
ልቤን ስበርልኝ ሥጋዬን አስክደኝ
ጥበቤም ዕውቀቴን አንተን መፍራት ይሁን
',0),(NULL,'ተጋድሎ በዝቶብኝ ','Erkenesh1','የአለም ፈተና ቢመስለኝ ተራራ
ኃይሉ ያጽናናኛል ልቤ እንዳይፈራ
ሐሰትና ትዝብት ልቤ ቢያቆስለው
አውቃለሁኝ ሁሉን ኃላፊ ጠፊ ነው
ዛሬ የእኔ ሥጋ መሰዋት አለበት/2

የአለም ፍልስፍና አንጎልህን አሳስቶ
ወንድሜ ርቀሃል ከእውነቱ አለት
ቢመስልህ ኢየሱስ ታሪክና ወሬ
ኋላ ታጭደዋለህ የዘራኸው ፍሬ

ተጋድሎ በዝቶብኝ ቀረሁ ስል መና
ዛሬ ደስ ብሎኛል ድል የእኔ ሆነና/2*
ብዬ ለመናገር በዚያ በሞት ሰአት
ዛሬ የእኔ ሥጋ መሰዋት አለበት/2

ዛሬ የእኔ ሥጋ መሰዋት አለበት/2
',0),(NULL,'የአምልኮ ነፃነት ','Erkenesh1','የአምልኮ ነፃነት የመንፈስ ብርታት
እልልታ ጭብጨባ ምስጋና ጭኾት
የደስታም የምልጃም እምባ መራጨት
በጭራሽ እንዳይቀር ጌታ አደራህን

አንቀሳቅሰን ጌታ ሆይ በመንፈስ ቅዱስ ኃይል
የሚከለክልህ ሰው ክንዱ ይሰበራል
አንተ በክብር ስትመጣ በፊትህ እንውደቅ
ስምህ ይግነን በይፋ በየትም ይታወቅ
የሚያቃጥል እሳት ነው ሕይወትን ሲዳስስ
ያስጮሃል ያስጨፍራል ውጤቱ ደስታ ነው
የጌታ መንፈስ ሲወርድ የሚገለባብጥ ነው

መልክተኞች መስራቾች ሊያስተጋቡ ይዝመቱ
በጌታችን ቅዱስ ቃል እየተበረታቱ
ፍቅሩም ይድረስ ለነፍሳት የየሱስ ነፃነት
ከውሃ ዳግም ተወልዶ መንፈስ ቅዱስ ማግኘት
',0),(NULL,'ሰው ምንድነው ታስበው ','Erkenesh1','ሰው ምንድነው ታስበው ዘንድ ጌታ
ሰው ምንድነው እንድትጎበኘው /2/

ከባህር አሸዋ መሃከል ቅንጣት
ከብዙዎች መሃከል ታናሽ ካነሱት
ከፍጥረት ውቅያኖስ ጠብታ ሕይወት
ከአእላፍ ሠራዊት ደካማ ብልት

የራሴ ምሳሌ የእጆቼ ሥራ
የእስትንፋሴ ቁራጭ የፍቅሬ ኢላማ
የምወደው እንቁ ከአለማት አብልጬ
የኃይሌ ምስጋና ነው የበኩር ልጄ
ሰው ልጄ ነው አስበው ዘንድ እኔ
ሰው ልጄ ነው እንድጎበኘው /2/

አካሉ ቤቴ ነው የነፍሴ ማደሪያ
ወንጌሌን ሲቀበል የቃሌ መኖርያ
መልኬ ምሳሌዬ የሚታይበት
ሰው ነው ለእኔ ክቡር ከሁሉ ፍጥረት

ሰው ልጄ ነው…
',0),(NULL,'መንፈስ ቅዱስ','Erkenesh1','መንፈስ ቅዱስ መንፈስ ቅዱስ
ሁሉንም የሚችል የአምላክ እስትንፋስ
የሚባርክ የሚለውጥ ኃይል ነው
ልቤን ከፍቼ ልቀበለው

ቃሉን የሚያስተምረኝ ወደ እውነት የሚመራኝ
መንፈስ ቅዱስ ያስፈልገኛል
የየሱስን መንፈስ በልቤ ሚያኖርልኝ
መንፈስ ቅዱስ ያስፈልገኛል

ሰላምና ደስታ እረፍትን የሚሰጠኝ
መንፈስ ቅዱስ ያስፈልገኛል
በመከራ ጊዜ ሳዝን የሚያጽናናኝ
መንፈስ ቅዱስ ያስፈልገኛል

በድካሜም ጊዜ ኃይልን የሚያበዛልኝ
መንፈስ ቅዱስ ያስፈልገኛል
መጸለይ ሲሳነኝ የሚቀሰቅሰኝ
መንፈስ ቅዱስ ያስፈልገኛል

ሕይወቴን የሚቀድስ ነፍሴንም የሚያድስ
መንፈስ ቅዱስ ያስፈልገኛል
ወደ ሰማይ የሚነጥቀኝ የጌታ ኢየሱስ መንፈስ
መንፈስ ቅዱስ ያስፈልገኛል
',0),(NULL,'ምስጉን ነው እርሱ','Erkenesh1','ምስጉን ነው እርሱ
በቃል በሥራ ለአምላክ ሕግ የሚቀና
በቅድስና ወደ ሰማይ በእምነት አይኖቹ የሚያይ /3/
',0),(NULL,'ሁሌ የማስባችሁ','Erkenesh1','ዘወትር ስጸልይ ሁሌ የማስባችሁ
በመንፈሱ ፍቅር በልቤ ያላችሁ
በኢየሱስ ቅዱስ ስም መዳን ያገኛችሁ
የኢየሱስ ልጆች ሆይ እንዴት ነው ኑሮአችሁ/
ወንድሞች እህቶች እንዴት ነው ኑሮአችሁ
ኢየሱስ ያጽናችሁ

ወንድሞች እህቶች ለእኔ ጌጤ ክብሬ
አልረሳችሁም ከቶ በዚህ መኖሬ
በአለም መከራ በትግል ያላችሁ
የመንጋው በጎች ሆይ የሱስ አለላችሁ

አንድ ላይ ጀምረን በአንድነት እንጨርስ
በመንገድ እንዳንቀር ወደ ጽዮን ሳንደርስ
ሕይወትህን ከኃጥያት ጠብቀህ ተዋጋ
በአለም እንዳትቀይር የኢየሱስን ፀጋ

በጽዮን መርከብ ላይ አንዴ ተሳፍረናል
ጉዞአችን በደስታ በሰማይ ያበቃል
እስከዚያው እንትጋ በፍቅር ተያይዘን
በመንገድ አንውርድ ወደ ኋላ አይተን

አንተ ስትቆስል እኔም አለቅሳለሁ
አንተ ስትባረክ እኔም እረካለሁ
ችግርህ ችግሬ ደስታዬ ነው ደስታ
በአምላክ ያገኘሁህ ክርስቲያን ሆይ በርታ
',0),(NULL,'አሜን አሜን ክብር ሃሌሉያ','Erkenesh1','አሜን አሜን ክብር ሃሌሉያ
ሥራው ሰፊ ነው የምንሰራው
ለጌታ ኢየሱስ የምንፈጽመው /2/

ቤቱን ለመስራት ፍጹም ቆርጠናል
የመንፈስ ቅዱስ ኃይል አግኝተናል
በወንጌሉ ቃል አምድ ታጥቀናል

ኃያሉ የሱስ ከእኛ ጋራ ነው
ብርና ወርቁ ሁሉም የእርሱ ነው
ሕዝቡም በርትቷል ልቡ እንዳስነሳው

ቤቱን በደስታ እንሰራለን
ቅጥሮቹን ሁሉ እናድሳለን
ለንብረታችን እንተጋለን

ቀንና ሌሊት እንሰራለን
እየሰራንም እንዘምራለን
እየጸለይንም እንገነባለን

ለጠላት ዛቻ አንበገርም
በሰይጣን ጥበብ አንታለልም
ከእንግዲህ ወዲህ ለራስ አንኖርም
',0),(NULL,'እንደ ፈቃድህ አድርገህ','Erkenesh1','በረኃው ሙቀቱ ውስጥ በደረቁ ሥፍራ
የሚገኙ መሃከል ቢመጣም መከራ
ቦታው ባይስማማኝም ሰዎቹ ቢጠሉኝ
መስቀልህን አሸክመህ የሱስ ሆይ ላከኝ

እንደ ፈቃድህ አድርገህ እባክህ ምራኝ
ወደ ፈለከው ቦታ አንተ ውሰደኝ
ያሻህን እሆንልሃለሁ ተናገረኝ ጌታ
ኢየሱሴ ውሰደኝ የትም የትም ቦታ

ከተማም ይሁን መንደር ሰው የሚገኝበት
ሊጠፋ የደረሰ ኃጥአት የበዛበት
እውነቱ ያልደረሰው ጎሳ መሃከል
ሠራተኛን ለመላክ ጌታ አስበሃልን

አውቃለሁኝ ፈቃድህ ፍጹም አይዛባም
የምስራቹን ሰሚ ሰውም አይታጣም
እንዳሻህ መድኃኒቴ ብርታቱ ያንተ ነው
ወደሚያስፈልግ ቦታ አሽከርህን ላከው
',0),(NULL,'ሙሽራው ሲመጣ','Erkenesh1','የቆምኩኝ ቢመስለኝ ዘወትር እንዳልወድቅ ልጠንቀቅ
መዳኔን በመፍራት ልፈጽም
አክሊሌ እንዳይሰረቅ መቅረዜ እንዳይጠፋ ልጠብቅ
ዘወትር በጥላህ ውስጥ ልገኝ

ሙሽራው ሲመጣ አብሬው ለመግባት ልዘጋጅ
መክሊቴን አትርፌ ከእርሱ ጋር በደስታ እንድነግስ

አመጽ ስለ በዛ ጌታ ሆይ ፍቅሬ እንዳይቀዘቅዝ
ዘወትር እያሰብኩህ ልኑር
በኃጥአት ማጥ ወድቄ በአለም ተከብቤ እንዳልፈዝ
ጌታ ሆይ መንገዴን አብራልኝ

በእምነት እየሮጥኩ ተራራ ሸለቆ ብወጣም
አንዳንዴ አድጦኝ ብወድቅም
ሰባት ጊዜ ብወድቅ ሰባቴ እነሳለሁ ይመስገን
በፍጹም ተስፋዬን አልቆርጥም

ኃይልን በሚሰጠኝ በኢየሱስ ሁሉን እችላለሁ
ሕይወቴን ለእርሱ ሰጥቻለሁ
አብልጨ ወድጄው ለሥሙ ታምኜ እየኖርኩ
ዘወትር ኢየሱስ ኦ ኢየሱስ አድነኝ እላለሁ
',0),(NULL,'የእግዚአብሔር ቤት ተራራ','Erkenesh1','የእግዚአብሔር ቤት ተራራ
በተራሮች ራስ ላይ
ጸንቶ ይቆማል አሜን
ጸንቶ ይቆማል/2*

ሕግ ከጽዮን ይወጣል
አሕዛብ ወደዚያ ይጎርፋል
አንዱ ለአንዱ ይጣራል
ቤተክርስቲያን ይከብራል

የሐሰት እምነት ይጠፋል
እውነት ቦታውን ይወርሳል
ሰላም ለሕዝቡ ይበዛል
የሐዋርያት ምስጥር ይሰፋል

ዮሐንስ በሰበከበት
ንስሐ በታወጀበት
እነ ጴጥሮስ ይሰብካሉ
በኢየሱስ ስም ያጠምቃሉ

በመጨረሻው ዘመን
ሲቃረብ የመምጫው ቀን
መንፈስ በሰዎች ይፈሳል
ድንቅ ታምራትም ይሆናል
',0),(NULL,'እምነቴ እስከ ሞት','Erkenesh1','እምነቴ እስከ ሞት/4*
እንደ ሐዋርያት እንደ ነብያት
ለዘላለም ሕይወት   /2/

ለታላቁ ነገር እምነቴ እስከሞት
ስለ ቅዱሱ ስሙ ፍጹም መሰዋት
በመከራም ቢሆን ደግሞም በእስራት
ታግሶ መግባት ነው መንግስተ ሰማያት

በድንጋይ ተወግሮ ሞተ እስጢፋኖስ
እንደ በግ ታረደ ሐዋርያው ጳውሎስ
ያዕቆብ በሰይፍ ሞተ ደግሞም ዮሐንስ
ሁሉን ችለውታል ስለ ኢየሱስ

ዘካርያስም ሞተ በቤተመቅደስ
በጉድጓድ ተጣለ ነብዩ ኤልያስ
በእሳት ተጣሉ ሶስቱ ቅዱሳት
ለአምላካቸው ክብር መስዋዕት በመሆን
',0),(NULL,'እንዳሻህ አድርገኝ','Fish1','እንዳሻህ አድርገኝ እንደ ወደድከው
   ይሁን ኢየሱሴ አንተ ብቻ ያልከው /2/*
ብቻ ክበር ብቻ ክበር ብቻ ክበር እንጂ
 አንተ ያልፈቀድከው ለኔ ምንም አይበጅ /2/*

 ሳትፈቅድልኝ መጥተው የሆኑልኝ ሁሉ
በረከትን መስለው ቤቴንም የሞሉ
ለጥፋቴ ምክንያት ተልዕኮ ያላቸው
አይበጁኝምና አልሄድ በምክራቸው
ክብርህ ብቻ በእኔ ቦታ እንዲኖረው
በዘላለም ፍቅርህ መኖር ክብሬ ነው

የመረጥክልኝ ነገር በጎነት አለው
በደስታ ፈቅደህ ልትሰጠኝ ያሰብከው
በውስጤ ሆኖ ግን በር የዘጋብህ
ነቃቅለህ አውጣና ፈፅም ዓላማህን
ክበር በሕይወቴ ዘወትር ብቻህን
ምንም ዕንቅፋት ሆኖ አያስቸግርህ

በመንገድ ላይ ቆሜ ነገርን ላስተውል
ወዴትና እንዴት መሄድ እንዳለብኝ
ቅን የምትመስል ጎዳና አለችና
በስዋ እንዳልራመድ ኢየሱስ እግሬን አጽና
ክብርህ በእኔ ላይ ይሁን ገናና
የነፍሴ እረኛ አምላክ ነህና

 ሰላሜ ለመንጠቅ በደጅ ያደቡት
የኃጢያት ሞግዚት ሆነው የራቃቸው ሰላም
ከሩቅ ሲታዩ ግን ለዐይን የሚያምሩ
በልቤ ፈቃድ ላይ በኔ አይክበሩ
ልዝጋ በሬን ልቆልፍ ለክብርህ ካልሆኑ
ላንተ ብቻ ይገዛ ዘመኔ ሁሉ
',0),(NULL,'ኦ አምላኬ','Fish1','ኦ አምላኬ ፍጹም እረዳቴ
ባገኘኝ በታላቅ መከራ ጉልበቴ ሆነህ ኃይሌ
ክብርን ታዲያ ተቀበል ይኸው አርፋለች ነፍሴ
በአንተ ከአስጨናቂው

 የጨካኝ ጡጫ ብርቱ ጉልበቱ
የት አለ ዛሬስ ማስፈራራቱ
ኢየሱስ አንተ በቅናት እሳት
ተነስተሃል ልታቀልጥ የእስራቴን ሰንሰለት
ነጻ ሆኗል አዕምሮዬ
ተደላድሏል የጽድቅ ሰላም ተስፋዬ

 ድንግዝግዝታውን የመዳን ዕውቀት
አስወግደሃል ልቤን በማስፋት
የእስራኤል ጌታ በእውነት አንተ
ራስህን  አልሰወርክም
ሕይወት ሆነህ ተገልጠሃል
የዕውቀት ሽታ በስፍራዬ
ታይቷል በእርግጥ ዛሬ
ክበር ጌታዬ

 የነፍሴ ረሃብ ዕንቆቅልሽ
ተፈቷል ሁሉም  ሲያገኝ ምላሽ
በዘመኔ ሁሉ ልገዛልህ
ህያው ነኝ በአንተ ፍቅርህ ማርኮኛል
ቅኔዎችን በአስር አውታር
እዘምርልሃለሁ ክብሬ እስኪያከብርህ
',0),(NULL,'ኑ ልንገራችሁ','Fish1','ለነፍሴ የሱስ ያረገላትን
ኑ ልንገራችሁ በድል የመራትን /2/*
ጨለማዋን ከላይዋ ገፎ ብርሃን ለሰጣት
አስፈሪዎችዋን ከእግርዋ ስር እሱ እንዳስረገጣት /2/*

 የአማልክቱ ብዛት ዙሪያዋን ሲከባት
የዕጣንን ቁርባን ሰዊልንም ሲሏት
አምልኮዋ ዘወትር በግዞት ቤት ኑሮ
ስትደክም መከሯዋ ተሰማ የእሷ ሮሮ
ብርሃን ሆኖላት አየችው አንዱን አምላክ
በሕይወቷ ከብሮ

 የእስራኤል መጽናናት ለትውልድ መድሃኒት
ሆኖ የመጣውን አገኘችው ድንገት
በቃሉ ብርሃን ክብሯን ጣለችና
ማነህ አንተ ብላ አለች  ክብሩን አየችና
የአባቶቿን አምላክ አየችው እርሱ ራሱ ግልጽ ሆነላትና

 ሚስጢር የሆነባት የመዳንዋ ዕንቆቅልሽ
ዛሬ ተፈታላት ከሞት ፍርድ እንድትሸሽ
አውቃ እንድታመልከው ያን የጥንት አንድ አምላክ 
ዓይኖቿን አበራላትና ወጣች ከጭንቀቷ
ሰላም አገኘች በግምት ከመጏዟ ተመልሳ ስትሄድ

 የሕይወት እስትንፋስ እፍ አለባትና
አረካት የልቧን መሻት ፈጸመና
ከሞት ፍርድ አዳናት  ሃሳቧን ቀድሶ
ለሰማያዊ ርስት ስጦታን ለግሶ
አምሮባታል አሁን በቤትህ ወዛዝታለች ዕንባዋ ታብሶ
',0),(NULL,'እሄዳለሁ ካንተ ጋር','Fish1','ሃይሌን እየጨመርኩ እበረታለሁ
ሃይሌን እያበዛሁ በጽኑ እራመዳለሁ
እሄዳለሁ ካንተ ጋር ወደ ጽዮን ተራራ
እሄዳለሁ ካንተ ጋር ወደ ምስጋናህ መኖሪያ /2/

 የጽድቅ ብርሃኔ ሙሉ ቀን እስኪሆን እንዲበራ ጸሃይ
እየጨማመርኩ እታገላለሁ ልወርስ መንግስተ ሰማይ
እጄን እንኳን አልሰጥም ለሚያደካክመኝ ለሚያዝለኝ ሽንፈት
ኢየሱሴ በሃይልህ የማልወጣው የለም በዘለአለሙ ብርታት

አዉቃለሁ በኔ ዘንድ አቅም ችሎታዬን በጣም አናሳ መሆኑን
በትር ምርኩዝህ ግን ሁሌ ያጽናኑኛል በሰልፍ ብርቱ እንድሆን
ወገቤ አይፈታ ትጥቄን አጠብቃለሁ እንደ ገና እሩጫ
ሽልማቱ የኔ ነው ከቶ አላስነጥቅም የድል አክሊሌንም ዋንጫ

በደጆቼ ያደባው የኃጢያት ንግስናን ዛሬ ዙፋንን ስር ጥላለሁ
ፈጥኜ በስፍራው  ጽድቄን ጌታ ኢየሱስ አንተን አነግስሃለሁ
ያልተስተካከለው የልቤ ክፋት በቃልህ ጌታ ተገርዞ
ማየት ናፈቀኝ እውነቱ በውስጤ አደንቃለሁኝ በቶሎ
',0),(NULL,'አብርሃም ባያውቀኝ','Fish1','አብርሃም ባያውቀኝ ባያውቀኝ ባያውቀኝ
አንተ ለኔ አባቴ ነህ በልቤ ላይ ነግሰህ ያለህ
 ከቶ አልፈራም አዎ አልሰጋም እስከ ሽበት ሽምግልና/2/ 2*

 አስቀድመህ አወከኝ ልጅህ ነኝ
ከእናቴ ማህጸን መርጠህ የለየኸኝ
ሳትጥለኝ በተስፋ አሳድረኸኛል
የዘለዓለም አባት ክንዴ ሆነሃል

የውስጤን ከልቡ የሚረዳ
ምንም ባይኖር እንኳ በብዙ እስክጎዳ
የሱስ ብዬ ስልህ በአባትነትህ
በሃይል ትነሳለህ ከነ ሰላምህ

 ለማስረዳት ያልኩት ሙግቴ
ፍቅርህ ለማሳየት የነበረው እምነቴ
በማንም ዘንድ ስፍራ ከቶ ባይሰጠዉ
እኔነቴን ላንተ በጽድቅ አሳየዉ

ሚስጢር ገመናዬን በበገና
እደረድራለሁ ይገባሃል እና
በመንገዶችህም ሳስብህ ተግቼ
ድምጼን ትሰማለህ ከከንፈሮቼ
',0),(NULL,'ቅርብ ነው','Fish1','ረስቶኛል ያልኩት ወዳጄ 
ቅርብ ነው ቅርብ ነው
አይኖቼ ሲበሩ ተመለከተው 
ፍቅር ነው ፍቅር ነው
   ልቤም አለ እፎይ ከእንግዲህ 
በእውነት ኢየሱስ ንገስ ንገስ ንገስ/2/*

ብርታትና ጥበብ በውስጤ ሞልቶ
አቁሞኝም ሳለ ሕይወቴንም መርጦ
ሲያሸጋግረኝ  ወጀብ ንፋሱን
መች ገብቶኝ ነበር ከኔ ጋር መኖሩ

 ሕይወትን በሚሰጥ ፍቅር በሞላበት
በሰማዩ መና እምነቴን ሊያንጽ
ወደ ዕረፍት ውኃ መንገድ እየመራ
ጠጣሁ መንፈሱን ቆምኩኝ በተራራ

 ሃይሉ ብዙ ሲሆን ጠላቶቹ ዋሽተው
ነፍሴን ሊያዳክሙ ሊገድሏትም ሽተው
ቀን ሌት በንዝነዛ ደጆቿን ሲያደቡ
አዳናት አምላኬ ነችና ገንዘቡ
',0),(NULL,'ምህረትህ በዛ','Fish1','ምህረትህ በዛ ምህረትህ በዛ
ለተማመንህ በአንተ ላይ ላረፈ
የጽድቅን መንገድ ይዞ ለገሰገሰ
የሱስ ሆይ ህይወቱ ባንተ ታደሰ

 ከዓጥናፍ እስከ አጥናፍ ተዘርግቶ ቸርነትህ ለሰው ልጆች ደርሶህ
ተደስቷል ፍጥረት በስራህ ምህረትህን ፈጥነህ እያሸከምከው
ጽኑአን በአንተ ተፈጥረዋል ስምህ በምስጋና ተዘምሯል
ዝናህም  ወጣልህ ከምድር ዳር በአደባባዮችህ ላንተ ክብር

የዕውቀጥ ሽታ ከድንኳን አልጠፋም  ከፊትህ ዛሬም አምላክ ሆይ ዛሬም አዳነን
ተነስ ተሸከመው አልጋህን ስትል የሚሰማው ድምጽህን
ተዓምራትን ሰርቷል እንደ ጥንቱ በከፊትህ አድርጓል ሕዝብህን ብርቱ
ከአሸናፊዎች በላይ አድርጎ በጽኑ አቁሟል አሳድጎ

 አባ አባት ብሎ የሚያስጮኸን ቅዱስ መንፈስህን ከአንተ አገኘን
ከልጅነት ጎራ ተሰየምን በሚያስገርም ክብር ይኼው አለን
በፊትህም ዛሬ በደስታ እንጫወታለን በአንተ ጌታ
ሙሉ ሃይላችንን አንስተናል በምህረትህ በቃ ደስ ብሎናል

 መዝሙሮች በዙልን በአዲስ ቅኔ እንዘምራለን በመንፈስ ወኔ
ጭንቅ ተወግዶ የእልልታ ድምጽ መጣ ምህረት ሲገለጥ ድልም መጣ
መሸማቀቅ ቀረ መኮማተር ጠላት ተመልሶ ፈጥኖ ሲባረረ
እሮጥን በስምህ ከፍ አልን በጸጋህ ድጋፍ ተሞልተን
',0),(NULL,'ብዘምርም አይበቃው','Fish1','ብዘምርም አይበቃውም ኢየሱስ
ባመሰግን አይበቃውም ኢየሱስ
ብሰግድለት አይበቃውም ኢየሱስ
    ክብሬን ሁሉ ልጣልለት ለኢየሱስ /2/*

የምድር ኑሮዬ በበጎች መሃል
መታገል ብቻ ከተኩላ ከድብ
እንኳን በዓምላክ ፊት በሰዎችም አይን
ታናሽ ነበርኩኝ እጅግ የተናኩ
ለካ ለኢየሱስ ውበት ደም ግባት
አይታየውም የቁመት ርዝመት
ዛሬ ታሪኬ ተለውጦ ነው
በገናን ይዤ  የምዘምረው - የምዘምረው

 አልረሳም ፍጹም ውለታውን
ኢየሱስ ለኔ ያረገውን
ትላንት በትሬን ይዤ ወጣሁ
ዛሬ ግን የሁለት ክፍል ሰራዊት ሆንኩኝ
ሚልኮልም ትሳቅ ጨክኛለሁ
በክብሬም ገና አከብረዋለሁ
ገና ዘምሬ አልደክምም- አልረካሁኝም

 የአላዛር ነገር በቃ አበቃ
በሰዎችም አፍ ታሪክ ተዘጋ
ወዳጄ ኢየሱስ እዛው ደረሰ
የሃዘን እንባ ከዐይኑ ፈሰሰ
የቀኑ ብዛት ሳያግደው
በስልጣኑ ቃል ተናገረው
ተነሳ አለኝ እኔም ነቃሁ
የማይቻለውን ሲችል አየሁ
ሲችል አየሁ
',0),(NULL,'ተባረክ ብዬ ጌታዬን','Fish1','ተባረክ ብዬ ጌታዬን ተወደስ ብዬ ኢየሱስን
እንዲያው በቀላሉ የማልጨርሰው
 ምስጋናው ሞልቷል በልቤ /3/

 በባርነት አገር ሳለሁኝ
የጠላቴ ዛቻ ሰልችቶኝ
ዛሬን አለፍኩ የነገውንስ
ማን ይሆነኛል ስል
ብዬ ሳዝን በድንቅ ሁኔታ
ጌታዬ አገኘኝ
ወደ ቅድስናው ተራራ
ማደሪያው አመጣኝ

ነፍሴ መከራን ጠግባብኝ
ሕይወቴም ከሲኦል ቀርባብኝ
ረዳት እንደሌለው ተቆጠርኩ
በአንተ እንዳልታሰቡትም ታሰብኩ
ጩኸቴን ለአንተ ላሰማ ማለዳ ወደ አንተ ቀረብኩ
ጆሮህን ወደ ማልረባው ወደ እኔም አዘነበልክ

 አቤቱ ስራህ ትልቅ ነው
አሰራርህ እጅግ ጥልቅ ነው
በስራህ ደስ አሰኝተኸኝ
ለመዝሙር እንዲህ አቆምከኝ
በሕይወቴም ከአንተ ጋራ ልቀጥል ወስኛለሁኝ
ብርሃንህንና እውነትህን  አጥብቄ እይዛለሁኝ

ተባረክ ብዬ ጌታዬን ተመለክ ብዬ ኢየሱስን
እንዲው በቀላሉ የማልጨርስው
ምስጋናው ሞልቷል በልቤ
',0),(NULL,'ምስጋናን ብሰዋለት','Fish2','ብዙ አለኝ እኔስ በልቤ ብዙ አለኝ
ብዙ አለኝ እኔስ ለአምላኬ ብዙ አለኝ /2/

ምስጋናን ብሰዋለት
ክብርን ባመጣለት /2/
ኢየሱስ መች ይበዛበታል
ኢየሱስ መች ይበዛበታል 
ኢየሱስ የሰማይ ሰራዊት እንኳን
በሙሉ ሃይል ይሰግዱለታል

ለኔም ለቤቴ ፍርሃት አውቄ
ብገዛ በፊቱ ማቄን አውልቄ
ያለኝን ሁሉ ለክብሩ ባስገዛ
ምናለበት አሁን ምስጋናን ባመጣ
አድኖኝ የለም ወይ ከዚህ አለም ጣጣ

አህዛብ በማመጽ በስንፍና ጉዞ
ክፋትን ሲያበዙ ልባቸው ደንዝዞ
በጣዖቶቻቸው አምላኬን ሲያስቆጡት
እንዴት በዝምታ እኔ ልቀጥልበት
በእኔ ዘንድ እያለ የአምልኮ ጉልበት

ላድንቀው እንጂ ጌታዬን በክብሩ
ጢስ ይውጣ ከመቅደስ ከምስጋና እጣኑ
ያልተገዛም አይኑር ያልተንበረከከ
ማንም የለምና በእርሱ ያልተባረከ
ወደ ኢየሱስ ጮሆ ጸጋ ያልተቀበለ
',0),(NULL,'በስምህ ጎልምሰን አንተን እንጠራሃለን','Fish2','በስምህ ጎልምሰን ጎልምሰን አንተን እንጠራሃለን
በምክርህ ጠንክረን ጠንክረን ጸንተን እንቆማለን
ከፈተናውም ሰዓት መውጪያ ነህ
ለመልካም ኑሮ ተስፋ ላረገህ
ስጋ ሲደክም መንፈስን ቀስቃሽ
በከበደን ላይ ብርቱ ነህ አጋዥ

በእውነት ትልቅ ነህ ትልቅ እግዚአብሔር
ሞገስ ክብር ያለህ የማይወስንህ ድንበር
አንተን አንተን ላለ በጽድቅ ተውቦ
አያጣም ድጋፍህንም በምህረት ታስቦ /2/

ማልዶ ተነሺ ነህ ቀድመህ ተሰላፊ
ልትታደግ ብለህ ከሆነው አስከፊ
ምርኮን አሸክመህ የድል ዜማ ባንተ
ሰማን በኛም ዘመን ጠላትን መትተህ /2/

ሁሉ ባንተ ሆነ ምህረት እውነታችን
የጸጋህም መጠን ሞላ በልባችን
ተባረክን ባንተ ሳለን ምድረ በዳ
ዛሬም ተጎበኘ የእምነታችን ጓዳ /2/
',0),(NULL,'ትግሌ ካንተው ጋር ነው የሱስ','Fish2','ትግሌ ካንተው ጋር ነው የሱስ 
ትግሌ ካንተው ጋር ነው  /2/

በረከትህንም እስክትባርከኝ
ሌሊቱ እስኪያቅላላ የሙጥኝ የምልህ
ስሜንም ለውጠህ እስራኤል እስክትለኝ
እኔም ላንተ መሰዊያን እስከምሰራልህ 

የእስራኤል አምላክ ተብለህ ተጠራ
እኔ ለውጠኸኝ ለክብርህ ስራ
ምስጋናዬ እንዲሆን ሁሉን ስለመቻልህ
ሃይሌን ሰባብረኸው ታማኝ እስክሆንልህ

በበረከት ሸለቆ በቤተክርስቲያን
ደጅህን በመጥናት ሳልሰለች ማንኳኳት
እምባዬ ታብሶ መሻቴ እስኪፈጸም
አልለቅህም ዛሬ ብትታገለኝም

ሹልዳዬ ተወግቶ እግሬ ቢያነክስም
እታገላለሁኝ ከቶ አይጎዳኝም
ብቻ እቤቴ ውስጥ በረከትህ ትምጣ
ከከበበኝ ጠላት ነጻ እንድወጣ
',0),(NULL,'ቤተክርስቲያን','Fish2','ቤተክርስቲያን /4/
ለታመመው - ኃይልሽ መድሃኒት ነው
ለባዘነው - ኃይልሽ መድሃኒት ነው
ለጎስቋላው - ኃይልሽ መድሃኒት ነው
ጌታ ኢየሱስ በአንቺ የሚሰራው

አንቺ ሞዶሻ ነሽ - አህዛብን መስበሪያ
አንቺ ሞዶሻ ነሽ - የሰይጣንን ሃይል ማድቀቂያ
አንቺ ሞዶሻ ነሽ - የገሃነምን ደጅ መዝጊያ
አንቺ ሞዶሻ ነሽ - የጽድቅንም ስራ መስሪያ

ባንቺ የጸሎት ጉልበት - ወህኒ ያሉ ይፈታሉ
ባንቺ የጸሎት ጉልበት - ቀንበሮች ይሰበራሉ
ባንቺ የጸሎት ጉልበት - ሐዘንተኞች ይጽናናሉ
ባንቺ የጸሎት ጉልበት - የደከሙ ይበረታሉ

ቤትሽ በክብር በደስታ/ሐሴት ተሞልቷል
ደስታና ሰላም ይፍለቀለቃል/እጅጉን በዝቷል

በምድር ያሰርሻቸውን ሰማይ አስሮ ይይዛቸዋል
በምድር የፈታሻቸውን ሰማይ ፈቶ ይለቃቸዋል
በምድር ያጽናናሻቸውን ሰማይ ይቀበላቸዋል
በምድር ታዝዞሽ ያለ ለዘላለም ይባረካል

በአንቺ ለሚኖሩ በደስታ ይመከራሉ
በአንቺ ለሚኖሩ የሱስ አለ ከነክብሩ
በአንቺ ለሚኖሩ ይነግራቸዋል በፍቅሩ
በአንቺ ለሚኖሩ ይመራቸዋል በቃሉ
ቤትሽ ......

',0),(NULL,'ጠላት እስከመቼ ስምህን ያቃልላል','Fish2','ጠላት እስከመቼ ስምህን ያቃልላል?
በቅዱሳንህስ ላይ ለምን (ስለምን) ይላግዳል? /2/

ተነስ ኢየሱስ ተነስ
ተነስ በቁጭት ተነስ
ተነስ በቅንዓትህ ተነስ
ኧረ ተነስ ስራውን ሁሉ አፍርስ /3/

ሰማያትን ቀድደህ ኢየሱስ ፈጥነህ ውረድ
ቁጣህ በጠላቶችህ ላይ ዛሬ ይንደድ አዎ ዛሬ ይንደድ
ያልተጠባበቅነው የክብርህን ስራ
በዚህ ዘመን ፈጽም ብርሃንህን አብራ /2/

በአልና ዳጎን አስታሮት ጥንቆላ
ብሎ ራሱን ሲሸፍን በነዚህ ከለላ /2/
ያጭበረበረበት የክፉ ጊዚያቱ
በቃ ያክትምለት ያንተ ነው ሰዓቱ /2/

ምነው ቅናትህ እንደ ሲኦል ጨክኖ /2/
ለምን አይነሳም በጠላት ላይ ቆርጦ /2/
የሱስ ቸኩል እንጂ ፈጥነህ ብቅ በል /2/
አሜን ማራናታ ይቅርብህ ማባበል /2/
',0),(NULL,'በእውነት ላይ ጸንቼ','Fish2','በእውነት ላይ ጸንቼ እግሮቼን አበረታለሁ
የቃልህ ፍቺ ያበራል ጥበብን አገኛለሁ
እውነት እውነት እውነት አይለወጥ
በብር ወርቅ አይሸቀጥ
ሁሉን ሽጬ በፍቅር
እይዘዋለሁ በአንተ ምክር
ኢየሱስ አንተ ብቻ ነህ እግዚአብሔር /2/

የዓለም ብርሃን እውነተኛ ለሰዎች የምታበራ
ምስጥርን ሁሉ የምትገልጥ የጨለማን ስራ
የሚያስገርም ነው ያስደንቃል በብርሃንህ ብርሃን ታይቷል
በሞት ጥላ ሃገር ለነበሩትም አንተ ብቻ አዳኝ ሆነሃል

እውነተኛ የእግዚአብሔር ልጅ የማዳን ስልጣን ያለህ
አንተን የማወቅ እውቀት ልቦናን ሰጥተኸኝ
እኔና አባቴ - አባቴ አንድ ነን ብለህ
የአምላክነት ፍጻሜ ሁሉ ተላብሰህ የምትኖር ነህ

ቅዱስ ቅዱስ ያለህ የነበርክ በክብርም የምትመጣ
አልፋ ኦሜጋ አምላክ የሰማይ የምድር ጌታ
አመልክሃለሁ አንተን ብቻ ማንንም ሳልደርብ
አከብርሃለሁ በዙፋንህ ላይ ለብቻህ ስላለህ
',0),(NULL,'ወዴት እንደወደኩኝ አስቤ','Fish2','ወዴት እንደወደኩኝ አስቤ
ተመልሻለሁ ተጸጽቻለሁ ከልቤ
የአምላኬ ቁጣ ፍርዱ ሳያገኘኝ
ከእግሮቹ ስር ተደፋሁኝ
እስኪ ላውጋችሁ የብርታቴን ምክንያት
ማየት ለምትሹ የአምላኬን ፊት

ጻድቅ ጥበቡ ነው ንስሃ መግባት
ለበደሉ ስርየት ምህረት ማግኘት
ሳይደነድን ውስጡ በክፋት ሳይጸና
ታድሶ ይወጣል ከፍታ እንደገና /3/

የወደቀው እርሱ በክፉ የተመታ
ተነስቶ ይራመድ ጠላቱን ሊረታ
አቅም ያሳጣውን የራሱን ስንፍና
ፍጹም አስወግዶ ደግሞ ቶሎ ይጽና /3/

ጸጋ ተገፎበት እርቃኑን ያለ
በምርኮ አገር ላይ ሕይወቱ የመነመነ
አምላኩን ይማጸን በመመለስ አምኖ
ያመልጣል በእውነት ከክፉ ተጽዕኖ /3/
',0),(NULL,'በፍጹም ልቤ ፈልጌሃለሁ','Fish2','በፍጹም ልቤ ፈልጌሃለሁ
ኑሮ ካንተ ጋር ሙጥኝ ብያለሁ
ኃይሌ ታናሽም ቢሆን ሳስብህ ግን እበረታለሁ
አይዞህ ያልከኝን አይዞህ ገና እከተልህአለሁ /2/

የንፋስ ጭኹት በበዛበት በምድረ በዳ
ሳለሁ ያየኸኝ የባረከኝ ገብተህ ልቤ ጓዳ
በምህረት እሳት ከመሰዊያህ አፌን ዳስሰሃል
ዛሬማ ሌላ ነኝ የሱስ በእርግጥ ለኔ ቆመሃል

ምህረት ያየሁ የምህረት ልጅ ነኝ
የሰማይ ደጅ የተከፈተልኝ
ቀና ስል ዓይኖቼን ሳነሳ
አይሃለሁ ከዙፋንህ ስትነሳ

ጨክኖ መሄድ አስተምረኸኛል ተምሬአለሁ
እጄን አልስጥም ለሚጎትተኝ ወደ ኋላዬ
ጎዞዬ የድል ግቤም ጽኑ ነው እስከመጨረሻ
አውቄዋለሁ ድንግር አይለኝ የኔ መድረሻ
አንድሰ እንኳ ከቶ አያድክመኝ
ትምክህቴ ከንቱ እንዳይሆንብኝ
በዘላለም ተስፋ እሮጣለሁ
እጣ ፈንታዬንም አግኝቸዋለሁ
እስኪ ገለል ፈቀቅ ይበል ግዙፍ ተራራ
በውስጤ ብዙ ታምራት አለ አንድ ባንድ ላውራ
የጊዜ ሽሚያ አያስፈልግም ሁሉ ተይዟል
የሱስ ካንተ ጋር ውል አለኝና ስፍራዬ ሞልቷል
እነሳለሁ እንዳስለመድከኝ
የጨከነ መንፈስ ገብቶብኝ
ወዲህ ወድያ እንዳላመነታ
ጨርሻለሁ ሁሉን ባንተ ጌታ
',0),(NULL,'የምስራች','Fish2','የምስራች /2/ ያልሰሙ ጀሮዎች ይስሙ
የምስራች /2/ አንደበቶች ይናገሩ
ዝምታው ምንድነው? /2/ ይወራለት ክብሩ
የጌታ የየሱስ ማንነት ሚስጥሩ

እንዴት ይዘጋል ከቶ አንደበት
የእሱ ታምር ሞልቶ ባለበት
ምን ቀረንና በዚህስ ትውልድ ያላየነው ድንቃድንቆች
ማውራት ተስኖን ጸጥታው በዛ
ዘመናችንም ሮጦ እንደዋዛ

የቅድስና ውበት ጌጣችን
የእግዚአብሔር ፍቃድ መፈጸሚያችን
የኑሮ ጣዕም ደግሞ የሚያምረው በምስክር ቃል
ስንታጀብ ነው
አሊያ ግን ኃጢአት ይታገለናል
ድል ያለውን ስራ ስንጥል ወድቀናል

ማንም ሊሰራ የማይችልባት
ለሊትም አለች ጨለማ የዋጣት
ጸጋው ሳለልን ሊረዳን ሚችል በየሐድንበት
የሚሰጠን ድል
ቤተክርስቲያን ልቧ እርፍ እንዲል
ከጨለማ ኃይላት ጋር በሉ እንታገል

ትልቅ ነኝ ትንሽ የተከበርኩ የሚል ስንፍና በኛ አያምርም
በጊዜው ይሁን አለጊዜው ስለአዳኛችን መናገር ነው
ጅራፍ ሚስማሩን ችሎ እንዳዳነን
አንድ አምላክ ጌታ በስጋ የመጣ
',0),(NULL,'ቃል ኪዳኔን ላድስ','Fish2','ቃል ኪዳኔን ላድስ ዛሬስ ከየሱስ ጋር
ጠግቤያለሁና እኔስ በእርሱ ክብር
የምህረቱ ብርሃን ተስፋ ያረኩበት
ባርኮኛል ይክበር በጽኑ በረከት
የዘላለምን ክንዶች ከእኔ በታች አድርጓል
ሊሰራ ያለውን ጌታዬ/የሱሴ ሰርቶ አሳይቶኛል /2/

ለችግረኛና ለምስኪን የሚያስብ ምስጉን ነው
ብሎ ባለው ቃሉ ሲደግፈኝ አየሁ /2/
እግሮቼን እንደዋላ እግሮች አጠንክሮ
ባርኮኛል ይክበር ስለቴ ሁሉ ሰምሮ

አየሁ አየሁ ሲደግፈኝ አየሁ /2/

የተጣልኩ ሲመስለኝ ከፊቱ ለካ በእርሱ ህያው ነኝ 
በጽዮን አደባባይ ለቅርባኑ አቆመኝ  /2/
ምን ልበል ጌታዬ ልዘምረው እንጂ
ብዙ ነው እጅግ ብዙ ውለታህ ያለው በጄ

ለምስጋና እጆቼን ከልቤ ወደ እርሱ አነሳለሁ
እውነተኛ ቃሉን ደግሜ አስባለሁ /2/
ከእንግዲህ አንድስ እንኳ ከቶ አያድክመኝ
እርሱ ይበቃኛል ብቻውን ያዳነኝ
',0),(NULL,'ስብከቴና መዝሙሬ','Fish2','ስብከቴና መዝሙሬ 
በረከቴም ኃይሌ /2/

አንተን ብቻ እንዲያሳይ
አንተን ብቻ ኢየሱስ
አንተን ብቻ እንዲያሳይ አንተን /2/

ይህን ዓላማዬ ማድረግ
ይህን ዓላማዬ ዓላማዬ
ይህን ዓላማዬ ማድረግ
ይህን ዓላማዬ  /2/

ፍቅርህ ስር ሰዶ መሰረት ነውና
በፍጥረት ታሪክ ውስጥ ክብር አለህ የጸና
ሊረሳ የማይችል የቀራንዮ ጀግንነት
ምንም የማይገረስሰው አለህ ግሩም ስበት

ሞገሴ በአንተ ነው ትርጉም ሕይወት ያለኝ
በመንግስተ ሰማይ በእውነት የሚያኖረኝ
ቅንነትን ይዤ ስራህን አውጃለሁ
የልቤ ራዕይ ነህ ሁሌም አይሃለሁ
ይህን ዓላማዬ....

በጸጋህ ቃል ችሎት እምነቴ ቢያይልም
አንተ እንዳሰብከው ነገሮች ቢሆኑም
ፍጹም ልዘነጋው ከቶ የማይገባኝ
ክብርህን ማውራት ነው ለኔ የሚጠቅመኝ
ይህን ዓላማዬ....
ሞገሴ.....
ስብከቴና.....
',0),(NULL,'በተከፈቱልኝ የጽድቅ በሮች እገባለሁ','Fish2','በተከፈቱልኝ የጽድቅ በሮች እገባለሁ-እገባለሁ
ታምራቶችህን ናፍቄ በደስታ እሄዳለሁ-እሄዳለሁ
አልሰለችም ዘመናት ቢቆጠሩም ካንተ ጋራ
እለት እለት አዲስ ነህ ለእኔ የሱስ ጌታ
አታረጅም ግን በናፍቆት ዛሬም ትፈለጋለህ
እንግዲህ አምላኬ በልቤ ትልቅ ስፍራ አለህ

አልተጎዳሁም ስፈላልግህ
ዝግ ሆኖ አልታየም በኔ ላይ ቤትህ
ፊትህም ጠቁሮ አላገኘሁትም
ከመልካምነት አልተቀየርክም
ስለዚህ ምን ብዬ እርቃለሁ
ካንተ ጋር መሆን መርጫለሁ /2/
 አልሰለችም ….

የበረከት ምንጭ ጉድጏዴ ነህ
ልቤን አስፍቼ የምቀዳህ
ጥጋቤ ለኔ ፍጹም እርካታ
የኑሮ ትርጉም የቤቴ አለኝታ
ጠዋት ቢሆን እንኳ ሃዘኔታ
ማምሻው ይሰማል ባንተ ደስታ /2/
በተከፈቱልኝ …..

የሚረዳኝን ጸጋ ፈልጌ
ወደ ዙፋንህ ልቤን አድርጌ
ሰብስብ እያልኩኝ በፍቅርህ ጥላ
እታመናለሁ ባንተ ከለላ
አምናለሁ መሰረቴ ነህ
በጽናት የምታነጽብህ /2/',0),(NULL,'እረፍቴ ባንተ ነው መድሃኒቴ','Fish2','እረፍቴ ባንተ ነው መድሃኒቴ /2/
የዘላለም ተስፋ ውድ አባቴ
እርፍቴ ባንተ ነው መድሃኒቴ 
ሰላሜ ባንተ ነው መድሃኒቴ /2/
የዘላለም ተስፋ ውድ አባቴ
ሰላሜ ባንተ ነው መድሃኒቴ

ፈውስ መድሃኒት ነው /3/
አይኔን አነሳላሁ ወደ ተራሮችህ
ረዳቴ አለና ከዘላለም ክንዶችህ
ከንቱ ምናምን አላረግም ትምክህት
በቂ ነህ በቂ ነህ አንተ በእውነት /2/

ወደ እኔ መጥተሀል ሰላም ሰላም ብለህ
የአብርሃምን ተስፋ ቃሉን ተሸክመህ
መዳን ሆኖልኛል እዳዬ ተከፍሎ
በፍቅርህ /2/ ደስታን ተገናኘሁ /2/

ሁሉ በቂ ሆኗል የለም የጎደለ
በረከቴ በአንተ ዳግም ሙሉ ሆነ
ተገናኝተናል እኔና አንተ በአንድ ልብ
ተረዳሁ /2/ እውነትህን ሳስብ /2/
',0),(NULL,'አምላክ አለኝ','Fekade1','አምላክ አለኝ የማመልከው የማከብረው የምወደው
በልቤ ዙፋን ላይ የማነግሰው የማነግሰው /2/*

አለም ብትደልለኝ ብትጋብዘኝ
ወርቋንና ውበትዋን ብታሳየኝ
ተቀድመሻል አለም እላታአለሁ
የሱስ ነው አምላኬ እነግራታለሁ

ከምንም የማላወዳድረው
ነፍሴን ዘወትር የምታስከብረው
በኔ ከፍ ብሎ የምታየው
የምወደው ጌታ ኢየሱስ ነው

ከብርና ከወርቅ የሚበልጠው
ከምንም ከቶ የማላስተያየው
የልቤ እርካታ ኢየሱስ ነው
ከማንም አብልጬ የምወደው

ጉልበቴን ለሌላ ፍጹም አልሰጥ
ልቤም ለየሱስ ብቻ ላፍስስ
በምርጫዬ ሁሉ እንዲነግስ
ራሴን ሰጥቼአለሁ ለኢየሱስ
',0),(NULL,'ደሙ ትምክህቴ ነው','Fekade1','ደሙ ትምክህቴ ነው /2/
በቀራንዮ መስቀል የፈሰሰው
የየሱስ ደም ትምክህቴ ነው /2/*

ከክፉ ህሊና ያነጻኛል
በሰይጣን ራስ ላይ ያቁመኛል
ጠላቴ በጎኔ አይቆምም
የየሱስ ደም ረግጦ አይቀርብም

አውቃለሁኝ እኔ ጽድቅ የለኝም
በእጆቼ ስራ ከቶ አልጸድቅም
ደሙ ግን ትምክህቴ ሆኖልኛል
ዘወትር ሃጥያቴን ያጥብልኛል

በአብ ዘንድ የሚኖር ጠበቃ አለኝ
ለኔ የሚያዝንልኝ ሚራራልኝ
በመስቀል ተሰቅሎ የደማልኝ
ሕይወቱ ለኔ ሲል የሰዋልኝ


በጸጋው ዙፋን ስር ተደፍቼ
ሳለቅስ አይጨክንም ውድ አምላኬ
በዘለአለም መንፈስ በፈሰሰው
በደሙ ያነጻኛል በቆረጠው
',0),(NULL,'ነፍሴ ሆይ','Fekade1','ነፍሴ ሆይ እግዚአብሔርን ባርኪው /2/ 2
ሃጥያትሽን ይቅር የሚል
ደዌሽንም የሚፈውስ
ነፍሴ ሆይ እግዚአብሔርን ባርኪው /2/*

መድሃኒትሽ ሆኖ ታድጎሻል
በምህረቱ እሱ ከልሎሻል
ከጥፋት ጉድጓድም አድኖሻል
ከጥፋት ፍላጻ ጠብቆሻል

ከስራትሽ ፈቶ ነጻ አወጣሽ
ከሃዝንም አርቆ ደስታን ሞላሽ
ምስጋናውን አትረሺ ስሙን ባርኪ
እለት እለት የሱን ማዳን አውሪ

በዘለአለም ፍቅሩ ስቦሻል
ከገሃነም ስቃይ ሰውሮሻል
ድንገት በከበረው ሰረገላ
አኑሮሻልና በከለላ
',0),(NULL,'ዝናው ገናና ነው','Fekade1','ዝናው ገናና ነው ኢየሱስ ዝናው ገናና ነው
እንደ ጥንቱ አዳኝ ነው ፈዋሽ ነው
ባለ ብዙ ምህረት ነው /2/*

አለም ሳይፈጠር የነበረው - ዝናው ገናና ነው
ፍጥረታትን ሁሉ የፈጠረው - ዝናው ገናና ነው /3/
እኛ የምናመልከው ኤልሻዳይ ነው

ሽባውን ፈውሶ ያዘለለው - ዝናው ገናና ነው
የደንቆሮ ጆሮ የከፈተው - ዝናው ገናና ነው /3/
አምላካችን ኢየሱስ ሁሉም ቻይ ነው

ሞትን ድል አርጎ የተነሳው - ዝናው ገናና ነው
አለምም በስልጣን የሚገዛው - ዝናው ገናና ነው /3/
ያዳነን ኢየሱስ ድንቅ አምላክ ነው

ሕዝቡን በምህረት የጎበኘው - ዝናው ገናና ነው
የዲያብሎስን ስራ ያፈረሰው - ዝናው ገናና ነው /3/
የሚመስለው የለም ሁሉን ቻይ ነው
',0),(NULL,'እግዚአብሔር ብርሃኔና መድሃኒቴ','Fekade1','እግዚአብሔር ብርሃኔና መድሃኒቴ ነው
የሚያስፈራኝ ማን ነው?
እግዚአብሔር የሕይወቴ መታመኛ ነው
የሚያስደነግጠኝ ማን ነው?
ሰራዊት ቢሰፍብኝ ሰልፍም ቢነሳብኝ
በአምላኬ ተማምኜ ድል እጠብቃለሁ በምስጋና ቆሜ

የሞት ጣር ስይዘኝ አመጽ ሲያስፈራኝ
ወጥመድ በፊቴ ሲዘረጋብኝ
የናዝሬቱ ኢየሱስ ሲደረስልኝ
አያለሁ ጠላቴን ሲያነደቅልኝ

ጠላት አምላክህ ወዴት ነው? ሲለኝ
ሸክም በዝቶብኝ ሲያንገላተኝ
ዙሪያዬ ጨልሞ ሲከብደብኝ
አያለሁ አምላኬን ሲያበራልኝ

ተራራውን ዝቅ ጌታ አድርጎልኝ
ምድረ በዳውን አለምልሞልኝ
የልቤንም መሻት ፈጽሞልኝ
አያለሁ ሰልፉንም በትኖልኝ

ማቄንም ቀዶ እንባዬን ጠርጎ
የውስጤን ሀዘን ኢየሱስ ወስዶ
ቅጥሩን በምህረት አዘልሎ
አያለሁ አምላኬን ደስታ ሞልቶልኝ
',0),(NULL,'ማን ነው?','Fekade1','ማን ነው? ባህሩን ከፍሎ ያሻገረኝ
ማን ነው? በክንፎቹ ጥላ የሸሸገኝ
ከጠላት ፍላጻ የሰወረኝ
እግሮቼን ከረግረግ ያወጣቸው
ከአለም ጭጋጋት ያዳናቸው
ዛሬ በምስጋና ያቆማቸው
ባለውለታዬ አምላኬ/ኢየሱስ ነው /2/

ጥፋቴን የሚሻ ባለአንታዬ
ሊውጠኝ ሲመጣ ከኃላዬ
እያገሳ ሳየው ተጨንቄ
የምይዘውን ሳጣ ተስፋ አጥቼ
ኢየሱስ ደረሰልኝ ከለላዬ

ማእበል ተነስቶ በዙሪያዬ
ወጀቡ ሲያውክኝ ተንቀጥቅጬ
ለመውደቅ ሲቃጣኝ ተንገድግቼ
በስጋት ስጠራው ውዱ አምላኬ
ፈጥኖ ደረሰልኝ ኢየሱሴ

እግዚአብሔር አለቴ መድሃኒቴ
አምባና መጠጊያዬ ረዳቴ
መታመኛዬና መመኪያዬ
ሆኖልኝ አቅሜ ጉልበቴ
ስሙ ይንገስልኝ ኢየሱሴ

የዘንዶውን እራስ ቀጥቅጦልኝ
ያስጨነቀኝን ቀንበር ሰብሮልኝ
የሞት ጥላ ከኔ ወስዶልኝ
እግሮቼን በአለት ላይ አቆመልኝ
ኢየሱሴ ስሙ ይንገስልኝ
',0),(NULL,'ዛሬም አይኖቼ አንተን ያያሉ','Fekade1','ዛሬም አይኖቼ አንተን ያያሉ
የመስቀልህ ውበት ይመለከታሉ
ወደ ጸጋህ ዙፋን ዳግም ያቀናሉ /2/
ምህረት ወደ አለበት ነፍሴ ወደ ምትረካበት
ሕይወት እስከ ትርፉ ወደ ማገኝበት /2/ /2/*

ማለዳ ማለዳ ሁልጊዜ አዲስ ነህ
ከቶ የማትጠገብ የሕይወት መና ነህ
ለነፍሴ ፈውስ ነህ የሱስ ታስፈልገኛለህ

ወረት የሌለብህ የማትለዋወጥ
ፍቅርህ ለዘላለም ከቶ የማይናወጥ
እንግዲህ የሕይወቴ አንባ ይሆናል ከለላ

በጸጋ ዙፋን ስር ሁሌ ተደፍቼ
የሚያስፈልገኝን በረከት አግኝቼ
በደስታ እንድሞላ ጌታ ልቤ ወደንተ ያቅና

ወደ ግራና ቀኝ አይኖቼ ሳያዩ
በእምነት በተስፋም አንተ ይመለከቱ
ሰላምህ በጭንቄ እንዲፈስ ጽድቄ እንዲትረፈረፍ
',0),(NULL,'ልቤ ጽኑ ነው','Fekade1','ልቤ ጽኑ ነው ልቤ ጽኑ በጌታዬ
ድልን ይሰጠኛል በመንገዴ /2/
እግዚአብሔር አምላኬ ጨለማን ያበራል
ተራራውን ሜዳ አድርጎ ይሰራል
ኤልሻዳይ ነው የሱስ ሁሉ ይቻለዋል

ተራሮች ወደ ባህር ቢወሰዱ
ነገሮችን ርቀው ቢጨልሙ
አምላኬ መጠጊያ ሃይሌ ነው
ባገኜም ታላቅ ፈተናም ረዳቴ ነው

በሸሎቆ ቢሆን በተራራ
በእምነት እጓዛለሁ ሳልፈራ
የዘለአለም ክንዱን ተደግፌ
በጌታ እኖራለሁ በስሙ ተጠብቄ

እግሮቼ ሲሄዱ በመንገዱ
በጠላት አሽክላ ሲጠለፉ
አሳልፎ አይሰጥም የማመልከው
የነገስታት ንጉስ የሱስ ታዳጊ ነው

አይኖቼ ዘወትር ወደ አምላኬ
አድርጌ ስጠብቅ ረዳቴ
ፈጥኖ ይደርስልኛል ይረዳኛል
በከፍታዎች ላይ በድል ያስክሄደኛል
',0),(NULL,'ጊዜ አለው ለሁሉም','Fekade1','ጊዜ አለው ለሁሉም ጊዜ አለው /2/
ለሀዘንም ለደስታም ጊዜ አለው
ጌታ ሁሉን እስኪያመጣው ጊዜ አለው /2/*

ነገርን ሁሉ በጊዜው ውብ አርጎ የሰራው
ሰማይና ምድርን አስተካክሎ በቃሉ ያጸናው
ዛሬም ቢሆን ጌታ ሁሉ ይቻለዋል
ሁሉንም በጊዜው እሱ ያመጣዋል

እርምጃው ቢዘገይ እስኪመጣ አላማ አለው ጌታ
አምላኩን ሚጠብቅ ሳይረታ ድል የእሱ ነውና
ጻድቅ በጽናቱ ምርኮን ይካፈላል
ምኞቱን መሻቱን ሁሉ ይቀበላል

ጻድቅ በመታመን በጸጥታ ይኖራል በርጋታ
እርምጃውን ጠንቅቆ ይራመዳል በሁሉ ያስተውላል
የጥሞና ጊዜ ወስዶ ይማልዳል
አይቸኩልም ፍጹም አምላኩን ያደርጋል

እግዚአብሔር ለጠራው ለመረጠው ሁሉም ለበጎ ነው
መውጣቱ መውረዱ መዋረዱ ለጻድቅ ክብሩ ነው
ማቁም ይቀደዳል ሃዘኑም ይቀራል
ሁሉ ተስተካክሎ ምስጋናን ይሰዋል
',0),(NULL,'ስራችንን ሰራህልን','Fekade1','ስራችንን ሰራህልን - ልባችንን አሳረፍክልን
ከገመትነው በላይ - በረከትህ በዛልን
ስምህ ይክበርልን አምላካችን
ከፍ በል ጌታችን ባለውለታችን /2/*

ያላሰብነውን ያልገመትነውን
ድንቅ አሳየህን ያልጠበቅነውን
ታምራትህ በዝቶ ጸጋህ ተረፍርፎ
መግለጽ አልቻለውም ከተራ ቁጥር አልፎ

ዘሩን ዘርተን ነበር በጸሎት በለቅሶ
በአይናችን አየን ዛሬ ተመልሶ
አሁን ግን በደስታ ነዶ ተሸከመን
በቤትህ ቆመናል ምስጋናን ተሞልተን

አህዛብ ተሰብስበው ስለእኛ አወሩ
የእግዚአብሔር ልጆች ተባረኩ አሉ
አምላካቸው ሁሉ አረገ ተባለ
ከዚህ የበለጠ ምን የሚሻል አለ?

አገልጋዮችህ የእሳት ነበልባል
አድርገሃቸው በፊትህ ቆሞዋል
አህዛብ በሙሉም መዳንህን አይቷል
ፊትህን በክብር አንተ ሞልተኸዋል
',0),(NULL,'በደስታ አንድ ቀን','Fekade1','በደስታ አንድ ቀን በሰማይ ላይ
የተሰዋልን ጌታን ስናይ
ከመላእክቱ ጋር
ሆ እያልን እንፈነጫለን
     ሆ እያልን እንዘምራለን /2/ /2/*

መውጣቱንም መውረዱንም አይተን
መራቡንም መርገሙን ቀምሰን
ስለስሙ ነቀፌታን ችለን
ተስፋ ሳንቆርጥ ሁሉን አሳልፈን

በመከራ ሁሉ ተፈትነን
ሳንረታ ላምላካችን ታምነን
ለአለም ሁሉ ወንጌሉን አውጀን
ኢየሱስን በምድር አስከብረን

ሃጥያትን ሰይጣንም እያለ
ሳንሰለች ጌታን አገልግለን
በውቢቷ ኢዮሩሳሌም ላይ
ደስታ ይኖራል ጌታችን ስናይ

ልብሳችንን በበጉ ደም አጥበን
ወደ ሰማይ አርገን እንሄዳለን
እንባችንን የሱስ ያብስና
እንኖራለን እዛ ስንዝናና

የአምላካችን ዙፋን እንከፍትና
በደስታ ዘንባባ እንይዝ እና
ለዘለአለም እዛ እንኖራለን
በመንግስቱ እንፈነጫለን 
',0),(NULL,'እንደገና አምልኮ','Gedion1','ተነስ ሳይሉኝ ብድግ አልኩኝና
ሰዎች ሳይገፋፉኝ እልልታ ለጌታ
ራሴ በፈቃዴ በገና ያዝኩና
ለሰማዩ ንጉስ ክብር ሰጠሁታ
ይኸውና አምልኮ ይኸውና2 /…/
እንደገና አምልኮ እንደገና 2 /…/

ውለታው በዝቶ ፍቅሩ አይሎ/2/
እንዴት ይቻላል መቀመጥ ዝም ብሎ
ያለቀስቃሽ ነው አምልኮ የማውቀው/2/
ምስጋና ያለው በልቤ ውስጥ ነው

ሰዎች ሳይነግሩኝ ልነሣ ላጨብጭብ/2/
ፊቱ ቀርቤ በደስታ ላሸብሽብ
በመንፈስ ቅዱስ የሆነው ሠላሜ/2/
ያዘምረኛል መሰዊያው ላይ ቆሜ

ይኸውና  አምልኮ /2 /…/
እንደገና አምልኮ  /2 /…/

እጄን ዘረጋሁ ላከብረው ላደንቀው/2/
እንዳንተ ያለ ማን አለ እንድለው
ከፈቃዴ ነው ለውዴ መዝሙሬ/2/
ሁሌ ማመጣው አዳዲሱን ቅኔ

ይኸውና  አምልኮ /2 /…/
እንደገና አምልኮ  /2 /…/
',0),(NULL,'ፀጋው ይበቃኛል','Gedion1','ፀጋው ይበቃኛል
ፀጋው አኑሮኛል/2/

በቃኝ ሰላሜ በቃኝ -ሰላሜ
በቃኝ እረፍቴ በቃኝ/2/
በቃኝ  መዳኔ በቃኝ- መዳኔ
በቃኝ ሕይወቴ በቃኝ
አታውሩልኝ አታድክሙኝ
ከዚህ ወዲያ አታሳዪኝ
ብያለው በቃኝ

ደሣሣ ጉጆዬ ውስጥ ቁጭ ብዬ
እንደወንዝ ይፈስልኛል ሠላሜ
ሳልገላበጥ ይነጋል ለሊቱ
ተከብቤ በብዙ ምህረቱ
ምህረቱይቅርታው በቃኝ/...../

እጠግባለሁኝ ሳልበላ ሳልጠጣ
እያየሁኝ ውበቱን ክብሩን ብቻ
እያገነነ ጸጋና ሞገሱን
ተገኘሁኝ በልጬ ሌሎቹን

ፀጋውብቻሞገሱበቃኝ /4/
ፀጋው ይበቃኛል ….

እርምጃዎቼ ሁሉ በጸጥታ
ከፊት ስለወጣልኝ የኔ ጌታ
የጉልበቱን ልክ አውቄ አረፍኩኝ
ትልቅ ሲሉኝ የሱስ ብቻ አልኩኝ
ሃሌ ሃሌሉያ  /6/   ሃሌሉያ /8/
',0),(NULL,'ያዋጣኛል','Gedion1','ያዋጣሃል ወይ? አዎ ያዋጣኛል
ይሻልሃል ወይ? አዎ ይሻለኛል
ያኖረሃል ወይ? አዎ ያኖረኛል  /2/

እየሱስ ያዋጣል ብዬ
ወጣሁኝ እንዲህ ደፍሬ /2/

በለቅሶ ሸለቆ ውስጥ በረከቱን ያኖራል
አሰራሩ ልዩ ነው ከሰው ችሎታ ያልፋል
እርሱን ጌታዬ ብሎት እስቲ ማነው የጠፋ
ታሪክ ይጠየቅና ለሰው ሁሉ ይወራ

ያዋጣሃል ወይ? …..

በጭንቅ ቀን ያቆያል ጉደለት እየሸፈነ
የተበላሸ ነገር ራሱ እያሳመረ
ጥቂቱን እያበዛ እኛን ያስገርምና
ውዳሴ ይቀበላል ተራራ ያፈርስና
እናንትም ኑ ተዋወቁት
እናንትም ኑእስቲ እዩት
እናንትም ኑ እረፉበት
እናንትም ኑ ተመኩበት

ጉልበት የሌለውን ሰው ምንኛ ደጋገፈው
የተገፋውን ደግሞ ሳበና አቀረበው
እንዲህ ያለ ጌታ ነው እየሱስ የሚባለው
እውነተኛ መውደዱ ከሰዎች የሚለየው

ያዋጣልያኖራል /2/ያዋጣል ያኖራል /4/  2
',0),(NULL,'አልሰምህም ወይ?','Gedion1','ሠላም ሠላም ሠላም ሠላም
ሠላም ሠላም
የኔ ሠፈር ሠላም ሠላም
ሠላም ሠላም

አልሰማህም ወይ ዲያብሎስ ጠላቴ
ሠፈሬ ደህና ሠላም ነው እቤቴ2   /2/

ሠላም የሰጠችኝ ዓለም አይደለችም
በጓዳዬ ጉዳይ ከቶ አያገባትም
መንፈስ ቅዱስ ብዬ እጄን ስዘረጋ
ጭንቀቴን ወሰደው አጽናኙ መጣና/3/

ድካሜ ብዙ ነው አዎ ጎስቋላ ነኝ
ልቤን ምጥልበት ወርቅና ብር የለኝ
ምንም ችግር የለም አንድ ነገር ገባኝ
የላይኛው ሀብቴን ማንም አይነካብኝ/3/

ሠላም ሠላም የኔ ሰፈር ሰላም2/2/

በተዘጋውን በር ሳያንኳኳ ገብቶ
ምስጢሬን አወቀው ድብቁን ከፋፍቶ
ሠላም ላንተ ይሁን አለኝ እቅፍ አርጎኝ
እንዲህ ነው ጌታዬ በጠላት ፊት ቀባኝ/3/

አልሰማህም ወይ ዲያብሎስ ጠላቴ ...

ሠፈሬ ደህና ሠላም ነው እቤቴ2  /2/
ሠላም ሠላም የኔ ሰፈር ሰላም2 /2/
',0),(NULL,'የውርስ ሀብቴ','Gedion1','ጥንት እነዳዊት ሲያመልኩ
የክብሩን መንፈስ ሲጠሩ
ጨርቃቸው ወልቆ ሲታዩ
ስራ ፈታችሁ ተባሉ
እነሱም መልሰው ተናገሩ
ኧረ ከዚህም በላይ እንሆናለን አሉ

የውርስ ሀብቴ ነው አምልኮዬ
የውርስ ሀብቴ ነው ዝማሬዬ
አደራ አሉኝ አባቶቼ
ጎንበስቀና ልበል መቅደሱ ገብቼ /2/

የአደራ ቃል አለብኝ  - አባቶቼ የነገሩኝ
አምልኮ ነው ያወረሱኝ - በኑዛዜ ያዙልኝ
በእውነት በመንፈስ ስዘምር
አየሁኝ የጠላት ሠፈር ሲሸበር
ይነሣ ይነሣ ማሴንቆ ይነሣ
ይመታ ይመታ ከበሮ ይመታ
ይነሣ ይነሣ ምስጋናው ይነሣ
ይነሣ ይነሣ እልልታ ይነሣ
ለንጉሡ አሜን /4/

በጦር ሜዳ በእስር ቤት
በምቾት ቢሆን በጉድለት
ሲደረድሩ በገና
የእግዚአብሔር ጣት ስትመጣ
ይህ ነበር ክብራቸው የቀደሙት
ዛሬም እንዲደገም እኔስ ተመኘሁት

የውርስ ሀብቴ ነው አምልኮዬ....
ይነሣ ይነሣ ማሴንቆ ይነሣ ...
የሚመስለው ጠፋ ተወዳዳሪ
የሚመስለው ታጣ ተወዳዳሪ

ማን አለ እስቲ አለ ተወዳዳሪ
የት አለ እስቲ ተወዳዳሪ /2/
',0),(NULL,'ተገለበጠ','Gedion1','በአንድ ሌሊት በአንድ ጀንበር /2/
ተገለበጠ ነገር ኧሀተገለበጠ ነገር ኦሆ/2/

እኔማ ሞኙ /2/ አኩርፌ ነበር
ኋላ ቀረሁኝ ብዬለሰው ስናገር
ይሄ እግዚአብሔር ድንገት ከተፍ ሲል አፈርኩኝ
ብዙ የሮጡትን ከፊት ቀደመና - ሰራልኝ

ባለግርማ ነው /አሃ/ ሞገስም አለው
እንዲሆን ካለ /2/ መሆን ብቻ ነው
አሁንማ ገባኝ በቃ አይለምደኝም ማጉረምረም
አምላኬ ትልቅ ነው ሁልጊዜም መልካም ነው አላፍርም

ተገለበጠ /3/ ተንከባለለ /2/

የሌለኝ መጣ /2/ ጓዳዬን ሞላ
ተአምር ነው እንጂ ተአምር አይደለም ሌላ
ኑሮዬ እንዲህ ነው ያመለኩት ጌታ - ሃይሌ ነው
ድንጋይ ሰንጥቆ ነው ውሃ ያፈለቀው - ልጠጣው

በቀጠረው ቀን ወደኔ መጣ
ፊቱን ሲያሳየኝ ምሬቴ ጠፋ
ስመለከተው ሁሉ ደህና ነው
ክብሩ ሲነካኝ ተፈውሻለሁ /2/ 2
',0),(NULL,'አዋርዳታለሁ','Gedion1','የበዓል ነቢያትን አሳፍሬ
ሰማይ አስከፍቼ አስዘግቼ
እንዴት ኤዛቤልን እፈራታለሁ?
ለምን ልሙት ብዬ እጸልያለሁ? ለምንለምን

ገና አዋርዳታለሁ
ገና እበቀላታለሁ
ገና በቅባቱ ጉልበት
ገና ይሆናል ነፃነት/2/

ብዙ ሥራ አለብኝ ገና ገና
ባለአደራ ነኝ  ገና ገና
እስከዳር ሄዳለሁ ገና ገና
ምግብ በልቻለሁገና ገና

የአባቶቼ አምላክገና ገና
ብቻ እስኪመለክ ገና ገና
ውርርድ አልለቅምገና ገና
በወንጌል አላፍርምገና ገና
ወንጌል ይሰበካል ገና
ቀንበር ይሰበራል ገና
ኢየሱስ በፍቅር ገና
ያሸንፋል ሁሉን ገና

አልሞትም እኖራለሁ ገናገና
ለሌሎች እተርፋለሁ ገናገና
በእጥፍ የሚቀቡ ገናገና
እነኤልሣዕ አሉ ገናገና
ገና ገና /2/

ሰማይ ይከፈታል ገናገና
ቢያስፈልግ ይዘጋል ገናገና
ልክ እንደለመድኩት ገናገና
ዛሬም አለኝ ጉልበትገናገና
',0),(NULL,'እጆቹ ስለሰረቱ','Gedion1','አመሰግነውአለሁ /3/
እጆቹ ስለሰረት- ስራው ሁሉ
ስለ ሰፊ ችሎታው - ስለ ሃይሉ
አመሰግነውአለሁ

ይሄ እግዚአብሔር እንዴት ልዩ ነው
በአንድ ቃል ብቻ ሰማይን ሰራው
ጨረቃና ጸሐይ ጊዜ ጠብቀው
ይፈራረቃሉ የእሱን ድምጽ ሰምተው
አመሰግነውአለሁ....

ተራራ ና ሜዳ ወንዝ እና ሸሎቆ
አራዊት እንስሳት አእዋፋትን ፈጥሮ
ምንም የሌላት ምድር እንዲህ አማረባት
ፍጥረታት ለጌታ ክብር አመጡለት
ሁሉን ሰሪ ሁሉን ፈጣሪ /4/

ቀንና ለሊቱን አጭሩን ረጁሙን
አያስደንቅም ወይ ሲሰራ ብቻውን
በዝቷል ጥበቡ አይመረመርም
የአድናቆትቃላት ችለው አይገልጽቱም
አመሰግነውአለሁ .....

አምልኮዬ - ስለጌትነቱ
አምልኮዬ - ስለታላቅነቱ
አምልኮዬ - ስለማይጠፋ ክብሩ
አምልኮዬ - ስለግርማ ሞገሱ
አመሰግነዋአለሁ /3/
',0),(NULL,'የእኛ ጌታ','Gedion1','አየነው አየነው - ደክሞት ኃያሉ
ጥግ ይዞ ቁጭ አለ - ደክሞት ኃይሉ
አየነው አየነው - ደክሞት ጎበዙ
አልቻለም ቁጭ አለ - ደክሞት ጎበዙ

የኛ የሱስ - ዛሬም ብርቱ
የኛ ጌታ - ዛሬም ብርቱ
እርሱ ብቻ - ዛሬም ብርቱ /2/

ክብሩ ዝናው - ትዝታ ሆኖ
ሲያወራልን - እያለ ድሮ
ለመጽናናት- ይሞካክራል
የዛሬውን - አያርገው ይላል
ታድያ ምን ያደርጋል?

አየነው ….

እዩኝ እዩኝ - ሲል የነበረ
መደበቂያ - ዋሻ ፈለገ
የኛስ ጌታ - ዙፋኑ ላይ ነው
ታላቅ ኃይሉን - እንደያዘ ነው
ጌታችን - ብርቱ ነው

ብርቱ - ብርቱ ብርቱ
ብርቱ -     የኛ ጌታ
ሃያል - ሃያል ሃያል
ሃያል  - አሸንፎአል  /2/

ጎበዝ ጀግና ኃያል - የት አለ?
ያልፍበታል - አድሮ ከዋለ
መታሰቢያው - ስሙም ይጠፋል
ከሌላው ሰው - በምን ይለያል?
ከእኛ ጋር ቁጭ ብሎአል
ብርቱ  …..
አየነው ….
',0)