INSERT INTO `lyric` (`_id`, `lyric_title`, `lyric_album_id`, `lyric_actual_lyric`, `lyric_is_fav`) VALUES  (NULL,'ማደሪያዎችህ','Yemserach2','ማደሪያዎችህ እንደምን የተወደዱ ናቸው
ማደሪያዎችህ እንደምን የተወደዱ ናቸው

የተደረገልኝ ባንተ ማደሪያዎች
ያየሁትን ሁሉ ያን ታላቅ ምህረት
የተደረገልኝ ባንተ ማደሪያዎች
ያገኘሁትን ቸርነት በጎነት
ዛሬ በድል ቆሜ በፈቀድከው ስፍራው
ምስጋናን ላሰማ ጌታ በመቅደስህ ሃሌሉያ
ምስጋናን ላሰማ የሱስ በማደሪያህ /2/
ምስጋናን ላሰማ

አንተ ያዳንካቸው
ከሞት ያወጣሃቸው
ስራህን የሚያወሩ/ ከእኔ ጋር የሚያከብሩህ
እጅግ ብዙ ናቸው /2/
በእውነት አምድ ላይ
በጽዮን አደባባይ
ምስጋናን ላሰማ /2/

ቸርነትህ ብዙ ነውና
ምስጋናን ላሰማ
ማዳንህ ለልጅ ልጅ ነውና
ምስጋናን ላሰማ
አንተን ማመስገን ደስ ይለና
ምስጋናን ላሰማ
ሳንወድህ ስለወደድከን
በምስጋና እንመካ
ሳንመርጥህ ስለመረጥከን
በክብርህ እንጓደድ /2/

የሰራዊት አምላክ ሆይ
ማደሪያዎችህ
እንደምን የተወደዱ ናቸው
ነፍሴ ሆይ የእግዚአብሔርን አደባባዮች
ትወድሃለች ትናፍቅህም አለች
',0),(NULL,'ድምጹን አውቃለሁ','Yemserach2','ከክፉ ነገር መንጋ ይጠብቃል
ጠቢቡ ኢየሱስ ሁሉንም ያውቃል
ለደካማዎች ከልቡ የሚያዝነው
ትሁት አምላክ ነው ቀንበሩ ልዝብ
ተማምኜበት በሱ አላፍርም
ታማኝ አምላክ ነው በቃሉ አይዋሽም
የልቤን መሻት እሱ ያውቀዋል
ብፈልገው የሱስ ያደርግልኛል

የሱስ እረኛዬ ነው
ጠባቂዬ የምለው
እሱ ተስፋዬ ነው
ተመስገን ልበለው
ሁሉን በእሱ አገኘሁ /2/
ድምጹን አውቃለሁ - የእረኛዬን
እሱም ይመልሳል - ልመናዬን /2/

በባእድ ሐገር ከግብጻን ድንኳን
ነፍሴን ፈለጋት በእጁ ሊያድናት
በብቸኝነት በጨለማ ውስጥ
በላዬ አበራ ጨለማዬን ሊለውጥ
አንዴ ወዶኛል እሱ አይተወኝ
እኔን ረስቶ ከእጁ አይጥለኝ
ተገዳዳሪ አምሳያም የለው
ብቸኛ አምላኬ የሱስ እረኛዬ ነው
የሱስ ...

ታላቁ እረኛ - የበጎች መሪ
የሁሉ ጌታ - ግሩም መካሪ
የጌታ ኢየሱስ - የአባቴ በረት
ሰላምና እረፍት ደስታ አለበት
በትሩ ሙርኩዜ - ድጋፍ ሆኖኛል
በድካም ጊዜ - ሃይል ይሰጠኛል
ውለታውንማ መቼ ማልከፍለው
ተመስገን እያልኩ ስሙን ሁሌ ላክብረው
የሱስ .....
',0),(NULL,'መባረክን ባርከኝ','Yemserach2','ጽዮን ምኞቷ ተስፋዋ መብዛት
በዙሪያዋ ያለውን ሁሉ ለመውረስ
ብዝበዛው ይቸኩል ምርኮውም ይፍጠን
በአመታት መሃል ስራህ ይፈጸም

አቤቱ ጌታችን/አምላካችን መባርክም ባርከን
ሕዝብህንም አብዛ ያገሩቱን ዳርቻ ሁሉ አስፋ /2/

ያዕቤጽ ለመነ እንድታሰፋለት
የሰጠኸውን እንድትባርክለት
ዛሬ ልመናዬ የኔም ጸሎት
ሕዝቤ እንዲሰጠኝ የልቤን መሻት

ትንሽ የወይን ግንድ ከግብጽ አውጥሃት
አህዛብ አባርረህ እርሷን ተከልካት
ተማመንክባትም እጅግ አበበች
በጥላዎችዋ ምድርን ከደነች
ለአብርሃም ያረከው ለይሳቅ የማልከውን
ለእስራኤል ዘለአለም ኪዳንን ይሁን ያለከውን
ቃልህ እስኪ መጣ ባርያህ ቢጠብቅም
ያስረገጥከውን ምድር መውረሱ አልቀረም
ዛሬም አንተ የእግዚአብሔር ሰው ሆይ
በፊትህ ያለውን በእምነት ስታይ

ለአንተ ከነአን ለርስትህ ገመድ
የምትሰፋበት ከህዝብ ወደ ህዝብ
ሊያወርስህ ወዶ ቃል የገባው
የሱስ የጥንቱ አሁንም ያው ነው  /2/

',0),(NULL,'መንፈስህ ያስፈልገኛል','Yemserach2','የጽዮን ጉዞ ትርጉም ይገባኛል
በሕይወቴ ውስጥ ጸጋህ ይበዛል
ፍሬ እንዳፈራ እሱ ያደርገኛል
መንፈስህ ይውረድ ያስፈልገኛል

መንፈስህ ያስፈልገኛል
ሕይወቴን ይለውጠዋል
በእጥፉ ይትረፈረፍልኝ
የሱስ ሆይ መንፈስህ ይብዛልኝ

ያስፈልገኛል እጥፍ መንፈስህ
የሚያስጉዞኝ በጽናት በቤትህ
የሚያጽናናኝ የሚደግፈኝ
ለሰማይ መንግስት የሚያዘጋጀኝ

ሃይልህን ሳገኝ እበረታለሁ
በፊትህ ቆሜ አከብርህአለሁ
እጥፍ መንፈስህ ዛሬም ይብዛልኝ
የኃለኛውን ዝናብ ላክልኝ

ያስፈልገኛል እጥፍ መንፈስህ
የሚያስጉዞኝ በጽናት በቤትህ
የሚያጽናናኝ የሚደግፈኝ
ለሰማይ መንግስት የሚያዘጋጀኝ

በሕይወቴ ያለው የማይጠቅመኝ
ያቃጥለዋል የማይረባኝ
እሳትህ ይንደድ ዛሬም በላዬ
ሕይወቴ ይጥራ የሱስ ጌታዬ

ድካሜን የሚያግዝ የሚያበረታኝ - መንፈስህ
በማይነገር መቃተት የሚያስማልደኝ - መንፈስህ
የቃልህን ደጆች የሚከፍትልኝ 
አባ አባ የምልበት
የልጅነት መብት የሚያስወርሰኝ
የሰማይ እርስት
ማህተሙ እሱ ነው የታተምኩበት
መንፈስህ ይብዛልኝ
እለት በእለት ጌታዬ
እለት በእለት
',0),(NULL,'ለእኛ አይደለም','Yemserach2','አቤቱ ለእኛ አይደለም
የሱስ ሆይ ለእኛ አይደለም
ነገር ግን ለስምህ
ስለምህረትህ ስለእውነትህ
ምስጋናን ልንሰጥህ /2/

በእኛ ላይ የታሰሩ በፈቃድህ ምክር
ሁሉን የምታደርግ አምላክ እግዚአብሔር
ለስምህ ተነሳ ጠላቶችህ ይፈሩ
አህዛብ አምላካቸው ወዴት ነው አይበሉ

ጥንት በአባቶቻችን ዘመን እየሰራህ
ዛሬም በምህረትህ ከህዝብህ ጋራ ያለህ
አቤቱ አምላካችን ክንድህን አበርታ
ጽዮንን በውዴታህ አንተ አሰማምራ

ተነስ እግዚአብሔር ጠላቶችህ ይፈሩ
ስምህን ስንጠራ ፈጥነው ይበተኑ
ተነስ የኛ ጌታ ጠላቶችህ ይፈሩ
ስምህን ስንጠራ ፈጥነው ይበተኑ
ተነስ ጌታ የሱስ ጠላቶችህ ይፈሩ
ስምህን ስንጠራ ፈጥነው ይበተኑ

በቅን ለሚጠሩህ መልካም የምታደርግ
ከክፉ ፍላጻ ህዝብህን የምትጋርድ
የሰራዊት ጌታ አቤቱ አምላካችን
ረድኤታችን መታመናችን እይልን /2/
',0),(NULL,'የሚሳን አለ ወይ ለእግዚአብሔር','Yemserach2','የሚሳን አለ ወይ ለእግዚአብሔር
የሚሳን አለ ወይ
የሚሳን አለ ወይ ለእግዚአብሔር
የሚሳን አለ ወይ
ይሰራል ኢየሱስ በምድር በሰማይ
አምላክ ነው ሁሉን ቻይ /2/


አብርሃም ልጅ ሳይወልድ ሞቶ አመት ሆኖታል
ሳራም እርጅናዋ ተስፋ አስቆርጧታል
ታማኙ እግዚአብሔር ምንስ ያግደዋል
እሱ ፈጣሪ ነው ይሳቅን ወልደዋል

ጎልያድ ሲገዳደር የእስራኤልን ሰራዊት
ጥሎታል በአንድ ጠጠር ብላቴናው ዳዊት
በሰረገላና በሰይፉ አይደለም
የእግዚአብሔር ችሎታ አይመረመርም

አልአዛር ከሞተ አራት ቀን ሆኖታል
ብላ ማርታ ስትል መቃብሩ ሸቷል
ክብሩን ሊያሳያት እምነቷን ጠየቃት
አዘዘ በስልጣን መቃብሩ እንዲከፈት

ጴጥሮስ ኢየሱስን በባህር ላይ ሲያየው
እሱም እንዲመጣ ፈቃድን ጠየቀው
ና ብሎ ሲጠራው እሱም ተጓዘበት
ካመነበት በላይ ታምራት ሰራለት
ሰምቶ የሚመልስ አምላክ 
እንዳንተ ያለ የት ይገኛል /4/
',0),(NULL,'እጮሃለሁ','Yemserach2','እጮሃለሁ አልቆጥብም
ስለ ኢዮሩሳሌም ዝም አልልም
ጽድቋ እንደ ጸዳል እስኪወጣ
መዳንዋ እንደ ፋና እስኪ በራ /2/

በተራራ አናት ላይ ጸዳሉ ይታያል
መልካም መአዛ ያለው ሽቶውም ይሸታል
ስሙም እንደሚፈስ ዘይትም ይፈሳል
አህዛብን ሁሉ ዳሶ ይፈውሳል /2/

በሮቿ ምስጋና ተብለው ይጠራሉ
የእግዚአብሔርን ማዳን ያላዩ ያያሉ
ቁርባንንም ይዘው ወደ እሱ የሚመጡ
ጌታ ያዳናቸው ብዙዎች ይገኛሉ /2/

የእልልታ መስዋእት በውስጧ ይሰማል
የሱስ በልጆቹ ውበቱ ይታያል
ነገስታት እጅ መንሻ ይዘው ይገባሉ
ለክብሩ በፊቱ ወድቀው ይሰግዳሉ /2/

በክብሩ ዙፋን ላይ የሱስ በማደሪያው
ንጉስ በማዳኑ ብርሃን ሲያደርገው
ያላዩ ያያሉ ያልሰሙ ይሰማሉ
የተራቡም ሁሉ ጽድቅን ይጠግባሉ /2/
',0),(NULL,'ምህረትህ ረዳኝ','Yemserach2','ምህረቱን ዘውትር እዘምራለሁኝ
የሱስ በጎነቱን አወራዋለሁኝ
አይቻለሁና በደሌን ሲፍቀው
ፍቅር ነው ኢየሱስ ምስጋና ይድረሰው

ምህረትህ ረዳኝ ከመሰናከል
ምህረትህ ረዳኝ በሲኦል ከማደር
ምህረትህ ረዳኝ ከመከራ ስጋት
ማጽናናትህ ነፍሴ እጅግ ደስ አሰኛት /2/

ለፍርድ የሚያቀርበኝ እንደ ደም የቀላ
እሬት ሆኖ መርሮ በጣም የተጠላ
ከዚህ ትልቅ እዳ እንዴት ወጣለሁ ስል
የሱስን አገኘሁ በምህረቱ ረዳኝ

ጠላቴ በሰልፉ እጅጉን አይሎ
ነጻ አወጣኝ የሱስ እርሱ ለኔ ታግሎ
የተገነባውን የጥሉን ግድግዳ
አፈራረሰልኝ የሱስ የኔ ጌታ

መተላሌፌንም ለአምላኬ ነገርኩት
በደሌን ክፋቴን አንድም አልሰወርኩት
ውስጤን መረመረኝ በዘላለም ምህረት
ተወልኝ የሱስ የልቤን ሁሉ ሃጥያት
',0),(NULL,'አቤቱ አንተ ላልበድል','Yemserach2','አቤቱ በሌሊት ስምህን አስባለሁ
በማለዳም ደግሞ ምህረትህን አወራለሁ
በምስጋና ሁሉ ላይ ምስጋናን እጨምራለሁ
አንተን ብቻ የሱስ ተስፋ አደርጋለሁ
ቃልህ ትዝታዬ ነው
አንተን እንዳልበድል በልቤ እሰውራለሁ /2/

ደካማ መሆኔ የሱስ ተመልክቶ
ሊያበረታኝ ወዶ ችግሬንም አይቶ
አበዛ ምህረቱን ኃይልን ሰጠኝና
መሰረት ለሕይወቴ ኢየሱስ ሆነና
ምን ልስጥህ ምን ልክፈልህ
ምስጋና ነው ያለኝ የሱስ ተቀበልልኝ /2/

ለችግረኛና ለሚስኪን ይራራል
ረዳት የሌለውን የሱስ ይታደጋል
በዘላለም ምህረት ይንከባከበዋል
እንባውን ከአይኑ ኢየሱስ ያብሳል
ምህረትህ ከህይወት ይሻላል
በሕይወቴ ዘመን ሁሉ አመሰግንሃለሁ /2/

',0),(NULL,'ማርከው ኢየሱስ','Yemserach2','ይሁን መላ ህይወቴ የፍቅርህ ምርኮኛ
በሃሳቤም ሆነ በስጋ ክበር የሱስ አንተ ብቻ
በከበረው ደምህ ገዝተኸኛልና
አምላኬ ያንተ ነኝ አይደለሁ የስጋ

ማርከው ኢየሱስ ሁለንተናዬን
ለአንተው ይገዛ ነፍሴም ስጋዬ /2/

ጽድቅ አላውቅም ነበር በአለም ሳለሁ
ሁለንተናዬን የአመጻ እቃ ጦር አድርጌ አቅርቢያለሁ
አሁን ግን ኢየሱስ ልጅህ ሆኛለሁ
ለአንተ እንድገዛ ሁለንተናዬ ባርከው

በህግ በታች ነበርኩ በሃጥያት ባርነት
ነጻ አውጥተኸኛል ጌታዬ ኢየሱስ ልኖር በአርነት
ስጋ አይሰልጥንብኝ በመንፈስ ልመላለስ
ዳግም በባርነት ቀንበር እንዳልያዝ

አይኖቼ ሁልጊዜ አንተን ብቻ ይዩ
ጆሮዬ አንተን ይስማ ጉልበቶቼ ደግሞ ለክብርህ ይንበርከኩ
አንደበቴም ዘወትር ምስጋናህን ያውራ
በሁለንተናዬ አንተ ንገስ ጌታ

',0),(NULL,'አሸንፌአለሁ','Zenbech1','የሚታገለኝን አሸንፌአለሁ /3/
ዝም በዪ የሚለኝን አፍ አስይዤአለሁ /2/ 2
ይህ ለኔ የሆነው - ባንተ/ካንተ ነው /2/ 4

ወዳጄ - ከሰማይ ነውና
ድካሜ - ይገባዋልና
ትግሌን - አሸንፎ በድል
መለሰኝ በብዙ ሞገስና ክብር /2/

ዙፋኑ በሰማይ - ታላቅ ሆኖ ትልቅ
መጣልኝ ታች ድረስ - እኔ ሊፈላልግ
ተጭኖ ተጭኖ - ዝም ያሰኘኝን
እርግፍግፍ አረገው ከላዬ አፈሬን
የሚታገለኝን ....

የሚራራ - ሁሌ በድካሜ
የሚረዳኝ - ሚገባው የልቤ
እንዲህ ያለ - ወዳጅ ነው ያለኝ
እሱ እያሸነፈ ጎበዝ የሚለኝ /2/

ትግሉ የኔ ነው - አሸናፊው እሱ
በግልጥ ያዞሮኛል - በክብር ሞገሱ
ታግሎ የረታልኝ - እኔን ግን የሚለው
ዘምሪ አመስግኚ ደስታዬ በዚያ ነው

ከወደድከው ምስጋናዬን ከወደድከው - ይኸው
ከፈለከው አምልኮዬን ከፈለከው - ይኸው
ከወደድከው ዝማሬዬን ከወደድከው - ይኸው
ከፈለከው አምልኮዬን ከፈለከው - ይኸው

ሚስጥሩ - ከፍ ከፍ ያልኩበት
ሁልጊዜ የማሸንፍበት
የአባቴ የዘላለም ክንዶች
ይንከባከቡኛል ላለው ከኔ በታች/2/
ትግሉ ...
',0),(NULL,'ኢትዮጵያ','Zenbech1','እንዲህ ላለው ጊዜ ተጠርቼ እንደሆነ
የሱሴ/ጌታዬ በፊትህ ሞገስ ካገኘሁኝ /2/
አላውቅም ብቻ ሸክም ይሰማኛል
ህዝቤን ህዝቤን ምድሬን ምድሬን - ያሰኘኛል /2/
ሰላም-ሰላም ሰላም - ለሀገሬ ለሀገሬ
ሰላም - ሰላም ሰላም - ለወገኔ ለወገኔ
በረከት ለህዝቤ - በረከት ለምድሬ

ኢትዮጵያን እግዚአብሔር ይባርክ
ኢትዮጵያን ኢየሱስ/ የኔ አምላክ ይባርክ /2/

የኢትዮጵያ ልጆች አነሱ እጃቸውን
የላይኛው ጌታ ሰጠ ምግባቸውን
በወንዞች ዳርቻ እንደሚተከል
ዘንባባ አበቡ አፈሩ ይባል /2/

ሀገሬን ልጆችዋን ባርክ
ኢትዮጵያን ገዢዎቿን ባርክ
ምድሬን እርሾቿን ባርክ
ወገኔን በሰላም ባርክ/2/

ከዘላለም ከጥንት በስሟ ያወቃት
ክቡር ኪዳን ሰርተህ ቃል የገባህላት
ኢትዮጵያ ተነሳች በስምህ ልትጠራህ
ዘንበል በል ኢየሱስ ስማት ከማደሪያህ /2/

ኢትዮጵያ ትስገድ - ለየሱስ
ጠላትዋም ወድቆ - አፈር ይላስ
አንተን በማወቅ - ጽድቅ ያብብባት
ጨረቃ እስክታይ/ መሽቶ እስኪነጋ- ሰላም ይብዛባት /2/

በድንኳኗ ውስጥ አልስማ ጭንቅ
ትበልጥግ ምድሬን ኢየሱስ ይባርከው
ኢትዮጵያ - አታይ ጭንቅ
ኢትዮጵያ - ኢየሱስ ይባርክ
ኢትዮጵያ ኢትዮጵያ
',0),(NULL,'ማመስገኛ','Zenbech1','ምክንያት ፈልጌ ሰበብ ፈላልጌ
ደህና ማደሬ መዋሌን አስቤ
ይመስገን ኢየሱስ እላለሁ ከልቤ
ይመስገን ጌታዬ እላለሁ ከልቤ
ምስጋናዬ አይነስብህ ምስጋናዬ
አምልኮዬ አይነስብህ አምልኮዬ /2/


በለምለም መስክ ላይ ነፍሴን አሰማራህ
መብሌን መጠጤን ባረከልኝና
እንዳይጎረብጠኝ አልጋዬን አንጥፎት
ውሎዬን በሰላም አዳሬን በምቾት
አንተን ማመስገኛ ብዙ ምክንያት አለኝ
ለመልካምነትህ/ስለ ደግነትህ እኔ ምስክር ነኝ /2/

ያስተኛኝ ሌት አልፎ ነግቶልኝ ነቃሁ - ምስጋናዬ ይኸው
ማን አስቦት ነበር ይህን ቀን አየሁ - ምስጋናዬ ይኸው
ጤና ነኝ በደህና ተነፍሳለሁ - ምስጋናዬ ይኸው
ባልሆንም ትልቅ ነህ አመልክሃለሁ - ምስጋናዬ ይኸው
ምስጋናዬ .....

ያሰብኩት ባይሞላም ልቤ በሃዘን ቢፈስ
እንባዬ ምግቤ እስኪሆነኝ ድረስ
ተምሬአለሁና ማመስገን በሁሉ
እባርክሃለሁ በሰበብ በአስባቡ
አንተን ....
አንዳች ባይኖረኝም ምቆጥረው በኪሴ
ሞልቶ የተረፈ ሰላም አላት ነፍሴ
እንደምን አድረሻል ለሚል ጠያቂዬ
የእውነት ነው የምለው ይመስገን አንድዬ
አንተን ...ያስተኛን ....ምስጋናዬ ...
',0),(NULL,'እንደ ልቤ','Zenbech1','እንደ ልቤ /4/ በለኝ /2/
እንደ ልቤ በለኝ በለኝ እንደ ልቤ በለኝ
የምወድሽ/ህ ልጄ በለኝ
መንግስትህ ልታወርሰኝ

ባይኔ ሙሉ ተስለህ 
በነፍሴ ውስጥ ለብቻህ
ጌታ ሆነህ ሁሌ አሳቤ
ብቻ በለኝ እንደ ልቤ
ልቤ ከልብህ ይስማማልኝ
ውዴ ምርጫዬን ውደድልኝ
ሃሳብህ ሃሳቤን ያሸንፈው
   ነፍሴ ፍቅርህን ትፈልገው /2/

ኢየሱስ አንተ ብቻ ውደደኝ
የኔ የራሴ ብለህ ጥራኝ
ነገሬ ንግግሬ ይጣፍጥህ
ስራዬ ልብህን ያሳርፍልኝ /2/
እንደ ልቤ .....

በል ሃሳቤን ፈውስና
ንጹህ ልብን ስጠኝና
ላንተ እንድመች አርገህ ስራኝ
መስቀልህ ስር እንዳታጣኝ


ልቤ ከልቤ .....
ኢየሱስ አንተ .....
',0),(NULL,'ምሽግ መሽጌ','Zenbech1','ምሽግ መሽጌ - አይደለም
ጉድጓድ ቆፍሬ - አይደለም
የጦር መሳሪያ አሰባስቤ - አይደለም /4/
አለምን የማሸንፈው - ሰይጣንን የምበቀለው
ስጋዬን ጸጥ የማሰኘው - የሱስን በማመስገን ነው /2/

በነገር ሁሉ ተመስገን ስለህ
ቀንዴ  ከፍ /4/ ይላል
የኔ መዋጊያ መሳርያ እሱ ነው
የጠላትን ሃይል የሚያንቀጠቅጠው
ጦር ሳልማዘዝ ከማንም ጋር
ሳልደክም ሳልሄድ ጠላት ሰፈር
የኔ ድብቅ ጦር እየወጋቸው
ሰፈር መንደሬን አስለቀቃቸው

ለካ ምስጋና ለካ አምልኮ ለካ ዝማሬ
ለካ ለካ ለካ ዝማሬ - ጠላትን መቅጫ በትሬ
ለካ አምልኮ ለካ ዝማሬ ለካ ምስጋና
ለካ ለካ ለካ ምስጋና - የድል ብቸኛ ጎዳና
ምሽግ ......

እግዚአብሔርን የሚባርኩ
ለድንጋጤ ከቶ አይሰጡ
ቢወድቁም እንኳን ተስፋ አላቸው
ያሸንፋሉ በምስጋናቸው
እየዘመርኩ እያመለኩ
ስንቱን ጠላት ረፈረፍኩ
አለም አንገቷን ደፋች ደንግጣ
የስጋ ምኞት ያኔ ተመታ

ለካ ምስጋና .........

ተመስገን /3/ ኢየሱስ
ተባረክ /3/ ጌታዬ /2/
',0),(NULL,'አልሰማማ','Zenbech1','ባጥንቴ የገባ በልቤ ታተመ
የማረከኝ ፍቅርህ ነፍሴን ያስደመመ
ፍጽምነት ለአንተ ዙፋንህ ነውና
ሳምንህ እኖራለሁ በቃልህ ስጽናና /2/

አንተን መውደድ አልተውም 
አንተን መጥራት/መፍራት
አንተን ማሰብ 
አለተውም አንተን ማለት /2/

እህ አለ ቢሉኝ 
እህ ካንተ ሌላ አሃ
የሚፈለግ የሚስማማ/ 
የሚወደድ የሚስማማ 
እኔ አልሰማማ
አልሰማማ አላይማ- አልሰማማ 
ሌላ አላይማ/አልፈልግማ /3/

አንተን መውደድን አልተውም 
አንተን መጥራት/መፍራት
አንተን ማሰብ አለተውም 
አንተን ማለት /2/
',0),(NULL,'መዝሙሬ','Zenbech1','እኔን በሰው ፊት የሚያቆመኝ
የምታይበት ምን ስራ አለኝ?
እኔን ባንተ ፊት የሚያቆመኝ
የምታይበት ምን ጽድቅ አለኝ?
መዝሙሬም አንተው ነው - መጎሴም የሱስ
የኔ ቅድስና - አንተኮ ነህ ጌታ /2/

ምታበረታታኝ አይዞህ ዘምሪ እያልክ
በሌሊት መዝሙርን እንዲህ እየሰጠኸኝ
ከላይ በሚመጣው የሱስ ባንተ ጸጋ
በሞገስህ ዛሬ ቆሜያለሁ እዚህጋ

ገና ልዘምር ስይዝ በገና
የፍቅርህ ብዛት ይታየኝና
ምህረትህን ሳስብ በዝቶ በላዬ
እላለሁ ብቻ ውዴ አባትዬ
በከሳሼ ፊት በድፍረት ቆሜ
ክብርህን እንዳዜም ሆንከኝ አቅሜ
ከሞተው ሆድ ውስጥ ጣፋጭ ማር
የምታወጣ የምታከብር
መዝሙሬም .....

ላልል በኩራት እንዲህ ነኝ እኔ
ሃጥያትን ጨላጭ ዋናዋ ሆኜ
በስንቱ ምልጃ በስንቱ ጠላት
ተደግፌ እንጂ ያለሁት በሕይወት
ግን እኔ ራሴን እንደማውቀው
አይደለም አንተ የምታየው
ወይም በሰው አፍ እንደምባለው
አልመዘንከኝም አይንህ ፍቅር ነው

እንዴት /4/ ነው እኔን የምታየው /2/
ከሃጥያተኞች ዋና አንደኛ ስሆን
አንደኛ ወደድከኝ/ከሁሉ መረጥከኝ 
እንዴት እንዴት ነው ምታየው? /2/*

እኔማ በየቱ ስራዬ ልመካ?
ስወድቅ ስነሳ ውላለሁ ስንቴ ባሳቤማ
አንተ ነህ መታያ ሞገስና ጽድቄ
ይከታተለኛል ምህረትህ እንዳልቀር ወድቄ /3/
',0),(NULL,'አላማህ','Zenbech1','እኔን ማስጨነቅ እኔን ማስለቀስ
እኔን ማስከፋት እኔን ማስተከዝ
አይደለም ያንተ አላማ
አላማህ በኔ ላይ ፍቅር ነው ጌታዬ
ለኔ ቢመስለኝም ትክክል ምርጫዬ
ፍጹምልትጎዳኝአትፈልግምና
አንተ ያልከው ይሁን የእኔ ይቅርና

ምናልባት ምርጫዬ ያለቀስኩለት
ላገኘው ቀን ሌሊት የለፋሁበት
ሲመጣ አንገቴን ያስደፋኝ ይሆናል
እንጂማ እንዳትሰጠኝ ቆይ ማን ተው ይለሃል? /2/
እኔን ...

ሰው መልካም ከሆነ ለልጆቹ ምርጥ
ዳቦ ለጠየቀው ድንጋይ የማይሰጥ
የመልካምነትን ምንጭ የሆንከውን አንተ
አልጠረጥርህም ለኔ ደግ አባት ነህ

ግን እናንተ የማትጠቅሙ ባለመድሃኒተኞች
ዞር በሉልኝ ከጎኔ አትምከሩኝ ለእኔ
መጎዳቴን እያነሳችሁ
 አትነዝኑዝኝ እስኪባካችሁ
እኔ ለእኔ በደንብ አውቃለሁ
 እንደ የሱስ ከየት አገኘለሁ? /2/
ያመጣችሁት መላ ብላችሁ
አልጠቀመኝም መድሃኒታችሁ
አንዱን ገንብቶ ብዙ ይንዳል
ከጥቅሙ ይልቅ ጠንቁ ይበልጣል
እግዚአብሔር ጎዳሽ አማረርሽ
ብትሞቺ ይሻላል እሱ ሰድበሽ
እንዲህ እያላችሁ አትምከሩኝ
ውዴን ወድጄ ሞት መራጭ ነኝ
',0),(NULL,'አንተን አለች','Zenbech1','አንተን አንተን አለች
አንተን አንተን ትላለች ልቤ 
ውዴን ውዴን አለች
ውዴን ውዴን ትላለች ነፍሴ
የእውነት ወዳጅዋ ስለሆንክላት
አንተን አንተን ብቻ አሰኛት /2/


አምላኬ አምላኬ ስልህ ትረካለች ነፍሴ
እጠራህአለሁኝ አልሰለችም ኢየሱሴ
ጣፋጩ ስምህ ገና ከአፌ መውጣት ሲጀምር
መላ ሰውነቴ በደስታ ይፍለቀለቃል
አንተን .....

ስሙ መልካም መዓዛ እንዳለው ነውና እንደ ዘይት
ስለዚህ የጽዮን ደናግል እጅጉን ወደዱት
ካፉ የሚወጣው ቃሉ ሕይወት አለበትና
ጥላው ስር ተቀመጥኩ ከነፍሴ ውድድ አረግኩህና
በየጎዳናው ላይ የባከነው ልቤ
የተረጋጋልኝ ሰብሰብ ያለው ቀልቤ
ጌታ አንተን ያገኘሁኝ/ያገኘኸኝ እለታ /2/

ሕግህ መመሪያዬ ፍቅርህ መኖሪያዬ
ቃልህ የሕይወት ቀለብ እንዳንተ ምፈልገው የለም
ክንዶችህ ተድላዬ ሞገስህ ግርማዬ
ማበልጥህ ከምንም ከማንም እንዳንተ ሚያስፈልገኝ የለም

ለእኔ ውድ ነህ የተወደድክ
ለእኔ ድንቅ ነህ የተደነቅክ
ለእኔ ምርጥ ነህ የተመረጥክ
የሱስ በልቤ አለህ እንደተዋብክ
',0),(NULL,'ቁልፉን','Zenbech1','ይሰጠኛል ብዬ ካላመንኩህ መለመኔ ከንቱ ነውና
አገኛለሁ ብዬ ካላመንኩህ መፈለጌ ድካም ነውና/
ይከፈታል ብዬ ካላማንኩ ማንኳኳቴ እንዲሁ ነውና
የሁሉን ቁልፉን ስጠኝ እምነትን /2/ 2

ስጠኝ /2/ እምነትን
ስጠኝ ጌታዬ/ኢየሱስ ስጠኝ እምነትን
እምነትን የሁሉ ቁልፉን /2/*

ያመነ ገባ ወደ እረፍት
ጽድቅ ሆኖ ተቆጠረለት
ያደለው አምኖ ከልቡ
ተሸኘ ፈውስን አርጎ ምግቡ /2/*

የሰናፍጭ ቅንጣት ብታህልም እንኳ
በሰፈርዋ የለም ትልቅ/ከባድ ብሎ ቋንቋ
ብልህ ከነገር ጋር መታገሉን ጥሎ
ይጸልያል እንጂ እምነት ስጠኝ ብሎ /2/*
ስጠኝ ....

ልቡ በአምላኩ የጸናው
ነፍሱን ለጭንቀት ያልሰጠው
ተራራውን እንኳን ያናግራል/ 
ሸሎቆውን ሙላ ብሎ ያዛል
ለሚያምን ሁሉ ይቻለዋል /2/*

እስኪ አንተ ተራራ ኧረ ምንድ ነህ?
በፊቴ እንድትቆም ማን አይዞህ አለህ?
በል ተነቅለህ ጥፋ አልይህ ደግሜ
የምልበት ጸጋ እምነት ነው አቅሜ /2/*
',0),(NULL,'ኑሮ ብዬ','Zenbech1','ኢየሱሴ ይወደኛል
ሌላ ምን ያስፈልገኛል?
ለኔ ሕይወት የምለው
በዚህ ነው የምረካው /2/*

ኑሮ ብዬ የምኮራበት
ይኼ ብቻ ነው የምጽናናበት /2/*

የሚታየው ለአይን አይሞላም
የሚሰማው አያረካም
ሁሉ ነገር ያደክማል
የኔ ደስታ የሱስ ነህ /2/*

ኢየሱስ/ጌታዬ ካንተ ጋራ
ሸሎቆም ይሁን ተራራ
መራራው ይጣፍጣል
ልቤ አንተን አንተን ይላል/ይናፍቃል /2/*

እረፍት ነህ ለአእምሮዬ
የኔ ጌታ የሱስዬ
ያንተን ፍቅር ወደዋለሁ/አደንቃለሁ
ነፍሴን በእጅህ አኖራለሁ /2/*

ኢየሱስ ካንተ ጋራ ....

ደስታና ሰላሜ እርካታ የእውነት
በቃ አንተ ብቻ ነህ ለኔ ሕይወት ማለት
የመኖርን ትርጉም የምታብራራልኝ
አንተን ሳስብህ ነው ልቤ የሚያርፍልኝ /2/*
ኑሮ ብዬ .....
',0),(NULL,'መውጊያ','Zenbech1','እንዳንተ ለኔ እንዳንተ እንዳንተ /2/
እንዳንተ ለኔ እንዳንተ /2/ 2*
እንዲህ ደፋር እያደረገኝ
በጠላት ፊት የሚያጓድደኝ/የሚያሳድደኝ
አንድ አይገኝ /2/

ከሚፈልጉኝ በፍላጻቸው
የሱስ ሰውሮኝ ከአይኖቻቸው /2/
አንድም ሳይነካኝ ሁሉም አለፈ
ሰላሜ በዝቶ ለሰው ተረፈ
ከድህንነት ምንጭ በብዙ ደስታ
እቀዳለሁኝ ቀንና ማታ

መውጊያ ውጋትህ የት አለ?
ደዌ ህመምህ የት አለ?
መቁረጫ ቁርጠትህ የት አለ?
ኢየሱስ የኃይልህን ብርታት አሸንፎታል /2/*

በሚያስፈራኝ ፊት በክብር ሄድኩ
በከፍታው ላይ ከፍ ከፍ አልኩ /2/*

ሺ ገዳዩን ሰው ከንቱ አድርጌ
እልፍ ገዳዩ ሆነ ማእረጌ
በል ጦርህ ቀጥቅጥ ሰብረህ ጣለው
እኔን ላታገኝ አትወርውረው
መውጊያ ....

ማንም ደካማ ሸክሙ የከበደ
የእውነት እረፍትን ልቡ የወደደ /2/*

የሚጠራውን ብዬ ጌታዬ
እርፍ አልኩበት ሸክሜን ጥዬ
መቆሚያዬ ነው መደገፊያዬ
ባስጨናቂው ፊት መጓደጃዬ

እንዳንተ ....
መውጊያ .....
',0),(NULL,'እግዚአብሔርን አመስግኑት ቸር ነውና','hebret1','እግዚአብሔርን አመስግኑት ቸር ነውና/2*
ምህረቱ ለዘላለም ነውና /2/

ኢየሱስ ይመስገን ቸር ነውና
ፍቅሩ ከመታወቅ በላይ ነውና
የአምላክ ውለታው ብዙ ነውና
እስትንፋስ ያለው ሁሉ አመስግኑት

ኢየሱስ ይመስገን ቸር ነውና
የተስፋ ቃሉን ይፈጽማልና
በእምነት ሥጋ ለባሹን ሁሉ
በመንፈስ እሳት ይሞላልና
ኢየሱስን አመስግኑ ቸር ነውና /2/
መንፈሱን ዛሬ ያፈሳልና /2/

ኢየሱስ ይመስገን ሕያው ነውና
ትናንትም ዛሬም ሁሌም ያው ነውና
የማዳን ክንዱ አላጠረምና
ዛሬም በቤቱ ይሰራልና
ኢየሱስን አመስግኑት ሕያው ነውና /2/
ዛሬም በቤቱ ይሰራልና /2/

ኢየሱስ ይመስገን ቅርብ ነውና
በመንፈስ ከሕዝቡ ጋር አለና ለቅዱሳኑ ይዋጋልና
ስሙን ለጠሩት ግሩም ኃይል ነውና
ጌታ ኢየሱስን ጥሩት ቅርብ ነውና /2/
ስሙን የጠራ ይድናልና /2/
',0),(NULL,'ኦ ምስጋና ሃሌሉያ','hebret1','ኦ ምስጋና ሃሌሉያ 
ኦ ምስጋና ስምህ ይክበር  /2/

ስምህን በጥምቀት ያለበስከኝ
በቅዱስ መንፈስህ ያደስከኝ 
ከግብጽ ያወጣኸኝ መድኃኒቴ 
ከነዓን እስክደርስ ቁም ከጎኔ 
የጽዮንን ፍሬ እንዳይ በአይኔ

በችግሬ ቢሆን በስቃዬ 
በረሃቤ ቢሆን በጥማቴ 
በበሽታ ቢሆን በፍርሃቴ 
በምስጋና ልለፍ በዝማሬ 
የጽዮንን ፍሬ እንዳይ በአይኔ

ቅዱሱ ስምህን አክብሬ
 የፍቅርህን ምስጢር መስክሬ
 እርዳኝ በቤት ውስጥ ሁሌ ኖሬ
 ሕይወቴ እስኪሆን ምስክሬ
 የጽዮንን ፍሬ እንዳይ በአይኔ
',0),(NULL,'ኑ እና ቅመሱ እዩ','hebret1','ኑ እና ቅመሱ እዩ/2* 
ሕይወት ከነትርፉ አግኙ 
ወደ ፈቃር አምላክ ኑ  /2/

አይመስለኝም ነበር እንዲህ የምረካ
 ከገመትኩትም በላይ ሆኖ ሕይወቴ ፈካ
በሩቅ ሆኜ ሳየው ሞኝነት መሰለኝ
 ግን ቀረብ ብዬ ስመለከት ፍቅሩ ሳበኝ      
ያዘኝ ማረከኝ

በማላውቅ ገብቼ በእሳት ስጫወት
 መስዬ ለመኖር ብዬ ስሸሽ ከሕይወት
 ግን የፍቅር ድምጹ ቃሉ አሸነፈኝ
 ከሰው ፍርሃት ነፃ አውጥቶ የእርሱ
      የግል ልጁ አረገኝ

ከሰው ሠራሽ ሕይወት ፍሬ ቢስ ከሆነው 
ትርጉም ቁም ነገር በሞላበት ሕይወት  አኖረኝ
 በደስታ በሰላም በእፎይታ ሞልቶኛል
 ከሆዴ የሕይወት ውሃ ወንዝ ይፈልቃል 
ይክበር ያዳነኝ

መሐሪ መሆኑን እናንተም ቅመሱ
 ይህ የፍቅር ጥሪውን ሰምታችሁ ልባችሁን አንጹ
 ያን ጊዜ የጌታን ማንነት አውቃችሁ
 ምስክር ልትሆኑ ነው ኑ እና ቅመሱ እዩ
',0),(NULL,'የሚመካ በኢየሱስ ይመካ','hebret1','የሚመካ በኢየሱስ/በእግዚአብሔር/ ይመካ
 በፍጹም ሰላም ልቡ እንዲረካ /2/

በሰው አይሆን ሰው ፈራሽ ነውና
 እንደ አበባ የሚረግፍ ነውና
  በሰማይ አይሁን አንድ ቀን ያልፋልና
 በምድር አይሁን በፍርድ ቀን ይቀልጣል

በእውቀት አይሁን የሚሻር ነውና
 በብር አይሁን ይዝጋልና
  በጌጥ አይሁን የሚቀር ነውና
 በጥቂት ጊዜ ይለወጣልና

በዘር አይሁን ሁሉም ሰው ነውና
 አጣልቶ ያራርቃልና
 በልብስ አይሁን ብል ይበላዋልና
 በመልክ አይሁን ይቀየራልና

የሚመካ በኢየሱስ ይመካ
 ልቡን ይክፈት ጌታ ሲያንኳኳ
 በኢየሱስ ስም ለመዳን ይጠመቅ
 ከዚህ ሌላ እንደሌለ ይወቅ
',0),(NULL,'የጥልን ግድግዳ በሥጋ ለማፍረስ','hebret1','የጥልን ግድግዳ በሥጋ ለማፍረስ
 ሰው የሆንከው አምላክ ስምህ ይቀደስ /2/

ሱራፌል ኪሩቤል በክብር የሚያጅቡህ
 እልፍ አእላፋ መላዕክት የሚሰግዱልህ
 ከከበረው ዙፋን ከሰማየ ሰማያት
 በፍቅር ተገደህ ወረድህ ወደ መሬት

ኤልሻዳይ ጆሆቫ የነገስታት ንጉስ
 በሥጋ ተገለጽህ እኛን ለመቀደስ
 በበረት ተወለድህ በከብቶች መሃከል
 ዕዳዬን ለመክፈል እጅግ ተዋርደሃል

የሰላም አለቃ የዘላለም አባት
 ሕፃን ሆነህ መጣህ ይገባሃል ስግደት
 የሁሉ ፈጣሪ ጌታና መድኃኒት
 በአንተ ጉስቁልና እኛ አገኘን ሕይወት

ወራሾችህ ሁነን እንድንገባ ሰማይ
 ምህረትህን አገኘን በመስቀልህ ስቃይ
 የወደድከን ጌታ ኢየሱስ ብርሃናችን
 እናነግስሃለን በፍጹም ነፍሳችን
',0),(NULL,'እይ ተመልከት ግብረ ሐዋርያትን','hebret1','እይ ተመልከት ግብረ ሐዋርያትን
 ምዕራፍ ሁለት ሠላሳ ስምንትን
 ሦስተኛው ምዕራፍ የዮሐንስ ወንጌል
 አምስተኛው ቁጥር ምን ይላል ወንድሜ?
አምስተኛው ቁጥር ምን ይላል እኅቴ?

ብዙዎች ለመግባት ይመኛሉ ሰማይ
 ግን አይታዘዙም ለሚመጣው ከላይ
ከውሃ ከመንፈስ ካልተወለደ ሰው
 መግባት ይቅርና ፍጹምም አያየው

አንድ ነው መንገዱ ጽድቅን የሚያወርሰው
 ግን ይገባል ገሃነም ያልተጠመቀ ሰው
 እኔ አይደለሁም ይህን መንገድ ያመጣሁት
 ትችሉ እንደሆነ ጌታን በዛ ቀንስ በሉት

የሰማይ መክፈቻ ጴጥሮስ ጋ አለልህ
 እላይ አትፈታም እዚህ ከታሰርህ
 ስለዚህ ከሐጢአት ቶሎ እንድትፈታ
 በስሙ ተጠምቀህ ክብር ስጥ ለጌታ
',0),(NULL,'በሆይታ ለመግባት ጽዮን','hebret1','በሆይታ ከመግባት ጽዮንን
ምን ይከለክላል ከዳንን
በኢየሱስ ስም ከተጠመቅን
በመንፈስ ቅዱስ ከተሞላን

ቅድስናችንን ከጠበቅን 
ጌታ ቢከብር በሕይወታችን
 ሁሉን ለእግዚአብሔር ክብር
 ብናደርግ በዚህ በምድር

በቃል በኑሮ በፍቅር
 በቅድስና ብናከብር
 ምሳሌ በመሆን ለሕዝብ
 ጌታን ብንከተል ከልብ

የዘንባባ ቅጠል በእጃችን
 ይዘን እንሄዳለን ቤታችን
 በምስጋና ዜማ በደስታ
 እንገባለን ጽዮን በሆይታ

ጽድቁን ተአምራቱን አውርተን
  ጌታ ኢየሱስን አውጀን 
ግዳጃችንን ፈጽመን
በድል በፍንደቃ ጽዮንን
',0),(NULL,'ቤተክርስቲያኔ ለእኔ','hebret1','ቤተክርስቲያኔ ለእኔ/3*  
ሕይወቴ ውበቴ ናት 
ቤተክርስቲያኔ ለእኔ/3* 
እርስቴ ኩራቴ ናት

አንቺን ላገለግል ማለዳ እነሳለሁ
 ትዳሬን ኑሮዬን ለአንቺ ሸጨዋለሁ
 ሌላ ሕይወት የለኝም ካላንቺ እርስቴ
 ቤተክርስቲያኔ ነሽ አላማ ሕይወቴ

አንቺን ለመመገብ እግሬ እስኪነቃ
 አፌ እስከሚደርቅ ዕድሜዬ እስኪያበቃ
 እተጋለሁ በሌት በቀን አስባለሁ
 በክረምት በበጋ ለአንቺ እሯሯጣለሁ

የአምላኬ ከተማ በአንቺ የሚኖሩት
 የጌታዬ ሕዝቦች ያደጉ ያላደጉት
 ወንድሞች እህቶች እናቶች አባቶች
 መመኪያዬ ናቸው የጌታዬ ሕዝቦች

በአንቺ ላይ እንዳይኖር እንከን እንዳላይ
 አደራ ብያለሁ ጌታን በሰማይ
 አምረሽ ንጹህ ሆነሽ በፊቱ እንድትቀርቢ
 ሩጫዬ ይኸው ነው የእርሱ እንድትሆኚ

አይኖችሽን በእምነት እንድኩልልሽ
  ጌታን እንድታይው ታላቅ አድርገሽ
 የቀድሞ ኑሮሽን ስቃይ እንድትረሺ
 ድል አድራጊ ሁነሽ ሰማይ እንድትደርሺ
',0),(NULL,'ምኞቴ ምንም ቢቆይ','hebret1','ብዙ ነፍሳቶችን አፍርቼ
 ለጌታ ያማሩ ሆነው
 ቤተክርስቲያን አድጋ አይቼ
 ምኞቴ ጸሎቴ ይኸው ነው

ምኞቴ/ጸሎቴ ምንም ቢቆይ/3*
 ታመጣልኛለህ/ትመልሰዋለህ ጌታዬ ሆይ

ቅዱስ ቃሉን ዘሪዎች ሲዘሩ
 ሜዳ ሸንተረሩን ሳይፈሩ
 ጌታ ደግሞ ዝናቡን ሰጥቶ
 ምኞቴ ማየት ነው አፍርቶ

በተስፋ እጠብቃለሁ አልዝልም
 በምንም በምን አልደክምም
 አልታክትም ተስፋ አልቆርጥም እጸናለሁ
 አንድ ቀን ምኞቴን አየዋለሁ

ጣፋጩ  የሕይወት መንፈስህ
 ሙታንን ቀስቅሶ ሲያስነሳ
 የአጥንት ሸለቆ ተረስቶ
 ሠራዊትህ ለድል ሲነሳ
',0),(NULL,'የተፃፈው','hebret1','የሚናገረኝ ድምጽ በጆሮዬ አንጠልጥለሃል
 የሚመራኝ ልብህ መድኃኒቴ ተክለህልኛል
 ለዘላለም በመንፈስ ቅዱስ ብርታት ልመራ
 ጥበብ ጨምርና ስጠኝ እባክህ በቤትህ ልስራ
 
የተፃፈው ኃይልህ ጌታ ሆይ ይገለጽልን
 የተጻፈው ፍቅርህ አባት ሆይ ይትረፍረፍልን
 የተፃፈው ጥበብ ኢየሱስ ሆይ ለእኛም ይብዛልን
 የተፃፈው ቃልህ እባክህ ይፈጸምልን

የመገለጥ ጥበብ ዕውቀት ሲተረተር
 የብርታትህ የኃይልህ የግርማህ የአንተ ምስጥር
 እጹብ ድንቅ ነው አንተን ለሚያውቁ ለምትወዳቸው
 በአካልህ ውስጥ የሚኖሩትን ስትመራቸው

ካለአንተ ኃይል በጭራሽ ምንም አናረግልህ
 ፍሬም ፍጹም በብዙ አመታት አናፈራልህ
 አንተው ሥራ የሚድኑትን ራስህ አምጣልን
 ቅዱስ አካልህን አንተው ገንባ ተቀደስብን

ለእኛ አይደለም ጌታ ለራስህ ስትል ተነሳ
 ቤተ ክርስቲያንህን ኢየሱስ ሆይ እራስህ ምራ
 እጅግ በጣም ታላቅ ስምህን ሁሉ እንዲያውቀው
 በመንፈስ ቅዱስ ኃይል የሱስ ሆይ እንዲያድግልን ነው
',0),(NULL,'ውጊያ ልጀምር ከሥጋዬ','hebret1','ውጊያ ልጀምር ከሥጋዬ 
ጠላቴ ነውና አድመኛዬ
ድል እያገኘሁኝ በሩጫዬ
ያለ ነውር ልኑር ለጌታዬ

ሥጋዬ እያስቀደምኩ ማስደሰት
 እንዴት ይቻለኛል በእውነት
  ሥጋዬ እንዲሻር ያስፈልጋል
 ጌታ እንዲከብር ይገባዋል

የቀድሞ ቅዱሳን ድል አደረጉ
 ሥጋቸውን በመግዛት አሸነፉት
 የአዳምን ሥራ እየረሱት
 ሁለተኛውን አዳም ለበሱት

አለምን በሥጋ ልኮንነው
 የሥጋን ፍላጎት እንድሰቅለው
 ውስጣዊ ሰውነት እንዲዳብር
 የሚታየውን ልሻር በምድር

የሚታየው የአለም የሚቀር
 የሚሞተው ሥጋ የአፈር
 ከኢየሱስ አምላኬ እንዳይለየኝ
 ጽዮንን ለመግባት ኃይሉ ይርዳኝ
',0),(NULL,'ላክብርህ ኢየሱስ መድኃኒቴ','hebret1','ላክብርህ ኢየሱስ መድኃኒቴ
    ላክብርህ በመላ ሕይወቴ
    ላክብርህ ዘወትር በሥራዬ
     ላክብርህ በሁለንተናዬ

መታዘዜ ስትፈጸም አለመታዘዝን ልበቀል
 አለም የጠላችህን ፈንታ ኢየሱሴ በፍቅርህ ልንደድ ይጋል
 ወደ ሙላትህ እንድደርስ የልቤም አይኖች ይብሩ
 ወደፍጹምነትህ ልደግ ጌታዬ ሆይ በእኔም  ክበር

ምንም ምን የፈለገው ለኢየሱሴ ብሆን
 አይቆጨኝም በጭራሽ የየሱስ ስም ይመስገን
 ጌታዬ ኢየሱስ ክብሬ የምናፍቅህ 
 ፍቅርህ አስክሮኛል ብርቅ ሆኖኛል ስምህ

ማለዳም ቀትርም ማታም ጠራሃለሁ
 በሥጋ በነፍስም ከልብ ወድሃለሁ
 በዚች በምድር ላይ የመኖሬ አላማ
 ጌታ አንተን ማክበር ነው ልመናዬን ስማ

ምን ብዬ ልናገር ስለፍቅርህ ጌታ
 እንዴትስ ልዘርዝር የአምላኬን ውለታ
 ግሩም ድንቅነትህ ከመነገር ያልፋል
 ከወርቅ ከእንቁ ይልቅ ስምህ ይሻለኛል
',0),(NULL,'ጌታችን ቢፈቅድ ብንኖርም','hebret1','ጌታችን ቢፈቅድ ብንኖርም/2*
 ይህን ወይም ያን እናደርጋለን
 ወዲያ ወይም ወዲህ እንሄዳለን
 ጌታችን ቢፈቅድ ብንኖርም

ነገ ለራሱ ይጨነቃል
  የቀኑ ክፋት ይበቃዋል
 ብዙ ውሳኔ ቢኖረኝም
 ነገ አያስመካኝም

ሕይወት ምንድነው ከንቶ እንፋሎት
 አሁን ታይቶ አሁን የሚጠፋ
 ጌታችን ቢፈቅድልንና ብንኖርም
 ስለዚህ ማለት ይገባል
 
ከዚች ከተማ አልፈን ወዲያ ማዶ
 እንኖራለን በአምላካችን ኃይል
 በኢየሱስ ፍቅር ትዳር ለምልሞ
 እንመለሳለን በድል
',0),(NULL,'ጌታን ላልከተል እችላለሁ','hebret1','ጌታን ላልከተል እችላለሁ
 ከምርጫ ስልጣን ጋር ተፈጥሪያለሁ
 ግን በመስቀል ላይ መሞቱ ለእኔ
 ሥቃዩ እንባም ነው የመድህኔ
 የሚያፈርስ የሚንደው ትዕቢቴን
 እከተለዋለሁ መድኃኒቴን/2*

እኔ ስጣላ ከእግዚአብሔር ጋር
 ቢያመጣ ኖሮ ጋሻና ጦር
 እኔም ክፋቴን መመከቻዬ
አደርገው ነበር መሸሸግያዬ
ግን ኢየሱስ በጦር ሳይሆን በፍቅር
ጠላቱን ወግኝቶ አሁን ሞቻለሁ
 ለጌታዬ ብቻ እኖራለሁ/2*

ምን ታላቅ ብሆን ምንም ብታወቅ
 ምንም ያህልም ደግሞ ብራቀቅ
 በውኑ ሕሊናዬስ ይፈቅዳልን
 ልቤስ በአምላኬ ይታበያልን
 በሰው ልኮራ እችላለሁ
 በአምላክ ብታበይ ግን እጠፋለሁ
     እኔ ለኢየሱሴ እሰግዳለሁ  /2/
',0),(NULL,'ማዳንን ያውቃል አድኖም ይጠብቃል','hebret1','ለብቻው መራመድ እንደማይችል ሕጻን ልጅ ነኝ
   ከመዳን አንስተህ መሄድን አስተምረኝ
   ሙሉ ሰው ወደመሆን ወደ ሙላትህ ልድረስ
  እለት በእለት እንዳድግ ልቤን አቅና አድስ
   
ማዳንን ያውቃል አድኖም ይጠብቃል
    በሕይወት ጎዳና አለሁልህ በርታ ይላል
    የልጆቹን ጸጉር እንኳ በቁጥር ይዞታል
    ብላቴንነቴን አውቆ ጌታዬ ለልጁ ይዋጋል
                
መቆሜም መኖሬም ባንተ ባለኝ እምነት ነው
   የሱሴ ካንተ ጋር ባልሆን መውደቅያየ አይጣል ነው
   በፊቴ ያለውን ሩጫ ስሮጥ ድምጽህ ያጽናናኝ
   ነገርን በእጅህ የያዝክ እጄን ደግሞ ያዘኝ

በእውቀቴ አልኮራም የሞኞቹ ሞኝ ነኝ
 በሃይሌ አልመካም ደካም ፍጡር ነኝ
 አይኔ ባንተ ላይ ነው ትምክህቴና ረድኤቴ
 ልቤም ባንተ አርፎአል የሱስ ውድ አባቴ

የምትወደኝ አምላክ ድልን የሰጠኸኝ
   ውጊያው ያንተ ፋንታ ነው እኔ አመስጋኝ ነኝ
   ደካማ ጎኔን ጠግን መርምረኝ አክመኝ
   ፍጥረትክን በጅህ የያዝክ እጄን ይዘህ ምራኝ
',0),(NULL,'እግዚአብሔር ሥጋ ለብሶ ተገለጠ','hebret1','እግዚአብሔር ሥጋ ለብሶ ተገለጠ አሜን አሜን
 በምድር ላይ በሰዎች መሃል ተመላለሰ ሃሌሉያ
 ሕዝቡን ከኃጥያት የሚያድንበት የዘላለም ስሙ ኢየሱስ ነው
 በእልልታ በዝማሬ እናንግሰው ሃሌሉያ

የምስራች ዛሬ ታላቅ ደስታ ሆኗል
 በቤቴልሔም በረት መድኃኒት ተወልዷል
 እንዘምር በደስታ ናንግሰው በእልልታ
 ኢየሱስ ተወልዷል ሕዝቡን ከእስር ሊፈታ
 እልልታ ነው ዛሬ እንበል ሃሌሉያ

ጨለማን ሊያጠፋ ጌታ ክርስቶስ ተወልዷል
 እንስገድለት ከልብ ብርሃን በርቶልናል
 እጅ መንሻ ስጦታን ለእርሱ እናቅርብለት
 ብርና ወርቃችንን በደስታ እንሰዋለት
 እልልታ ነው ዛሬ እንበል ሃሌሉያ

እውራንም ይዩ ደንቆሮችም ይስሙ
 አንካሶች ይዝለሉ ዲዶች ይናገሩ
 አጋንንትም ይውጡ ድውያን ይፈወሱ
 ለምፃሞችም ይንጹ ሙታንም ይነሱ
 እልልታ ነው ዛሬ እንበል ሃሌሉያ

ሰባራው ተጠገን ያዘንከው ተጽናና
  እስር ሆይ ተፈታ ጌታ ወርዷልና
 ድሆች የምስራች ኢየሱስ ተወልዷል
 ደስ ይበለን በጣም ዲያቢሎስ ተሸንፏል
 እልልታ ነው ዛሬ እንበል ሃሌሉያ
',0),(NULL,'ምስጋና ሃሌሉያ','hebret2','ኢየሱስ ስለ ምህረትህ ምስጋና
ኢየሱስ ስለ እውነትህ ምስጋና
ኢየሱስ ስለ ወንጌልህ ምስጋና
ምስጋና ያንተ መኖሪያ ነውና

ምስጋና ሃሌሉያ /6*

ኢየሱስ ስለ መንፈስህ ምስጋና
አምላክ ሆይ ስለ ስምህ ምስጋና
ኢየሱስ ስለ አባትነትህ ምስጋና
ምስጋና የራስህ ገንዘብ ነውና

ምስጋና ሃሌሉያ 6*

የሱስ ሆይ ፈቃር ነህና ምስጋና
የሱስ ሆይ ኃያል ነህና ምስጋና
የሱስ ሆይ ታማኝ ነህና ምስጋና
ምስጋና የፍቅርህ ፍሬ ነውና

ምስጋና ሃሌሉያ 6*
',0),(NULL,'ክብር ክብር','hebret2','ማለዳ በቀትር ማታም ላምላኬ ላደርስ ምስጋና
በእቅፉ የሚይዘኝ የሚንከባከብ አባት ነውና
የተፈጠርኩት ለዚህ ነው ለስሙ ክብር ለመዘመር
የዋጀዬኝም ለዚሁ ነው በደሙ በቀራንዮ ፍቅር

ክብር ክብር በምድር በአርያም
      ለሰራዊት ጌታ ለኢየሱስ ይሁን    /2/

ምስጋናን የሚሰዋ ያከብረኛል ብሏልና
ማዳኔንም ብርታቴንም ክብር ሲሰጠኝ ያያልና
ስለዚህ ለመድኃኔ ከልቤ ምስጋናን ላቅርብ
የአምላኬ ህያው ቤት በእሳት አጥር እንዲከበር

ጌታን ዘወትር የምትሹ በረከትን የምትፈልጉ
በምስጋናችሁ ውስጥ ነው ከልብ ፍቅር ስትቀርቡ
በሕዝቤ ምስጋና ውስጥ እኖራለሁ ብሏልና
በደስታ ጌታን አመስግነህ በበረከቱ ተጽናና

ወርቅና ብር ብሰጠው ሕይወቴንም ሁሉ ጨምሬ
ፍቅሩን አይስተካከልም እንድያው ላቅርብ ያፌን ፍሬ
አለማመስገን ቢበዛ አለም ውለታዋ ቢስ ሆኖ
ደግነቱን ያወቅን ሕዝብ እንሰዋ ለኢየሱስ ምስጋና
',0),(NULL,'ኢየሱስ ሲያድን እጣ አያወጣም','hebret2','ኢየሱስ ሲያድን እጣ አያወጣም
ለሰው ልጆች ፊት ከቶ አያደላም
በእምነት ለሚቀርብ ማዳኑን አምኖ
መስጠት አያውቅም ሰፍሮ መዝኖ

ግን ፍጹም ያነፃል
ጥቂትም አያስቀር
ባፈሰሰው ደሙ
         ስለ ቅዱስ ፍቅር
 /2/

ጌታን ከማወቅ መዳን ይቀድማል
ለመዳን ደግሞ መታዘዝ ያሻል
አዳኙም ትዕዛዝ አዲስ ልደት ነው
በጌታ ኢየሱስ ስም የሚገኘው

ልደቱም ያድናል ከሞት አገልግሎት
በመንፈስ ያድሳል ደካማውን ሕይወት /2/

መዳን ድንቅ ነው አዲስ ያደርጋል
የስጋን ምኞት ፍጹም ያጠፋል
ጸጋ ብቻ እንጂ ኃጥአት አይገዛም
በጽድቅ መኖር ነው ለዘለዓለም
ጸጋውን ለማግኘት
ተመስገን ነው ዋጋው
የሚሰጠው ደግሞ
     ኢየሱስ ብቻ ነው  /2/
አሁን ሲጠሩት በምክር አያልፍም
ነገ ተነገወዲያ ጭራሽ አይልም
የጌታ የኢየሱስ ሥራ ዛሬ ነው
በስሙ መዳን መጽደቅ ለሚሻው
የመዳን ቀን ነው/2
ዛሬ የመዳን ቀን/2


',0),(NULL,'በጉብዝናህ ወራት ፈጣሪህን አስብ','hebret2','ጨረቃና ፀሐይ ገና ሳይጨልሙ
በአደባባይ አልቃሾች ሳይሰበሰቡ
በመስኮትም የሚያዩት ደብዝዘው ሳይቀሩ
ፈጭታዎችም በብዛት ሳይሰባበሩ

ደስ አያሰኘኙም የምትላቸው
ዓመታት ሳይደርሱ
በጉብዝናህ ወራት ፈጣሪህን አስብ
ደስ አያሰኙኝም የምትላቸው
ዓመታት ሳይደርሱ
ነገ አይደለም ልጄ ለእኔ የምትሆነኝ
ትፈልግ እንደሆነ ከአሁኑ አገልግለኝ
በእሸትነትህ ከሆንህ ገንዘቤ
የኔው የራሴው ነህ ስታፈራ ፍሬ

እንፋሎት ሕይወትህ ተነጥቆ ሳይጠፋ
ዕድሜህም በፍጥነት ገስግሶ ሳይገፋ
ወዝህ ሁሉ አልቆ ሳትሸመግል
ልጄ ቃሌን ስማ እኔን አገልግል

',0),(NULL,'አምላክ ሥጋ ሆነ','hebret2','አምላክ ሥጋ ለብሷል እጅግ ግሩም ነው
በኢሳይያስ 9፤6 እንዳለው
የዘላለም አባት ኃያል አምላክ ነው
የዘላለም ስሙ ኢየሱስ ነው

ጌታ ኢየሱስ መድኃኒቴ አምላኬ
ሕይወት ከእነትርፉ ሆነ አምባዬ
ሥጋ ለብሶ መጣ በሞቱም ገዛኝ
በምህረቱ ለዘላለም ዳንኩኝ /2/

ኃያል አምላክ የፍጥረት ሁሉ አባት
የእስራኤል ንጉስ የአለም ብርሃን
ሕጻን ሆኖ መጣ እኛን ለማዳን
ከሞት መርገም ነፃ እንድታወጣን

የሞትና የሲኦል መክፈቻ አለው
አልፋና ኦሜጋ ኢየሱስ ነው
ሞቶ ነበር ለዘላለም ሕያው ነው
የዘላለም አባት ኢየሱስ ነው

ኃጥያተኞች የአለም ወዳጅ ሁሉ
ከገሃነም እሳት ዛሬ የዳኑ
እውነትን ፈልጉ በስሙ እመኑ
ሌላ መንገድ የለም ኢየሱስ ነው

አንተ ኃጥእ ሸክም የከበደብህ
አሁንስ ለምን ትዘገያለህ?
ስሙን እየጠራህ ዛሬ ተጠመቅ
ታጠብ ከኃጥያትህ ንፃ አሁን
',0),(NULL,'የሰማያት ንጉስ ከአለም ጋር የገባው','hebret2','ንስሃ ግባ ተናዘዝም ለጌታ ንገር
በደልህን ሁሉ አትደብቅ ግለጽ በፍቅር
በመስቀሉ ላይ ለአንተ ሲል ነው የሞተው ጌታ
እንግዲህ ያዘው አትልቀቀው ነው የአንተ አለኝታ

የሰማያት ንጉስ ከአለም ጋር የገባው
ይኸ የምንልህ አዲሱ ኪዳን ነው
አዲስ ትምህርት ሳይሆን ቀድሞ የነበረ
ይኸ አዲስ ኪዳን ነው በጣም የከበረ

ተጠመቅ ዛሬ በኢየሱስ ስም ና ተጠመቅ
ውሃ ውስጥ ግባ ለሥርየት ግባ ጥለቅ
መታዘዝህ ነው የሚያድንህ ለቅዱስ ስሙ
ተጠመቅ ዛሬ ጥለቅ ታጠብ በቅዱስ ደሙ

የልብህን መሻት ይሰጥሃል ያደርግልሃል
ጸሎትህንም ይሰማዋል ይመልሰዋል
ፈልግ አንኳኳ በደንብ ጠይቅ ይፈጽመዋል
በመንፈስ ቅዱስ ሕይወትህን ያጥለቀልቃል
',0),(NULL,'እነሆ መልካም ነው','hebret2','እነሆ መልካም ነው
እነሆ ያማረ ነው
ቢቀመጡ ወንድሞች በሕብረት
ታዟልና ሕይወት በረከት /2/

አዳዲስ ነፍሳት ማየት ይቻላል
የሕይወት ትምህርት በዚያ ይሰጣል
የጽዮን ግርማ ይታወጃል
ሕዝቡ በአንድነት ይባረካል

የሕይወት ጭንቅ ካለ ይደመሰሳል
የመለያየት መንፈስ ይጠፋል
የመተባበር መንፈስ ይላካል
ትልቅ ትንሹ ጥሙን ያረካል
የራበው ቢኖር በዚያ ይጠግባል
የደረቀው ነፍስ ይረሰርሳል
ጽኑ ደካማን ያጠነክራል
በጽዮን ጉዞ ምክር ይበዛል
የእግዚአብሔር ሰዎች በዚያ አሉ
የናፈቁትን ሁሉ ያያሉ
የመንፈስ ቅዱስ በአል ይሆናል
በሰማይ ያለው ይታወጃል
',0),(NULL,'ቤተክርስቲያን','hebret2','ዓለም ሳይፈጠር ጌታ ያቀዳት
የእውነት መሰረት የእስራኤል ታቦት
ከዘላለም ዘመን በፊት የነበረች
የየሱስም ብርሃን ልትሰጥ ተገለጠች

ቤተክርስቲያን ቤተክርስቲያን/2*
ቤተክርስቲያን ቤተክርስቲያን/2*

ጌታ የሚሰራው በቤተክርስቲያን ነው
የአካሉ እራሱ ጌታ ኢየሱስ ነው
እያንዳንዱ ብልት እያደረ ያድጋል
በሥርዐት ጌታ ቤቱን ይገነባል

የፊት መጨማደድ ወይም እርኩሰት
በቤተክርስቲያን ላይ እንዳይኖርባት
ጌታ ያነፃታል በተዓምራቱ
ይቀደስባታል ባስፈሪው ብርታቱ

ቤተክርስቲያን አበራች ጨለማው ለቀቀ
የጌታ ብርታቱ ለሥልጣናት ታወቀ
ምስጢሩ ተገልጧል በቤተክርስቲያን ነው
የሰማያት ንጉስ ጌታ የሚገኘው
',0),(NULL,'አሜን አሜን ክብር ሃሌሉያ','hebret2','አሜን አሜን ክብር ሃሌሉያ
ሥራው ሰፊ ነው የምንሰራው
ለጌታ ኢየሱስ የምንፈጽመው /2/

ቤቱን ለመስራት ፍጹም ቆርጠናል
የመንፈስ ቅዱስ ኃይል አግኝተናል
በወንጌሉ ቃል ፍጹም ታጥቀናል

ኃያሉ ኢየሱስ ከእኛ ጋራ ነው
ብርና ወርቁ ሁሉም የእርሱ ነው
ሕዝቡ በርትቷል ልቡ እንዳስነሳው

ቤቱን በደስታ እንሰራለን
ቅጥሮቹንም እናድሳለን
ለንብረታችን እንተጋለን

ቀንና ሌሊት እንሰራለን
እየሰራንም እንዘምራለን
እየጸለይንም እንገነባለን

ለጠላት ዛቻ አንበገርም
በሰይጣን ጥበብ አንታለልም
ከእንግዲህ ወዲህ ለራስ አንኖርም
',0),(NULL,'እቃ ብቻ አርገኝ ቅዱስ እቃ','hebret2','እቃ ብቻ አርገኝ ቅዱስ እቃ
እቃ ብቻ አርገኝ ታዛዥ እቃ
ተጠቀምብኝ በባሪያህ
እንዲከብር ጌታ ቅዱስ ስምህ

ተጠቀምብኝ ዘምራለሁ
ስለ ውለታህ እቀኛለሁ
በመንፈስ ቅዱስ በእልልታ
ሐሴትን ላድርግ ላንተ ጌታ

ተጠቀምብኝ መሰክራለሁ
ለዓለም ስምህን አውጃለሁ
የመስቀልህን ሃይል እይዛለሁ
ለዓለም ፍቅርህን አውጃለሁ

ተጠቀምብኝ ጸልያለሁ
ግሩም ፊትህን ናፍቃለሁ
በተሰበረ ልብ ልቅረብህ
ትህትናን ስጠኝ ላስደስትህ

በቤትህ ስኖር እለት እለት
ራሴን ልጠብቅ ከሃጢአት
ቃልህን ልታዘዝ ልስማ በእምነት
መሳርያ እንዳል ሆን ለጠላት

ለስጋን ኃጢአት እሽ አልልም
ጌታ ላሳዝን ህ አልወድም
በኔም ምክንያት ልብህ አይክበድ
መንፈስህ ሰጠኝ ስምህ ልወደድ
',0),(NULL,'ሁለት እጥፍ መንፈስህን','hebret2','ሁለት እጥፍ መንፈስህን
በጣም እሻለሁ ጌታዬ
ኢየሱስ አፍስሰው ለዘላለም ይንደድ በላዬ /2/

ቀዝቃዛ አይደለም ለብ ያለ ለመሆን የምፈልገው
በፍቅርህ በመንፈስ ቅዱስ ልፍለቀለቅ ነው
የእሳት ነበልባል አድርገኝ እኔም አገልጋይህ ነኝ
የሐዋርያት አምላክ ኢየሱስ አንተ ባርክኝ

በመንፈስ ቅዱስ በቃልህ በኃይልህ ነው የተመሩት
የአንተ ሐዋርያት እውነትህን እንዲያሰራጩት
በበዓለ ኅምሳ ቀንም ኃይልህን ያለበስካቸው
ወንጌልን ለፍጥረት ሁሉ እንድያደርሱ ነው

ሌላ ፍላጎት የለኝም መንፈስ ቅዱስህን ስጠኝ
እኔ እንዳሰብኩት ሳይሆን ይለውጠኝ
ከገመትኩት በላይ ሆኖ እንዳሰኘው ያድርገኝ
በልሳንም በትንቢትም አሁን ያናግረኝ

ጥበብ ዕውቀትም ጌታ ስጥ አካልህ እንዲታነጽ
ተዓምራት እምነትም ይኑር እንድትከብር
መናፍስትን ለይ ጌታ ሆይ በፍጹም አይደበቁ
ቅዱሳን በመንፈስህ ኃይል እንዲነቃቁ

የተስፋ ናፍቆት ይዞኛል የሰማይ የምስራቹ 
የወርቁ መንገድ ትዝታ የፍሬዎቹ 
ብዙ ሺህ ነፍሳት አፍርቼ  ልነጥቅ እሻለሁ ጌታዬ 
ጨለማው ይብራ በመንፈስ ክብርህ ይታይ
',0),(NULL,'ጠላት ሰይጣን ይከተልሃል','hebret2','ጠላትህ ሰይጣን ይከተልሃል
ሳያንቀላፋ አንተን ያጠቃል
ወንድም ተጠንቀቅ
ተው እንዳትወድቅ
በእምነት ጋሻ ያለህን ጠብቅ
የጽድቅን ጥሩር ተከናንበህ
ተዋጋ ለነፍስህ በወንጌል ተጫምተህ

የነፍስና ሥጋ ጉዳይ ነውና ይሄ
ሳትጸልይ አትተው ሳታገኝ መፍትሔ
የቆምህ መስሎህ ስትኖር ያለ ስጋት
የገዛ ነፍስህን ጠፍታ እንዳታገኛት

ከአምላክህ ጋራ እንዲህ መላመድህ
ቃሉን ቸል በማለት አለመመልከትህ
ከእርሱ ጋር በእርሱ ውስጥ መኖር መሰልቸትህ
እወቀው በደንቡ ነው መፍረድ በራስህ

ባላጋራህ ዲያብሎስ ሕይወትን ይሻታል
አብረኸው ገሃነም ልትገባ ይፈልጋል
ሃሳቡና ምኞቱን ተረዳና እወቀው
ከኢየሱስ ጋር ትጋ እንድታሸንፈው
',0),(NULL,'ስምህ የሱስ ስምህ','hebret2','ችግሬን ጭንቀቴን አጥፍተህልኛል
ከንቱውን ሃሳቤን ለውጠህልኛል
እልልታ መዝሙር ነው እለት እለት ቤቴ
ፈገግታ እርካታ ነው ዘላለም ሕይወቴ

ስምህ የሱስ ስምህ የሱስ
 የዳንኩበት ስምህ 
ለዘለዓለም ይመስግን 2*

ያለፈውን ስቃዬን ሁሉ ቀብሬአለሁ
አላስተውሰውም አዲስ ሰው ሆኛለሁ
የቀድሞ ተፈጥሮ በጥምቀት ተቀብሮ
አሁን አዲስ ሰው ነኝ የድሮው ተረስቶ

መንፈሱ ወርዶልኝ ጥሜ ረክቶልኛል
እለት እለት የሱስ ክበር ያሰኘኛል
ቅድስና ጌጤ ምስጋና ልብሴ ነው
እውነት መታጠቂያ ወንጌል ጫማዬ ነው

ናፍቆቴ ከእንግዲህ ስሙን መናገር ነው
መድኅን እንድሆነህ በልቡ ለሚያምነው
በጥምቀትም የሱስ እንደሚለበስ
ለሚታዘዝ ሁሉ መንፈስ እንዲፈስ
',0),(NULL,'የቤቴ መሰረት ኢየሱስ ነው','hebret2','የቤቴ መሰረት ኢየሱስ ነው
የኑሮ መካሪ ጥበብ ያለው
በውሳኔ ሁሉ እርሱ ይቀድማል
ጌታ የገባበት ይባረካል  /2/

ለራሴ እንዳላስብ ብላቴና ነኝ
ለብቻዬ እንዳልሄድ አቅም አላገኝ
ለትንሽ ለትልቅ ኢየሱስ ሆይ እላለሁ
የቤቴን ጠበቃ እርሱን ወክያለሁ
ጠባቂ ዘበኛ ሐኪም ቀላቢዬ
በክፉም በደጉም አለሁ ባይ አባዬ
በማዕድዬ በሥራ በልቤም ዙፋን ላይ
እርሱን አስቀምጬ አለኝ ግሩም ሲሳይ

አልቅደምህ ጌታ ታግሼ ልጠብቅ
እንዲያው አልሯሯጥ ፈቃድህን ልወቅ
አንተ ይሁን ያልከው ጌታ የወደድከው
በቤቴ ይፈጸም ሥልጣኑ ያንተ ነው

የነገን አላውቅም ምን እንደሚያገኘኝ
ዓላማው የእሱ ነው እኔ ተቀባይ ነኝ
የመጣውን ሁሉ በእምነት አየዋለሁ
እኔ የማልችለውን ለእርሱ እለቃለሁ
',0),(NULL,'እኔና ቤቴ','hebret2','እኔና ቤቴ ኢየሱስን
እናመልካለን እንሰግዳለን
ዛሬ ምረጡ የምትወዱትን የምታመልኩትን
',0),(NULL,'ሁሉም በእርሱ ነው','hebret3','ሁሉም በእርሱ ነው/2*
የመለኮት ሙላት ሁሉ
በኢየሱስ ውስጥ ነው  /2/

አልፋና ኦሜጋ አምላክ ብቻውን የሆነው
የዘላለም አባት ሰማይ ምድሩን የሞላው
ሁለት ሦስት የማይሆነው የማይከፋፈለው
ተጠቃሎ የሚገኘው በኢየሱስ ውስጥ ነው

እኔን ያየ አብን አይቷል አብ በእኔ ውስጥ ነው
ብሏል ጌታ ኢየሱስ ሊዋሽ የማይችለው
የዘለዓለም ሕይወት ከፈለግህ መዳን
እግዚአብሔር በክርስቶስ ውስጥ መሆኑን ዛሬ እመን

ከአብ የወጣ ቃል ነው ከእኛ ጋር ያደረው
በማርያም ማህፀን ገብቶ ሰው ሆኖ የወጣው
ከዚያም በሥጋ ውስጥ ሆኖ ለዘላለም ይኖራል
የምወደው ልጄ ይህ ነው እርሱን ስሙት ብሏል

በሥጋው ለዘላዓለም የአብ ማደሪያ ነው
ከአፉ የሚወጣው እስትንፋሱ መንፈስ ነው
አብ ወልድ መንፈስ ቅዱስ በአንድ ተጠቅልሏል
ሌላ በጭራሽ የለም ኢየሱስ ብቻ ሆኖአል
',0),(NULL,'እንዴት','hebret3','እንዴት /4*
ይለወጣል የኢየሱስ ቃል
ሺ አመታት ምንም ቢያልፉም
የኢየሱስ ቃል አይሻርም
እውነት ውሸት አትሆንም 

ሺ አመታት ምንም ቢያልፉም
ቀንም አልፎ ወር ቢደገም
ሰዎች ሰምተው የሚረኩት የኢየሱስ ቃል አይሻርም
እውነት ውሸት አትሆንም

አይለወጥ አይጨመር
የሰዎች እውቀት ቢደመር
ምንም ቢመጣ ምንም
እውነት ውሸት አትሆንም /2/

ከሐዋርያት የተማርነው
ከነብያት የሰማነው
አንድ አምላክ ብቻ እንዳለ
ሁለት ሦስትም እንደሌለ/2*
የእኔ አምላክ አይቀበልም
ሁለት አልፋ ኦሜጋ የለም
አንድ ፊተኛ አንድ ኋለኛ
አንድ ፈጣሪ አንድ እረኛ /2/
እኅቶቼ ወንድሞቼ
የምድር አክሊል ወራሾቼ
ይዛችኋል እና እውነት
ቁሙ ተራመዱበት /2/
',0),(NULL,'ከአንተ ሌላ','hebret3','ከምን ውስጥ አውጥተህ እዚህ አደረስከኝ
ምን አድርጌልህ ነው ሰላም የሰጠኸኝ
ነፍስህን ሰውተህ ነፍሴን ያዳንክልኝ
ምን ነበርኩኝ እኔ እንዲህ ያፈቀርከኝ

ከአንተ ሌላ ከአንተ ሌላ ካንተ በስተቀር
በሌላ ነገር ብመካ ጌታ ሆይ
ሞኝ አልሆንም ወይ /2/

ከኃጥያት ማጥ አውጥተህ እዚህ አደረስከኝ
አውሬ ነበርኩ እኔ ግን ሰው አደረከኝ
አንተን እምቢ ብዬ እስከ ዛሬ ስኖር
ታግሰህኝ ማርከኝ በመስቀልህ ፍቅር

እኔ ብቀርብህ ምን ትጎዳለህ
ብከተል አንተንስ ምን ትጠቀማለህ
ያኔ ኃጥያት ውስጥ ጠፍቼ ስዋኝ
ተመስገን ኢየሱስ ጌታ አዳንከኝ

ባለኝ ዘመድ ቢሆን ባገኘሁት ሃብት
ወይ ደግሞ በጽድቄ በጾም በጸሎት
ፍጹም አልመካም ኃጥያተኛ ነኝ
ስለሞቱ ማረኝ እንጂ የእኔ አዳኝ
ተመስገን ኢየሱስ ጌታ እወድሃለሁ
ባንተ ኃይል በፍቅርህ በጸጋህ ድኛለሁ
ክብር ክብር ክብር ክብር ላንተ ጌታ
ክበር አፍቃሬ የሱስ የኔ አለኝታ
',0),(NULL,'አይዞህ ስትጠመቅ','hebret3','በድካምህ ልጄ እራራልሃለሁ
ማዕበሉ ሲመጣ እሸሽግሃለሁ
ጨካኝ አይደለሁም ቀንበሬ ልዝብ ነው
እምነተህ አይጉደል ፍቅሬን ተማመነው

አይዞህ ስትጠመቅ በስሜ አምነህ
አይዞህ ተሰርዮአል መከራ ፍዳህ
አይዞህ የለብህም ፈጽሞ ኩነኔ
አይዞህ መንፈስ ቅዱስ አርጎልሃል ወገኔ

የጠላቶችህ ክስ ሙግት ሹክሹክታ
በላይህ አንዣቦ ቢነሳህ እርጋታ
ያልነበረ ሸክም ቢጫን እላይህ
አትፍራ ታላቅ ነው ያንተ መዳንህ
አይዞህ ወደኔ ና አትፍራ ፍጹም / አይዞህ ከኔ በቀር ሌላ አምላክ የለም
አይዞህ እኔ ብቻ እኔው ብቻ ነኝ/ አይዞህ የማድንህ የእስራኤል አዳኝ

ከወዲያ ከወዲህ ከዙሪያህ ብታይ
የባህሩ ድንፋታ ማዕበሉ አንድ ላይ
ልብህን አሸብሮ ቢሰማህ ፍራቻ
አስተውል አለሁኝ ከባህሩ ዳርቻ
አይዞህ ተደገፈው ቃሌን ድምጼን ስማ /አይዞህ አይጥልህም ያጽናናሃልና
አይዞህ አይሻርም ሰማይ መሬት ቢያልፍ /አይዞህ የጸና ነው ቃሌን ተደገፍ

የልጆቼ ችግር የራሴ ችግር ነው
አንጀቴ ይላወሳል መንጋዬን ሳስበው
በማይለወጠው ቅዱስ ስሜ ምዬ
ተናግሬአለሁኝ አልጥልህም ብዬ
አይዞህ አትብረክረክ ሌላ አታስብ/አይዞህ አትጨነቅ ደፋር ሁን ከልብህ
አይዞህ የሲዖልም የሞትን መክፈቻ/ አይዞህ ከኔ ጋር ነው ልጄ እመን ብቻ
',0),(NULL,'የሠራዊት አምላክ ሆይ','hebret3','የሠራዊት አምላክ ሆይ
ማደሪያዎችህ እንደምን የተወደዱ ናቸው
ነፍሴ የእግዚአብሔርን አደባባዮች
ትወዳለች ትናፍቅማለች /2/

የአማልክት አምላክ በጽዮን ይታያል
የሠራዊት ጌታ ጸሎትን ይሰማል
በወሰነው ሥፍራ በረከት ይሰጣል
ኢየሱስ ሙላቱ በቤቱ ይኖራል

በቤትህ የሚኖሩ ሁሉ ምስጉን ናቸው
በአደባባዮችህ የተቀበልካቸው
እንደ ሸክላ ሰሪ ትሰራቸዋለህ
የክብር ዕቃ አድርገህ ትፈጥራቸዋለህ

ዋኖስ ጫጩቶቿን የምታኖርበት
እንደምትፈልግ የምታስጠጋበት
እንደዚሁ ነፍሴ መኖርያ አግኝታለች
በኢየሱስ ቤት ውስጥ ተባርካ ረክታለች
',0),(NULL,'ሰው ከውሃ ከመንፈስ','hebret3','ሰው ከውሃና ከመንፈስ
ካልተወለደ በቀር
ወደ እግዚአብሔር መንግስት ሊገባ አይችልም /2/

ማመንህ ብቻ አይበቃህም
ጌታ ሆይ ጌታ ሆይ ማለትህ
ዳግም መወለድ አለብህ
የእግዚአብሔርን መንግስት ከፈለግህ

ወደ ታላቅ ድግስ ተጠርተሃል
ለበጉ እራት ተጋብዘሃል
የሠርጉን ልብስ ሳትለብስ ሄደህ
እንዳትቀጣ ሲኦል ገብተህ
ከክርስቶስ ጋር አንድ ትሆኑ ዘንድ
የተጠመቃችሁ ሁሉ
የሰርጉን ልብስ ክርስቶስን ለብሳችኋል /2/

የለበስከው ሥጋና ደም
የእግዚአብሔርን መንግስት አይወርስም
በስባሽ ነው እዚሁ ይቀራል
ሌላ ክቡር ሥጋ መጥቶልሃል
በእጅ ባልተደረገ መገረዝ
በኢየሱስ ስልጣን ስራ
በጥምቀት አሮጌው ስጋ ይገፈፋል /2/

ከሥጋ የተወለደ ሥጋ ነው
ከመንፈስ የተወለደ መንፈስ ነው
 በጥምቀት ቀብረህ የሞትን መርገም
በመንፈስ ቅዱስ ማህተም ተታተም
',0),(NULL,'ኢየሩሳሌም ኢየሩሳሌም','hebret3','ከፈርዖን እስር በድል ወጥቻለሁ
ጠላቶቼን በጥልቅ ባህር ቀብሬአለሁ
ግብጽን ትቻታለሁ ዳግም ላልመለስ
ቆርጫለሁ ልጓዝ ከነዓን እስክደርስ
ውዴ ጽዮን መቼ አይሸ ይሆን?

ኢየሩሳሌም ኢየሩሳሌም
ይታየኛል ጭላንጭልሽ
ይነፍስብኛል መአዛሽ
የኤሽኮልን ወይን ቀምሻለሁ
ልምላሜሽን አይቻለሁ

በኢየሱስ ኃያል ስም መንገዴን ተቃንቷል
የቃሉ የእሳት አምድ በፊቴ ያበራል
አሸዋው ጠጠሩ ከስር ቢያቃጥልም
የፍቅሩ ደመና ከላዬ አይለይም
ውዴ ጽዮን መቼ አይሽ ይሆን?

የማራ ሕይወት መራራ ውሃ ሞልቶበታል
የቀራንዮ ዛፍ ገብቶበት ፈውሶት ጣፍጧል
የኮሬብ አለት ውሃ መንፈሱ መጠጤ ነው
ለረሃቤ ቃሉ በረከት መና ነው
ውዴ ጽዮን መቼ አይሽ ይሆን?

ዱባ ሥጋ ቀረብህ ሽንኩርቴም ጣፋጭ ነው
ብላ ብትልክብኝም አለም መልሴ ያው ነው
ማር ለውስ መርዝ ነው ድግስሽ ይቅርብኝ
ከዱባሽ የሚበልጥ የጽዮን ወይን አለኝ
ውዴ ጽዮን መቼ አይሽ ይሆን?
አማልቅ ስጋዬ ሊዋጋኝ ቢመጣ
ወደልረባ አለም ሊያዞረኝ ብያቀታ
ተስፋ ቁረጥ ሰይጣን እጄን አልሰጥህም
መከራን ፈርቼ ጽዮንን አልክድም
ውዴ ጽዮን መቼ አይሽ ይሆን?
',0),(NULL,'ወደ አለምም ሁሉ እንሄዳለን','hebret3','ወደ አለምም ሁሉ እንሄዳለን
 የኢየሱስን ወንጌል እንሰብካለን
 መዳን በኢየሱስ ስም ብቻ መሆኑን
 ለፍጥረታት ሁሉ እናውጃለን
',0),(NULL,'እኔም እንደ ዳዊት','hebret3','እኔም እንደ እነ ዳዊት
ላመስግንህ በመዝሙራት
በአዳዲሶቹ ቅኔ
ልወድስህ መድህኔ /2/

በአዳዲሶቹ ዜማ
ልዘምር ያንተን ግርማ 
ስለ ጽዮን ተራራ
ስለ ውቦችህ ሥራ

ስለ ታላቁ ክብርህ
ስለ ገናናው ስምህ
ልገዛ አንተን መፍራቴ
ተረከበኝ መዝሙሬ

ከሚዘምሩት ጋራ
ድንቃድንቆችህን ላውራ
በአለም ሕዝቦች ዘንድ
የእግዚአብሔርን ክብር

አምላክ የተፈራ ነው
ፍቅሩ በጣም ግሩም ነው
ልዘምር ለኃያል ስሙ
ፍጥረታት ሁሉ ይስሙ
',0),(NULL,'ማነው? በበረት መሃል ተወልዶ','hebret3','ማነው? በበረት መሃል ተወልዶ
በግርግም ተኝቶ የማየው
መላዕክት የዘመሩለት
እረኞች የሰገዱለት
ሰባ ሰገል ከሩቅ መጥተው
እጅ መንሻ ያቀረቡለት
ሄሮድስ ዝናውን ሰምቶ
ብዙ የተጨነቀበት

ታላቁ ጌታ ኢየሱስ ነው
ፍጥረታትን የፈጠረው
ፍቅር ይዞት ምህረት ወድዶ
ተዋረደ ከክብር ወርዶ
አልፋ ኦሜጋ አንዱ አምላክ ነው
ከእኔ ሌላ የለም ያለው
የቃል ኪዳኑ ፍጻሜ ደርሶ
በበረት ታየ ሥጋን ለብሶ

በኢሳያስ ዘጠኝ ስድስት
ኃያል አምላክ የተባለለት
የዘለአለም አብ ድንቅ መካር
ለአስተዋለው ወርዶአል በምድር

መገለጡ እንዴት ድንቅ ነው
ለሚያምኑበት በረከት ነው
ለማያምኑት ላልፈለጉት
 ዎዮታ ነው የፍርድ እሳት
',0),(NULL,'ኢየሱስ ሆይ ውብ ነህ','hebret3','ኢየሱስ ሆይ ውብ ነህ/4*
ኢየሱስ ሆይ/4*

ሰማይ መሬቱን የፈጠርከው
በዘመናት የሸመገልከው
አልፋ ኦሜጋ በሲና ላይ
ነጎድጓድ መብረቅ እሳቱን ሳይ

በቤተልሄም እጋጣው ላይ
ሣሩ ያበራል ለክብርህ
እንደ ደካማ ሕፃን ሆነህ
አይሃለሁኝ ተኝተህ

በቀራንዮ ኮረብታ ላይ
ደምህ ከእጅህ ከእግርህ ሲፈስ
በእንጨት ላይ ሞተህ እኔ አንተን ሳይ
ጌታዬ ዕንባህ ለእኔ ሲፈስ

በደም የተረጨውን ልብስህን ለብሰህ
ስትመጣ የንጉሳን ንጉስ ሆነህ
ዓለምን በእሳት ልትቀጣ
ከቅዱሳን ጋራ ስትመጣ
',0),(NULL,'ኢየሱሴ','hebret3','ምንም ሳልሆንልህ አፍቅረኸኝ
ለስምህም ጥምቀት ያበቃኸኝ
መንፈስ ቅዱስህንም የሞላኸኝ
ጌታዬ ሆይ ለአንተ ምን ላደርግ ነው

ኢየሱሴ ታላቁ ጌታ/2*
ኢየሱሴ የእኔ አለኝታ/2*
ኢየሱሴ ኃያሉ አምላክ/2*
ኢየሱሴ ነፍሴንም ያዳንክ/2*

ስምህን ከሁሉ በላይ አድርጌ
ክብረትም ንብረትም መጠጊያዬ
መታመኛዬ ነህ መሸሻዬ
በእውነት እሰግዳለሁ ለአንተ ጌታ
ፍቅርህን እያሰብኩ የእኔ አለኝታ

ፍቅሬ የምወድህ የእኔ ጌታ
ኃይልን የምትሰጠኝ እንድበረታ
ነፍሴን የወደድካት መድሃኒቴ
እረኛ ዘመዴ ኃይል ብርታቴ
ተመስገን ተመስገን ጌታ አምላኬ

ታላቁ እግዚአብሔር ብቻህን
የእስራኤል ፈጣሪ የእኛ መድህን
ያለ አንድ አማካሪ ገዛ ራስህ
ዓለምን የፈጠርክ በግሩም ክንድህ
ጌታ ኢየሱስ ክበር ስለ ፍቅርህ
',0),(NULL,'ምን ልታዘዝ ?','hebret3','አንተን ለማስደሰት ከሰማይ ወርጄ
ወንድምህ ሆኛለሁ ፍጥረትን ወድጄ
ሕይወት እስከትርፉ እንዲበዛልህ
የመኖር ትርጉሙ እንዳይጠፋብህ

ልጄ የምወድህ ምን ልታዘዝ?/4*

ስለ ባህርዬ አትጠራጠር
ርኅሩኅ ነኝ የዋህ ነኝ ታማኝ ነኝ ፍቅር
ስላንተ የማስበው ሐሳቤ ሰላም ነው
ተንኮል የለበትም ሁሌም ለመልካም ነው

ሁሉን እችላለሁ አደርገዋለሁ
የልብህን መሻት እሰጥሃለሁ
እኔን ከመጥራትህ ከእምነትህ በስተቀር
አያስደስተኝም ጭራሽ ሌላ ነገር

የለበስኩት ሥጋ ቤተ መቅደሴን
ከሰዋሁት ለአንተ ንጹሁን ልጄን
እንዴት ሌላ ነገር እንዲያው አልሰጥህም
አስደስተኝ ልጄ ጠይቅ አልነሳህም
',0),(NULL,'ለጌታዬ የፈለገው (የፍቅሩ እሳት) ','hebret3','የፍቅሩ እሳት ልቤን አንድዶታል
የጌታ ታላቅ መገለጥ እውነቱ
የመንፈሱ ኃይል ሕዋሳቴን ወሮአል
የኢየሱስ በመስቀል መሞቱ

ለጌታዬ የፈለገው ልሁንለት
ለጌታዬ እሱስ እኔን ወዶ ሞቶ የለ
ለጌታዬ ፈቃደኛ ነኝ ብሰዋለት
ለጌታዬ እሱስ ለእኔ መዳን ሰጥቶ የለ

እመካበት የነበረው ነገር ሁሉ
ወደቀ አሜን ተንኮታከተ
ባለውለታዬን ጌታን ላውቀው
ያለኝን ሁሉ እተዋለሁ

ለጌታዬ የፈለገው….

እዚህ ባለሁበት ዘመን ሁሉ
ከዚህ የበለጠ ነገር አላውቅም
ምንም አይነት ነገር የትም ቦታ
ከጌታ ጋር አይወዳደርም

ለጌታዬ የፈለገው…
',0),(NULL,'ሕይወቴን ባርከሃታል','hebret3','እኔ ወዳንተ ስመጣ ፍጹም አላሰብኩም
ይህን ያህል የከበረ መዳን አላለምኩም
አንተን ይቅር በለኝ ብዬ ልወድቅ በእግርህ ስር
ነበር አንተ እንደፈረድከው ልቀበል ቅጣትህን

ሕይወቴን ባርከሃታል
ከገመትኩት በላይ ሆነ/4*

የእለት ራቡን ሊያስታግስ እንደሚለምን ድውይ
ነበር ደጅህን ያንኳኳሁት ድርቆሽ እንድትጥልብኝ
ግን ስምህ ይባረክ ጌታ ቤትህ ሆነ መኖርያዬ
ታስደስተኛለህ ይኸው በአዳራሽህ ሲሳይ

ልቤ እረፍት ሰላም ሲያገኝ ሕይወቴም አማረህ
አካሌ በቅዱስ ጤናህ ረካ ለመለመህ
ሕዋሳቶቼ በሙሉ ሐሴት ያደርጋሉ
ወዳጆቼ እኔን አይተው አንተን ያመልካሉ

የንስሐን ፍርፋሪ ነበር ያሻው ልቃርም
የጥምቀትን ድግስ ሳይቀር አገኘው የመንፈስ ፍቅር
በልሳንም አናገረኝ ሕዋሳቴን ሁሉ ወርሮ
ይህን በሕልሜስ መች አየሁ ተባርኬአለሁ ዘንድሮ
',0),(NULL,'የጌታን ማዳን የሚያበስሩ','hebret3','አትፈር በወንጌሉ ስለ ኢየሱስ መስክር
ጌታ እንዲባርክህ በፊቱ እንድትከብር
አውራ በጉባኤ ንገር በጎዳና
በአፍህ መስክረህ ትጸድቃለህና

የጌታን ማዳን የሚያበስሩ
የኢየሱስን ስም ሚናገሩ
ብዙዎችን ለጽድቅ የሚጠሩ
እንደ ከዋክብት ይደምቃሉ/2*

ጠላት ዲያቢሎስን የምታሸንፈው
በኢየሱስ ደምና በመመስከርህ ነው
ስለዚህ አትታክት በምድር እስካለህ
እለፍ ወደ ሰማይ ለኢየሱስ መስክረህ

በመክሊትህ ነግድ በእንቁ ሥራበት
ግን በማስተዋል ሂድ ከውሾች ተጠበቅ
ወደ ተጎዱት ሕይወት ለራባቸው
ይህን የሕይወት እንጀራን ጌታን አሳያቸው
መንፈስ ጌታ የሰጠህ እንዲሁ አይደለም
እንድትመሰክር ነው ስሙን ለመላው አለም
ኃይልን አግኝተሃል ምን ትፈልጋለህ
ለወንጌል አደራ ግን መሄድ አለብህ
',0),(NULL,'ሆ እያሉ','hebret3','ሆ እያሉ/2*
 ምህረቱ ለዘለዓለም ነው እያሉ
 እስራኤል እግዚአብሔርን ሲያመሰግኑ
 በጦርነት በውጊያ ኃያላን ሆኑ

 ኢየሱስ ብቻ/4* እያሉ
ሐዋርያት ስለ ስሙ ሲመሰክሩ
 በአይሁድ አገር በአሕዛብም
 ኃያላን ሆኑ
',0),(NULL,'ውለታህ በዝቶብኛል','hebret4','በመከራ ማእበል ውስጥ እኔ አለተውከኝም
ኃጥያተኛም ብሆን ችላ አላልከኝም
የሱስ ሆይ ለእኔ ብለህ በመስቀል ላይ ደክመሃል
ክቡር ደምህ ሳያሳዝንህ አፍስሰሀዋል

ይህ ሁሉ አንሷል ብለህ ትንከባከበኛለህ
ውለታህ በዝቶብኛል ምስጋና ይገባሃል /2/

የሸክሜን ቀንበር ጥዬ በመስቀልህ ላይ
ተፈውሻለሁኝ የሱስ ሆይ ባንተ ስቃይ
ጌታ አንተ ተጨንቀህ እኔ አርፌአለሁ
አንተ ተርበህ ተጠምተህ እኔ ረክቼአለሁ

ጆሮ ያልሰማዉን አይንም ያላየችው
ፀጋህን አግኝቻለሁኝ በሰው ልብ ያልታሰበው
አይገባኝም ነበር ለእኔ ይህ ታላቅ መዳን
የሱስ ሆይ ያንተ ምህረት እኔን ለዚህ አበቃኝ

ልቤን በሰማያዊ ፍቅር ሞልተኽዋል
በሕይወቴ ሰላምን እንደ ወንዝ አፍስሰሃል
የሱስ አንተ ከአባት ከእናትም ትበልጣለህ
ከብርና ከእንቁ ከሃብትም ሁሉ ትሻላለህ

አያልቅም ፀጋህ እየቆጠርኩ ባድር ብውል
ውለታህ በዝቶብኛል ምስጋና ይገባሃል /2/
',0),(NULL,'ኢየሱስ ነው የአለም ሁሉ ቤዛ','hebret4','ሁሉም ኃጥአት ሠርቷል
የአምላክ ክብር ጎድሎታል
ያለ ኢየሱስ ቤዛነት ከቶ ማን ይድናል
ምህረትን የሚወድ የሠራዊት ጌታ
ስለ እኛ ተሰቅሎ ሞቷል በጎልጎታ

ኢየሱስ ነው የአለም ሁሉ ቤዛ/2*
የጠፋውን በደሙ የሚገዛ/2*

በአባትነት ፍቅሩ ከልብ ይወደናል
በኃጥአት እንዳንሞት ሥጋ ለብሶ መጥቷል
ወደ እርሱ ሊያቀርበን እጆቹን ዘርግቷል
ዘወትር ይጣራል ምህረቱ አስቦ 

ለሰው ልጆች ያደረገው ብዙ ነው
ሰማይ ምድሩ ኢየሱስን ያመስግነው /2/

ያዳነውን ቅዱስ ሕዝብ በክንፉ ሰብስቦ
በደስታ ይሞላዋል ምህረቱን አዝንቦ
ከሚጎዳው ነገር ራሱ ተከላክሎ
በድል ይመራዋል ባህርን አሻግሮ

የዋጃትን ነፍስ ለድንጋጤ አይጥላትም
ብትባዝን እንኳን ሳይመልስላት አያርፍም /2/

በአመጸኛው ዓለም ውስጥ በደሙ ሸፈነን
ሥጋ እንዳያሸንፈን በመንፈሱ ረዳን
ምድረበዳውን ሁሉ የሚያሳልፈን
ኢየሱስ በኃይሉ ነው እስከ አሁን ያጸናን

እንኖራለን በቸርነቱ ታምነን
በስሙ ቆመን ሃይማኖትን ጠብቀን /2/
',0),(NULL,'የት አለ ጽድቄ የሚቆጠርልኝ','hebret4','የት አለ ጽድቄ የሚቆጠርልኝ
ወደ ኢየሱስ ፊት እኔን የሚያቀርበኝ
ግን አንድ ነገር አለኝ ምህረቱ
የምታደስበት በየዕለቱ
ስለዚህ ነው ደስ የሚለኝ

መተማመኛዬ ነው ምህረቱ የማይለወጥ ቸርነቱ
እኔን አቆመኝ እስከ ዛሬ በሕይወት አኖረኝ በቤቱ
አዲስ ነው ለኔ በየዕለቱ /2/

ባዶ ነኝ እኔ ፍጹም ባዶ አንዳችም የማልጠቅም
ከአምላኬ ምህረት የተነሳ ሕይወት አለኝ ለዘላለም
ትምክህቴ ለኔ የየሱስ ስም ነው /2/

ጌታ ኢየሱስ እረኛዬ ነው የሚያሳጣኝም የለም
በለመለመ መስክ ሊያሳድረኝ እኔን መለሰኝ ከገሃነም
ስለ ቅዱስ ስሙም በጽድቅ መንገድ መራኝ /2/
',0),(NULL,'ኢየሱስ አልፋ ኦሜጋ ነው','hebret4','ኢየሱስ አልፋ ኦሜጋ ነው
ዘመን የማይሽረው ያለ የሚኖር ነው /2/

ሰማይን ዘርግቷታል ምድርን መስርቷታል
ተራሮች ባህሮች በእርሱ ተፈጥረዋል
እኛ የምናመልከው ጌታ የሁሉ ፈጣሪ ነው

የምድርን ዕፅዋትና እንስሳት
እሱ ፈጠራቸው የሰማይ ብርሃናት
እኛ የምናመልከው ጌታ የሁሉ ፈጣሪ ነው

ሥራው አይመረመር አሳቡ አይደረስ
ምስጢር ሁሉ የሚያውቅ የማይታይ ረቂቅ መንፈስ
እኛ የምናመልከው ጌታ የእውቀት መሰረት ነው

ሞት የማያሸንፈው ሲኦል የማይገዛው
ሁሉም የሚችል ኤልሻዳይ ነው
እኛ የምናመልከው ጌታ የኃይላት ምንጭ ነው

ከጥንት የነበረ ፍጻሜም የሌለው
ዘላለም ኗሪ ጊዜ የማይለውጠው
እኛ የምናመልከው ጌታ አልፋ ኦሜጋ ነው
',0),(NULL,'ታምራቱን እናያለን ','hebret4','ታምራቱን እናያለን በቤተክርስቲያን ውስጥ ሆነን
ታምራቱን እናያለን ኢየሱስ በእሳት ተገልጦ
ታምራቱን እናያለን አህዛብ በስሙ ሲጠመቁ
ታምራቱን እናያለን በመንፈስ ሲፍለቀለቁ

በአምላካችን ቤት ተተክለን በቅዱስ ቃሉ ሥር ሰደን
በአንድ ልብ በአንዲት ነፍስ በጸሎት ዘወትር እየተጋን
ታላቁን ተስፋችን ይዘን በጸጋው እጅግ ጸንተን
ስሙ ኃይላችን አድርገን ስንቆይ በቤተክርስቲያን

በማየት ሳንመላለስ ቃሉም ከልባችን አምነን
የኃይሉን ታላቅነት ብርታቱንም ሁሉ አውቀን
ምስጋና ክብር እንዲቀበል ሥራውን ሁሉ ለእርሱ ሰጥተን
ስሙም ጽድቃችን አድርገን ስንቆይ በቤተክርስቲያን

ስለ ጌታ ኢየሱስ ስም ነቀፌታን ሁሉን ችለን
መከራ ችግርን ንቀን ስድብንም ተሸክመን
በሁሉም ነገር ታግሰን በእምነታችን ጠንክረን
ስሙን ትምክታችን አድርገን ስንቆይ በቤተክርስቲያን
',0),(NULL,'ይታየኛል ታላቅ ፍቅርህ','hebret4','ምን አይነት ግሩም ነው ጌታ ፍቅርህ
ክብርህን ትተህ እንድትወርድ ያደረገህ
በሥቃይ እንድትመታ ያስገደደህ
በምድር ስትዞር በመንከራተት
በድካም በረኃብና በጥማት
በመከራና በችግር የተጎዳህ

ጌታ ኢየሱስ ሳስብ ጎልጎታን
ይታየኛል ታላቅ ፍቅርህ
በመስቀል ላይ ስቃይ ጣርህ 

ነፍስህ እጅግ አዝና እስከ ሞት ድረስ
በጭንቀት ተከበህ የጸለይኸው
ጌቴሴማኔ በፍርሃት ስትጣጣር
ተንበርክከህ ሳለህ የደም ላብ
ሲወርድ የሚታየው እንደ ነጠብጣብ
እንዴት ተገደህ ነው ጌታ በእኔ ፍቅር

እጆችህ እንዲቸነከሩ በሚስማር
ጎንህ ደግሞ እንዲወጋ በጦር
ያደረገህ ፍቅር እንደምን ታላቅ ነው
ለእኔ ለኃጥያተኛው ስትል
ነፍስህን እንድትተው በመስቀል
ያደረገህ ፍቅር እንደምን ታላቅ ነው
',0),(NULL,'አላማዬ','hebret4','ዓላማዬ/2*
ጌታዬን ለማገልገል
ተሸክሜ መስቀል
መሮጥ ነው ከኋላ ኋላውን በመከተል /2/

ከአለም ምኞት ተለይቼ ከከንቱነትም ወጥቼ
የሥጋን ፍላጎት ትቼ
ከሕይወት ራስ ከኢየሱስ ጋር መጓዝን መርጬአለሁ
እርሱ ይሻለኛል አውቃለሁ

የሚለኝን እሰማለሁ የሚያዘኝን አደርጋለሁ
ፈቃዱን እጠብቃለሁ
ሲናገረኝ አደምጣለሁ ሲልከኝም እሄዳለሁ
ድምጹን ለይቼ አውቃለሁ

በጎነቱን አውቄአለሁ ፍጹም ፍቅሩን ቀምሻለሁ
እርሱን ለመከተል ወስኛለሁ
ወደግራ ወይም ወደ ቀኝ ላለማለት ቆርጬአለሁ
ከእርሱ ጋር ወደ ፊት እጓዛለሁ

ጌታ እንዲከብር እፈልጋለሁ ከፍ እንዲልም እወዳለሁ
የስሙንም ክብር እሻለሁ
እንደወደደኝ አውቄአለሁ ሕይወቴን ለእርሱ ሰጥቻለሁ
እንዲጠቀምብኝ እሻለሁ
',0),(NULL,'መክሊታችንን አንቅበረው','hebret4','መክሊታችንን አንቅበረው
ጌታ የሰጠን እንድናተርፍ ነው
እንነሳ ወንጌሉን እናብራ በሸለቆ በተራራ

እረኛ እንደሌላቸው በጎች
ሆነው ተንከራተዋል ሰዎች
ከሕይወት መንገድ ርቀዋል
ተቅበዝብዘው ተጨንቀዋል
ወደ አምላክ እንሰብስባቸው
ወደ ሙታን ሸለቆ ወርደን ትንቢት እንናገርባቸው
የደረቁትን አጥንቶች መንፈሱ ያረስርሳቸው
ሕያዋን ያድርጋቸው

አምላካችን ይቀድመናል እንሂድ ወንጌሉን ይዘን
ብዙ ነፍሳትን አፍርተን በድል እንመለሳለን
በምርኮ ደስ እያለን

መልካሙን ገድል ተጋድለው ሩጫቸውን ለጨረሱት
የጽድቅ አክሊል ተዘጋጅቶአል በአምላካችን
በኢየሱስ ፊት በመንግስተሰማያት
',0),(NULL,'የወይንን ግንድ','hebret4','የወይንን ግንድ ከግብጽ አውጥቶ
አህዛብን አባርሮ እርሷን ተክሎ
ያጸደቃት ዛፍ እነሆ አደገች
በጥላዋም ተራሮችን ከደነች /2/

ሥሮቿን ወደ ምድር ሰደደች
ቡቃያዋን እስከ ወንዝ ዘረጋች
ጌታም የእሳት ቅጥር ሆነላት
በግርማውም ሞገስ ከበባት

ሁሉን የሚያውቅ መንፈሱ መረጣት
ሁሉን የሚችል ቀኙ ተከላት
ከቶ ማን ይችላል ሊነቅላት
ጌታ እግዚአብሔር ወዶ ካጸናት

አደገች አህዛብንም ወረሰች
የምድርን ፊት ሁሉ ሸፈነች
ግራውም ቀኙ የእርሷ ሆነና
ተስፋፋች መሰረቷም ጸና

ፍሬ ይገኝባታል በየአመቱ
ለምለም ናት በበጋ በክረምቱ
ሆናለች ለሕዝቡ መጠለያ
መሸሻ መጠጊያ ማረፊያ
',0),(NULL,'እምነት','hebret4','እምነት የማይቻለውን እንደሚቻል
እምነት አድርጎ ያስረግጣል
ተስፋን ያስጨብጣል /2/

ሩቅ ያለውን ተስፋ አቅርቦ ያሳያል
የማይቻል የለም እምነት ይቻላል ይላል
ሳናይ ሳንዳስሰው ተስፋ እናደርጋለን
ለሰው ባይመስለው እንኳን እኛ እናምናለን

ዓለሞችም ሁሉ በአምላክ ቃል ተፈጥረዋል
የሚታየን ሁሉ ከማይታየው ወጥቶአል
ይህ የሚታየው ሲያልፍ ሌላ አለም እንዳለ
ከቃሉ ተረድተናል እኛ እናምናለን

ተስፋ የሰጠን ኢየሱስ ታማኝ ነው
አይነቃነቅም ተስፋችን ጽኑ ነው
በቃሉ ታምነን እንጓዛለን
ዓለምን በእምነት ድል እንነሳለን
',0),(NULL,'ኢየሱስ ከፍ በል በምስጋና','hebret4','ኢየሱስ ከፍ በል በምስጋና/2*
ኤልሻዳይ ነህና
ከፍ በል በምስጋና /2/

በበረሃ ውሃ ያፈለቅኸው
ምድረበዳውን ወንዝ ያደረከው
ሁሉን የምትችል ኤልሻዳይ ነህ
አንዳች ነገር የለም የሚሳንህ

የተከልከው እነሆ ለምልሞአል
የዘራኸው ፍሬ አፍርቶአል
የተራቡትን አጥግቦአል
የተጠሙትን አርክቶአል

ዙሪያውን በግንብ አጥረሃል
ድንጋዩንም ለቅመህ አውጥተሃል
ጠላት እንዳይጎዳው አንተው ራስህ
ከልለኸዋል በመንፈስህ

ወይኑን አንተ ወደኸዋልና
መስዋዕትም ሆነህለታልና
አሁንም ያድጋል ያፈራል
ዓለምን ሁሉ ይሞላል
',0),(NULL,'የኢየሱስ ሥጋ ክቡር ደሙም','hebret4','የኢየሱስ ሥጋው ክቡር ደሙም
ለሚበላው ለሚጠጣው
ሕይወት ነው ለዘላለም /2/

ሥጋውን እበላለሁ ደሙንም እጠጣለሁ
ጌታዬ እስኪመጣ ሞቱን እናገራለሁ
የቀራንዮ ጭንቀቱን ስቃዩን  አስባለሁ

እንዲያው አልተቆረሰም በከንቱ አልፈሰሰም
በመስቀል ላይ የዋለው ዋጋ ቢስ ሆኖ አይደለም
የዘላለም ሕይወት ነው የጌታዬ ሥጋና ደም

ልቤን እያፈሰስኩ ንሰሐ እገባለሁ
በድፍረት አልወስደውም ራሴን እፈትናለሁ
የአምላክ ሥጋ ቅዱስ ነው በፊቱ እዋረዳለሁ

ደሙ ዛሬም ይሰራል ሕያው ነው ይናገራል
የረከሰውን ሕይወት እሳት ነው ይቀድሳል
ወደ መለኮቱ ፊት በድፍረት ያቀርበናል
',0),(NULL,'ሦስት አማልክት የሉም አንድ ብቻ ነው ','hebret4','ሦስት አማልክት የሉም አንድ ብቻ ነው
እንደ ፈቃዱ ምክር የሚሰራው
በሥጋ መጥቶ ራሱን የገለጠው /2/

የፈቃዱን ምስጢር ገልጾልናል
ሁሉን በክርስቶስ ተጠቅልሏል
ሁሉም ተጠቅልሏል
የመለኮት ሙላት በሰውነቱ
ተገልጦ ይኖራል በአምላክነቱ
አምላክነቱ
ይህ እንዴት ይሆናል ቢባል ከቶ
ኤልሻዳይ መሆኑ ተረስቶ
ኤልሻዳይ ተረስቶ
በግምት ወስነው ከመሄዱ
መጠየቅ ይሻላል በወንጌሉ
መጠየቅ በወንጌሉ

ለእኛስ በርቶልናል በልባችን
አንጠራጠርም አንድ መሆኑን
እግዚአብሔር አንድ መሆኑን
ከትዕዛዛት ሁሉ ፊተኛይቱ
እግዚአብሔር አንድ ነው ያ የጥንቱ
እግዚአብሔር የጥንቱ
',0),(NULL,'የአብርሃም አምላክ','hebret4','የአብርሃም አምላክ ቃልኪዳኑን የማይረሳው
ከዘመናት በኋላ እስራኤልን ጎበኘው
ከባርነት ቀንበር አስለቀቀው
የተስፋይቱን ምድር አወረሰው /2/

ያዕቆብን በሜዳ አገኘው
ክንፎቹን ዘርግቶ ወሰደው
ተጠነቀቀለት ከበበው
እንደ አይኑ ብሌን ጠበቀው

በስደተኝነት ተቀመጠ
ነገር ግን ከጠላቱ በለጠ
ጥቂት የነበረው ተባርኮ
እንደ አሸዋ ሆነ በዝቶ

በአምላኩ እየተመራ
 ባሕርን በድል ተሻገረ
ምድረ በዳውን ሁሉ አልፎ
ከንዓን ደረሰ አሸንፎ

ጽኑ አምባ ነው መጠጊያ
ጌታ ኢየሱስ  መደገፊያ
ከድንጋይ ውኃ ያፈለቀው
ሁሉን የሚችል ኤልሻዳይ ነው
',0),(NULL,'ቃሉንና ስሙን ይዤአለሁ','hebret4','በቃሉ እደገፋለሁ
በስሙ እመካለሁ
አምላኬ በቃሉ ታማኝ ነውና
አንድ ቀን ምርኮ እካፈላለሁ /2/

ኃይሌ ምንም ትንሽ ቢሆን በተስፋ እጓዛለሁ
የአምላኬን ታላቅ ተአምራት አንድ ቀን አያለሁ
ቃሉንና ስሙን ይዤአለሁ

አምላክ ከእናንተ ጋር ነው እያሉ ወድቀው እየሰገዱ
ብዙዎች ወደ ቤቱ ሲጎርፉ ከየመንገዱ
እውነት አሸንፎ አያለሁ

የጌታ ኢየሱስ ስም በዓለም ሁሉ ተጠርቶ
የጣዖታት ስም ከምድረ ገጽ ተደምስሶ ጠፍቶ
ወንጌል አሸንፎ አያለሁ

የአምላክ የምህረት ክንዱ ዛሬም ተዘርግቶ
ብዙዎች በቃሉ ድነው ምስጋናው ምድርን ሞልቶ
ጌታ ኢየሱስ ከብሮ አያለሁ
',0),(NULL,'የሺህ ተራሮች እንስሳት','hebret4','የሺህ ተራሮች እንስሳት ለመስዋዕቱ አይበቁምና
የእህል ቁርባንና እጣን አያስደስተውምና
ለአምላኬ ልሰዋለት ምስጋና

እግዚአብሔር ትልቅ ነው እጅግ የተፈራ ነው
በጽዮን ተራራ ላይ ምስጋናው ብዙ ነው
መሃሪ ሞገስ ያለው አምላክ ነው

ከዙፋኑ ወርዶ በሥጋ የመጣልኝ
በመስቀል ላይ ሞቶ ከሥቃይ ያዳነኝ
ኢየሱስ ምስጋናው ብዙ ነው

መድኃኒቴን እንዳይ ዓይኔን ያበራልኝ
በደምና በእንባ በጣር የወለደኝ
የሰማዩ አባቴ ይመስገን

በመንፈስ ቅዱስ ዘይት ራሴን እየቀባኝ
በእምነት ጎዳና ላይ በድል የሚያስኬደኝ
ጌታዬ ይመስገን

',0),(NULL,'እናመሰግንሃለን','hebret5','እናመሰግንሃለን/3*
ጌታችን መድኃኒታችን 
ኢየሱስ መድኃኒታችን

አምላካችን ብዙ ምስጋና
ይገባሃል ታላቅ ፍቅር
ለእኛ ለኃጥያተኞች ብለህ
ሰውተሃል እራስህን

አምላካችን እንወድሃለን
በፍቅር ለአንተ እንገዛለን
ዕድሜአችንን ሁሉ የአንተ ነው
ክብር ለአንተ የቀራንዮ ሰው

አምላካችን የእኛ መከታ
ለዘላለም አንተን መርጠናል
ሕይወታችንንም በሙሉ
በምስጋናህ ደስ ይለናል
',0),(NULL,'ስምህ ይባረክ','hebret5','ፍቅርህ መድኃኒቴ ነው ደስታህ ብርታቴ
ኃይልህ መመኪያዬ ነው ቃልህ መጽናናቴ
በአንተ ተማምኜ እኖራለሁ
የሕይወቴ ዘርፍ ሁሉ ፈገግታ ተሞልቷል
የሚያስጨንቀኝ ሁሉ በአንተ ተወግዶአል
ጌታ በወንጌልህ ረክቻለሁ

ስምህ ይባረክ /3*  መድኃኒቴ
ስምህ ይባረክ /3*  ጌታ ኢየሱስ

የሚያጸድቅ እግዚአብሔር ነው የሚኮንን ማን ነው?
ከሙታን የተነሳው ጌታ ኢየሱስ ነው
አምኜ በስሙ ተጠመኩኝ
በመንፈስ ቅዱስ ፍቅሩ ልቤን አጥለቅልቋል
በወደደኝ በኢየሱስ ጠላት ተቀጥቅጦአል
በሐዋርያት ወንጌል ረክቻለሁ

ግንበኞች ቢንቁህም አንተ ለእኔ ውብ ነህ
ሰዎች ቢያቀልሉህም ለእኔ ግን ክቡር ነህ
ጌታዬ ስምህን አምኛለሁ
የሰዎች ይሉኝታ በጭራሽ አልፈራም
የመስቀልህን ውለታ ፈጽሞ አልረሳም
የሱስ በስምህ ተጠምቄአለሁ

የኦሪት ሸክም ቀረ ጌታ ወሰደልኝ
ሕይወት እስከነትርፉ አትረፈረፈልኝ
በኢየሱስ ስም ድኜ ነጻ ወጣሁ
የአዳም ዘር ቀረልኝ የኢየሱስ ልጅ ሆንኩኝ
በተስፋው መንፈስ ቅዱስ ለሰማይ ታተምኩኝ
ከዚህ የበለጠ ምን ይገኛል?
',0),(NULL,'ማን ነበር ያ ሰው የተሰቀለው?','hebret5','ወደ ቀራንዮ ባሳቤ ስሄድ
አንድ ሰው ተሰቅሎ አየሁት ከግንድ
ከእጁ ከእግሩ ደም ጠብ ጠብ ይላል
ራሱም በእሾህ አክሊል ተወግቷል
እኔም ጠየቅሁ እንዲህ ብዬ

ማን ነህ አንተ ሰው? የተሰቀልከው
በጭንቀት ሞተህ ነፍስህን የጣልከው
መልሱም ይህ ነው
የሱስ ክርስቶስ ነኝ ለፍቅርህ የሞትኩ
አንተን ላከብርህ እኔ ተዋረድኩ
ላድንህ ብዬ ክብሬን ጥዬ
 ላነጻህ ብዬ ዙፋኔ ጥዬ
ስድብ ዱላውን ምስማሩን ችዬ

እንዲህ በፍቅር ሲጠራኝ እኔን
ረግጬው አለፍኩ አዳኙን ደሙን
በኃጢያት መንገድ ወደ ሞት ሮጥኩኝ
እንደ ጠፋች በግ የትም ባዘንኩኝ
ግን ያ ጥያቄ አሁንም ነበር

ካመንኩት የሱስ የሱስ እላለሁ
ከደረቅ መጽሐፍ እታገላለሁ
ጸሎት የሚሉት ጭንቅ ይገጥመኛል
መመስከር ደግሞ በሰው ያስጠላል
ግን ያ ጥያቄ አሁንም መጥቷል

እስቲ ልሞክር በየሱስ ልመን
ደሙም ካነጻኝ የጠራሁ ልሁን
ከተስማማኝም በእርሱ እጸናለሁ
ካላስደሰተኝ እተወዋለሁ
ግን ያ ጥያቄ ተስፋውን ሰጠኝ

ማን ነበር ያ ሰው የተሰቀለው
በጭንቀት ሞቶ ነፍሱን የጣለው
መልሱም ይህ ነው
የሱስ ክርስቶስ ነው ለዓለም የሞተው
እኔን ሊያከብረኝ የተዋረደው
ሊያድነኝ ብሎ ክብሩን ጥሎ
ሊያነጻኝ ብሎ ዙፋኑን ጥሎ
ስድብ ዱላውን ምስማሩን ችሎ

አሁን በዛልኝ የመንፈስ ሰላም
ነፍሴም አገኘች ሕይወት ዘላለም
ደስታና ፍቅር ከቶ አልነበሩኝ
አሁን ህይወቴን ልቤንም ሞሉኝ
የዚያ ጥያቄ ፍሬው ይህ ነው

መጽሐፍ ቅዱስም የወርቅ ማዕድን ነው
መጸልይ ግሩም ባራኪ ኃይል ነው
መመስከር ደግሞ ስለ ፍቅር ነው
የሱስን መጥራት ስላዳነኝ ነው
የዚያ ጥያቄ ፍሬው ይህ ነው
',0),(NULL,'የነፍሴ አምባ መጠጊያዬ','hebret5','የነፍሴ አምባ መጠጊያዬ
አንተ ብቻ ነህ ጌታ ኢየሱስ መሸሸጊያዬ /2/

ጽኑ እና ብርቱ ማንም የማያፈርሰው
ምሽግ ነህ ለነፍሴ ጠላት የማይደፍረው

ችግር ሲያጋጥመኝ ወደ አንተ እሮጣለሁ
ወደ ጉያህ ውስጥም ጌታ እሸሸጋለሁ

ከጠላት ፍላጻ አድነኸኛል
ካስጨናቂው ቁጣ ሰውረኸኛል

መጠጊያ መሸሻ ሌላ አምባ የለኝም
በአንተ ነው እምነቴ እስከዘለአለም
ዕድሜዬን በሙሉ በአንተ እታመናለሁ
እንዳንተ መጠጊያ ከየት አገኛለሁ
',0),(NULL,'መዳኔ ይለምልም','hebret5','በስምህ ስጠመቅ የተሰማኝ ደስታ
በመንፈስ ስትሞላኝ ያየሁት እርካታ
አንድ የመዳን መንገድ ዘላለም ደስታዬ
ልንከባከብለት ይለምልም መዳኔ

በቅድስና በፍቅር
እራሴን በማዋረድ
ኢየሱስን ፈርቼ ሰው በማክበር
በወንድማማች መዋደድን
መዳኔ ይለምልም/4*

በምህረትህ ታምኜ በየቀኑ ልጓዝ
ወንድሞችን ኢየሱስ እንደራሴ ልያዝ
አይረሳኝ ክብሩ ጨለማው ዘመኔ
እንደ ነፍሳት ሸክም ሸክሜ ይሁን መዳኔ

እንደ ነፍሳት ናፍቆት ለነፍሴ ፍቅር አለኝ
ሌሎችን የማርም እኔ ስታረም ነኝ
ከዳንኩኝ ኋላ ነው ሌሎችን የማድን 
እረፍት ስጠኝ ነፍሴ ከሐጢአት ለማምለጥ
በጾም በጸሎት ቃሉን በማንበብ
ለነፍሳት በመመስከር
በኢየሱስ ጸጋ ታምኖ በመኖር
ወንድሞችን ከልብ በማፍቀር

አለምን በሙሉ አድኜ ባተርፍም
ነፍሴ ግን ከጠፋች የት ነው የእኔ ትርፍ
ሌሎችን ማዳኔ የመዳን ፍሬ ነው
መዳኔ ይለምልም ጽሎቴ ይኸ ነው
',0),(NULL,'ይረሳኝ ይሆን መሃሪነቱ','hebret5','ደሙን አፍስሶ ሳልወደው ወዶ
ከሃጢአቴ ነፃ አውጥቶ
በህይወቴ ዘመን የርሱ እንድሆን
የመጠራቴ ቀን ይረሳኝ ይሆን?

ይረሳኝ ይሆን መሃሪነቱ
ይረሳኝ ይሆን ሁሉን መቻሉ
ይረሳኝ ይሆን አባትነቱ
ይረሳኝ ይሆን ለኔ መሞቱ

በስሙ ሃጢአቴ ፍጹም ተቀብሮ
አሮጌው ስጋ ተገፎ
በአዲስ ሕይወት ልኖር ጌታን ለብሼ
ያ የጥምቀቴ ቀን ይረሳኝ ይሆን?

በእስትንፋሱ ባርኮኝ ውድ ልጁ ሆንኩ?
በሰማይ ቋንቋ ተናገርኩ
የልጅ ምልክት የርስት መያዣ
መንፈስ የሞላኝ ቀን ይረሳኝ ይሆን?

አልጥልህም ብሎ ተስፋ አድርጎልኝ
እስከ ፍፃሜ ሊያፀናኝ
በቅድስና ሊያኖረኝ ወዷል
የጌታ ቃል ኪዳኑ ይረሳኝ ይሆን?
ፍጹም አልረሳም መሃሪነቱን
ፍጹም አልረሳም ሁሉም መቻሉን
ፍጹም አልረሳም አባትነቱን
ፍጹም አልረሳም ለኔ መሞቱን
',0),(NULL,'ምነው በቆያችሁ','hebret5','
ምነው በቆያችሁ በጌታ ቸርነት
ምነው በቆያችሁ በአማልካችን ምህረት
ምነው በቆያችሁ እውነትን ይዛችሁ
ምነው በቆያችሁ በእምነት በርትታችሁ

ወንድሞቼ ለምን ባጭር ተቀጫችሁ
ብዙ ሳትጓዙ ታከተ ልባችሁ
ወገኖቼ ለምን ከወገን ሸሻችሁ
በምን አይነት ድንጋይ ተሰናከላችሁ

ሊመጣ ያለው ይመጣል አይቆይም
ጌታ በልጆቹ ትዕግስት አይቀልድም
የከበደው ልብም ይቀለው ነበረ
ግን ጌታን ለመተው ውሳኔው ቸኮለ

እኛስ በአምላክ ጸጋ ብዙ ተጉዘናል
ብዙ ነገር አይተን ብዙ ተምረናል
በፍቅሩ ለመግፋት ደግሞ ወስነናል
ምነው በቆያችሁ ሁሌ ያሰኘናል

እኛስ በአምላክ ጸጋ ብዙ ተጉዘናል
ብዙ ነገር አይተን ብዙ ተምረናል
በፍቅሩ ለመግፋት ደግሞ ወስነናል
ምነው በቆያችሁ ሁሌ ያሰኘናል
',0),(NULL,'ያላየሁትን አይቻለሁ','hebret5','ያላየሁትን አይቻለሁ
ከጠየቁኩት በላይ አግኝቻለሁ
ሁሉ ሞልቶልኛል ጌታ ይክበር
ምንም አይጎድለኝም ኢየሱስ አለኝ

ጌታ አመጣኝ ድሮ አልነበርኩም
ሕይወት ሰጠኝ ነፍስ አወኩኝ
ብዙ ሰዎች መሃል አኖረና
ጌታ አለኝ ወንድሞችህ ናቸው

እንደገና መልሶ ፈጠረኝ
የድሮ ቀረና አዲስ አደረገኝ
ተጠመኩ ጌታዬን ለበስኩት
በመንፈሱ ዳግም ተወለድኩኝ
አዳም ቀረ ከእነ ውትብትቡ
የኢየሱስ ነኝ

ዕለት ዕለት ፈጣሪ ጌታዬ
 ይመስገነው ይገነባል እኔን
ሰማይ ገና ሳይፈጠር ቀድሞ
ለእኛ ቦታ አዘጋጅቶ ኖሮ
ይህን አውቀን በማሳወቅ ላይ ነን 
በኢየሱስ ኃይል
',0),(NULL,'መለስ ብዬ ወደ ኋላ ሳየው','hebret5','መለስ ብዬ ወደ ኋላ ሳየው
በረከትህ ክምር ተራራ ነው
እንደ ሰማይ ጥልቅ ነው ሰፊ ነው
ጌታ ፍቅርህ የማይመዘን ነው

እጅግ በጣም ውድ ነው መልካም ነው
እጅግ ፈቃር ርኅሩህ ነው የዋህ ነው
አላባራም ፍቅሩን ተናግሬ
አልጨርሰውም ጸጋውን ቆጥሬ

ደጋግሜ አስታውሰዋለሁ
መላልሼ እመሰክራለሁ
ለእኔ በተለይ ለእኔ ያረከው
እጅግ በጣም ግሩም ነው ድንቅ ነው
ይህ ነው ተብሎ አይነገርም
ጊዜም የለ እርሱን ለመቁጠር
ፍቅሩ እንደ እሳት በላዬ በርትቷል
ቸርነቱ ነፍሴን ቀስቅሷታል
',0),(NULL,'ካንተ የተሻለ ጓደኛ የለኝም','hebret5','ካንተ የተሻለ ጓደኛ የለኝም
ካንተ የቀረበ ዘመድ አላገኝም
ካንተ የበለጠ ምንም አልመኝም
ኦ የሱስ አለህልኝ ምንም አይጎድለኝም

ነፍሴ አርፋለች ከዙፋንህ ስር
በጥላህ እታመናለሁ
መፍትሔ የሌለው ምንም ችግር
እንደማያገኘኝ አውቃለሁ

እነግርሃለሁ ችግር ጭንቀቴን
የልቤን ሁሉ ገልጬ
አምንብህአለሁ አደራ ህይወቴን
እላለሁ ላንተ ሰጥቼ

አንተ ከኔ ጋር እስካለህ ድረስ
ይሁን የፈለገው ጋ
ምቹ ነው ለኔ ተመስገን የሱስ
እኖራለሁኝ ጌታ 

ሰጥቼሃለሁ አካል ህይወቴን
ያለኝን ሁሉ ውሰደው
ላንተ ያልሆነ ጌታ አምላኬ
ፍጥረትህ ለማን ሊሆን ነው?


',0),(NULL,'ፍቅሬን ፍጹም አርገው','hebret5','ፍቅሬን ፍጹም አርገው
 መዳኔ በዚህ ነው
 መፍረድ መጥላት ይቅር
 ሁሉን በቅን ልየው
 ፍቅርን የታተመ
 የዋህ ቅን ልቦና
 በመንፈስ አብዛልኝ
ገር ንጹህ ህሊና

ከጉድፍ ኃጥአቶች በስምህ ድኛለሁ
 በመንፈስህ ጸጋ በድል እጓዛለሁ
 ነገር ግን ጌታዬ ደም በእጄ እንዳይኖር
 ወንድሜን እንዳልነቅፍ ስጠኝ ፍጹም ፍቅር

ለክፉ ሞኝ ልሁን ከቶ አላጉረምርም
 የወንድሞቼን ቃል በቀና ልተርጉም
 ጥቁር ነጥብ አይኑር በሕይወቴ መማረር
 ያልተበከለ ልብ ስጠኝ ንጹህ ፍቅር

መዘመር መስበክም የጌታ ጸጋ ነው
 ለሕይወቴ          የኢየሱስ ፍቅር ነው
 የነፍሴ ዕድገቷ ጤናዋ የሚለካው
 ለወንድሞች ባለኝ የፍቅር መጠን ነው

በፍርድ ቀን ሌላ ኃጥአት ባይከሰኝም
 ወንድሜን ባልወደው ነፍሰ ገዳይ ነኝ
                         ፍቅር በማጣቴ አልሆን
 እጄን ከደም አንጻ ስጠኝ ቅዱስ ፍቅር
',0),(NULL,'እምቢ በል ልጄ','hebret5','እወቅ መንገዱ ረጅም ነው ወደ ፊት የምትጓዘው
 ግን እመን አምላክህ መሪህ ነው በድፍረት እርሱን ብታምነው
 አደጋ አለው ሁሉ ቦታ በምድር ስታዘግም
 ግን ምንም ችግር ቢመጣብህ እምቢ በል አልጨነቅም

እምቢ በል ልጄ እምቢ በል ልጄ
  እምቢ በል ለኃጥያት
 እምቢ በል ልጄ እምቢ በል ልጄ 
እምቢ በል ለፍርሃት

ፈተና እየበዛ ይሄዳል በየዕለት በየሳምንቱ
 ግን እመን እንደሚከተልህ የጌታ አምላክ ብርታቱ
 አምነህ በድፍረት መታገል ነው እዚህ ጦር ሜዳ እስካለህ
 ምንም ፈተና ቢመጣብህ ፍጹም እምቢ በል ደፍረህ

አንዳንድ ኃጥአን ቢጋብዙህ እንድትተባበራቸው
 ሁሉን ለማስደሰት አትቸኩል በድፍረት እምቢ በላቸው
 ጓደኛን በጥበብ መምረጥ ነው ደፋር ጎበዙን አይተህ
 ባልረባ ነገር አትታለል የሰው ይሉኝታ ፈርተህ
',0),(NULL,'ኦ ይችላል አመስግን','hebret5','ኦ ይችላል አመስግን  ጌታን አመስግነው
ኦ ይችላል አመስግን  ጌታን አመስግነው /2/

ጌታ ይክበር ይመስገን ያከናውነዋል
በሕይወትህ ዘመን ሁሉ ልሸከምህ ይላል
እመን በእርሱ አይዋሽም አትጠራጠረው
ነፍስህ ሁሌ ደስ ይበላት ጌታችን ታማኝ ነው

አመስግነው ጌታህን ፍቅሩን ተማምነህ
 አይከዳህም ፈጽሞ አንተ ካልከዳህ
 የጸና ጓደኝነት ከአንተ ጋር ያደርጋል
 በስሙም ለዘላለም ይጠብቃሀል

 ኦ ይችላል ሊያደርስህ ከግቡ ተሸክሞ
 ኦ ይችላል ሊጠብቅ አንተን ተንከባክቦ
 ኦ ይችላል ይመስገን ጌታችን ጥንቁቅ ነው
 ኦ ይችላል አትፍራ እሱን ተማመነው

ኦ ይችላል ሊይዘው ምስጥርህን ጠብቆ
 ኦ ይችላል አትረበሽ እርሱን ተደገፈው
 ኦ ይችላል ተመልከት ምድርን ተሸክሞአል
 ኦ የማይችል ቢሆንማ ይሄኔ ጥሏታል
',0),(NULL,'እንሄዳለን አርገን','hebret5','ከመሬት ችግር ተገንጥለን
 ከዓለም መከራ ተለይተን
  ከያለንበት ከመቅጽበት
  በአስደንጋጭ ክብር ተለውጠን

እንሄዳለን አርገን/2*
 በደመና ላይ ተራምደን
 እንሄዳለን አንድ ቀን

ከዋክብትን አልፈናቸው
 ከበታቻችን ትተናቸው
 በመንፈሱ ኃይል ተነጥቀን
 እንሄዳለን አርገን

የተፈጥሮን ሕግ ጥሰን
 የስበትን ኃይል ከንቱ አድርገን
 እንሄዳለን ወደ ሰማይ
  እየተራመድን በደመና ላይ

አንድ ምስጢር ልንገራችሁ
 አድምጡኝ ልብ አድርጋችሁ
 ዘላለም እዚህ አንኖርም
 እንሄዳለን አንድ ቀን

አንድ ምስጢር ልንገራችሁ
 አድምጡኝ ልብ አድርጋችሁ
 ዘላለም እዚህ አንኖርም
 እንሄዳለን አንድ ቀን
1
',0),(NULL,'ደስታዬ ታላቅ ይሆናል','hebret5','ደስታዬ ታላቅ ይሆናል
 ኢየሱስ በክብር ይመጣል
 ከጭንቀት ያሳርፈኛል
 እንባዬን ከአይኔ ያብሳል
',0),(NULL,'ለአምላክ ይሁን ምስጋና','hebret6','ለአምላክ ይሁን ምስጋና
 ለእኛ መዳን የሆነልን
 ከእርሱ ዘንድ ነውና /2/

በለቅሶ ነበርን በሞት ሸለቆ
 በሐዘን ተቀምጠን ተስፋችን አልቆ
 አምላክ ተገለጠ ስቃያችንን አይቶ
 የገዛ ክንዱን መድኃኒት አድርጎ

የተዘረጋብን የሞት መጋረጃ
 የተጣለብን ያ ሁሉ እዳ
 አሁን ወዴት አለ ከእኛ ላይ ተገፏል
  በስሙ ተጠምቀን የሱስን ለብሰናል

እጅግ የደረቅን አጥንቶች ነበርን
 በሜዳ የተጣልን የተበታተንን
 የጌታ ኢየሱስ ደሙ ሰበሰበን
 በቅዱስ መንፈሱ አሁን ለመለምን

በሩጫችን ብርታት እዚህ አልደረስንም
 በቀስታችን ታምነን እንዲህ አላረፍንም
 ኢየሱስ ነው ጋሻችን መልካሙ እረኛ
 እኛን የሚጠብቅ ከቶ የማይተኛ

',0),(NULL,'የኃያላን ኃያል የጌቶች ጌታ ነው','hebret6','የኃያላን ኃያል የጌቶች ጌታ ነው
 እኛ የምናመልከው ጌታችን ኢየሱስ
 ሁሉም በሁሉ ነው /2/

ሁሉን የሚሰራ በሁሉም የሚኖር
 በእጆቹ ሥራ ዘላለም የሚከብር
 እንደ አምላካችን እንደ እግዚአብሔር ማን ነው?
 የእኛ ጌታ ኢየሱስ ከሁሉ በላይ ነው

ማዕበሉን አዟል በሥልጣን ተሞልቶ
 እርሱም ጸጥ ብሏል ሕያው ቃሉን ሰምቶ
 በፊቱ የሚቆም አንድ እንኳን ኃይል የለም
  ተቀናቃኝ የለው ይነግሳል ዘላለም

ሞትን ድል ያረገ ሲኦልን የዋጠ
 የዘንዶውን እራስ የቀጠቀጠ
 የታምራት አምላክ ጌታ ኢየሱስ ነው
 አንድስ እንኳን የለም የሚወዳደረው

ሁሉ ይገዙለት ይታዘዙለታል
 በሰማይ በምድር ያሉ ያነግሱታል
  ያለና የሚኖር ቅዱስ ቅዱስ እያሉ
 አንተ ብቻ ክበር ብለው ይዘምራሉ


',0),(NULL,'ኢየሱስ ተነስቷል ሞትን አሸንፎአል','hebret6','ኢየሱስ ተነስቷል ሞትን አሸንፎአል
መቃብሩ ባዶ ነው ጌታችን ድል ነስቷል
ከኃያላን ጋር ምርኮን ይካፈላል
ብዙዎችን ይወርሳል በትንሳኤው ኃይል /2/

ጌታ እንዳይነሳ መቃብሩ ቢታተም
 የትንሳኤውን ኃይል አልቻለም ሊቋቋም
 አምላካችን ኢየሱስ ወደ ሰማይ አርጓል
 እንደ ተስፋውም ቃል አንድ ቀን ይመለሳል

በጨለማ የሄዱ ሕዝቦች ብርሃን አዩ
 የጌታን መነሳት የምስራች ሰሙ
 ነፃነትን ያጡ ድል ተጎናጸፉ
 በትንሳኤው ኃይል ሞትን አሸነፉ

በሞት ጥላ አገር ያሉ ተደሰቱ
 በጌታ መነሳት ከእስራት ተፈቱ
 በኃዘንም ፈንታ ብዙዎች ተጽናኑ
 በትንሳኤው ኃይል ከመከራ ዳኑ

',0),(NULL,'አምላክ አለን በዘመናት ሁሉ','hebret6','አምላክ አለን በዘመናት ሁሉ
 ኃይሉ ታላቅ ምህረቱ ብዙ
 ቃልኪዳኑ የማይፈርስ ጌታ ኢየሱስ /2/

ዘመናት ያልፋሉ ፈጥነው
 ሺ ዓመታት እንደ አንድ ቀን ሆነው
 ኢየሱስ ግን ያው ነው የማይለወጥ
 ያ የጥንቱ ዛሬም አዲስ

ቃሉን እንናገራለን
 በየእለቱ እንጸልያለን
 በእድሜአችንን ዘመን ሁሉ
 ለክብሩ እንዘምራለን

ዛሬም እንደጥንቱ ይሰራል
 ሙታንን ሕያዋን ያደርጋል
 የደንቆሮውን ጆሮ ይከፍታል
 የእውሩን አይን ያበራል

ሥጋ ለባሹን ያድናል
 በመንፈስ ቅዱስ ይሞላል
 የወደቀውን ያነሳል
 የደከመውን ያበረታል
',0),(NULL,'ዘንዶውን ለመቀጥቀጥ','hebret6','ዘንዶውን ለመቀጥቀጥ ሥልጣኑን ሊሽር
 ኢየሱስ ተወልዷል በቤቴልሔም
 ጆሮ ያለው ይስማ የምስራች ቃል

ከአምላኩ ጉያ የሰው ልጅ ኮብልሎ
 ጸጋው ተገፎበት ለዲያቢሎስ ተጥሎ
 እራቁቱን በሞት ጥላ ውስጥ ተዘግቷል
 ማስተዋል ግን ቢችል ሕይወት ከላይ ወርዶአል

ቅጠል እስከ መቼ አገልድሞ ይኖራል
 ዛሬ ያማረ ቢመስል ነገ ይጠወልጋል
 ሥጋ ለባሽ ሣር ነው ተብሎ ተጽፎአል
 ዘላለማዊ ቃል ክቡር ሥጋ ሆኖአል

ኢየሱስ ተወልዶአል የምስራች ምንለው
 እንዲሁ ለኛ ነው ብለን እንዳናልፈው
 ዓለም ሳይፈጠር እርሱን እንድንመስል
 አስቦ ስለ ነበር ሊለውጠን መጥቷል

ፊተኛው ሰው አዳም ከአፈር ተፈጥሮአል
 የእግዚአብሔርን መንግስት እንዳይወርስ ተረግሟል
 ኃለኛው ሰው አዳም ክርስቶስ መጣልን
 በስሙ ስንጠመቅ እርሱን እንለብሳለን
አሮጌውን ሥጋ ገፈን በጥምቀት
 ኢየሱስን እንድንለብስ ለአዲስ ሕይወት
 ሚስጥሩ ይኸ ነው የኢየሱስ ልደት
',0),(NULL,'እስከ ምድር ዳርቻ','hebret6','እስከ ምድር ዳርቻ
  ለፍጥረታት ሁሉ ወንጌልን ለማድረስ
 በፍጹም ግልጥነት ቃልህን
 በድፍረት እንድንናገር 
ኃይልህን አስታጥቀህ ላከን /2/

እረኛ እንደሌላቸው በጎች
 ተበትነው ጠፍተዋል ሰዎች
 ወደ ሕይወት እንዲሰበሰቡ
  ጌታ ኢየሱስ ሠራተኞችን ላክ

ማንም ሊዘጋ ፈጽሞ የማይችል
 የተከፈተ በር ኢየሱስ ሰጥቶናል
 በደሙ በስሙ በመንፈሱ ኃይል
 ወንጌሉን ለአለም እናደርሳለን

ወንጌሉን ባንሰብክ ዎዮልን
 ለአይሁድ ለግሪክ ሰው እዳ አለብን
 በለቅሶ ዘሩን ብንዘራ
 እናጭዳለን መከሩን በደስታ

ወንጌሉን ባንሰብክ ዎዮልን
 ለአይሁድ ለግሪክ ሰው እዳ አለብን
 በለቅሶ ዘሩን ብንዘራ
 እናጭዳለን መከሩን በደስታ

',0),(NULL,'በሰማይ ዙፋን ላይ የተቀመጠው','hebret6','በሰማይ በዙፋን ላይ የተቀመጠው
 አልፋና ኦሜጋ ብቻውን አምላክ ነው
 ኃያላንን ሁሉ ድል አድርጓል ኢየሱስ
  ስግደት ይገባዋል የነገስታት ንጉሥ /2/

ከጥንትም ጀምሮ እግዚአብሔር አንድ ነው
 ፍጥረታትን ሁሉ ብቻውን የፈጠረው
 የማይከፋፈለው የማይለዋወጠው
 ፊተኛ ኃለኛ አልፋ ኦሜጋ ነው

በሥጋ መከራን የተቀበለው
 ሕዝቡን ለማዳን ደሙን ያፈሰሰው
 ሞቶ የነበረው አሁን ግን ሕያው ነው
 ትንሣኤና ሕይወት ኢየሱስ ብቻ ነው

ሁሉ በሁሉ የሆነ ጌታ
 ተስፋ ለሌለን ስሙ አለኝታ
 በአንድ ሃይማኖት በአንዲት ጥምቀት
 በመንፈስ አተመን ለሰማይ መንግስት

ከኃጥአታችሁ በደሙ ታጥባችሁ
 ወደ በጉ እራት የተጠራችሁ
 ሐሴት አድርጉ ደስ ይበላችሁ
 በሕይወት መጽሐፍ ተጽፎአል ስማችሁ

',0),(NULL,'ኦ ምንኛ ብዙ ነው','hebret6','ኦ ምንኛ ብዙ ነው ምህረቱ
ቸርነቱ ታጋሽነቱ /2/
 እኛ ባደረግነው አምላክ ተቆጥቶ
 መቼ ደመሰሰን መቅሰፍቱን አምጥቶ
 ለሥጋ ለባሹ ሁሉ እንዲሆን ማዳኑ
 በምህረት ወረደ ከላይ ከዙፋኑ

ሰዎች በኃጥአት ላይ ሲጨምሩ ኃጥአት
 ልባቸው ደንድኖ ዘወትር ሲያስመርሩት
 መች ክንዱ ታጠፈ አልቆበት ምህረቱ
 ቁጣውም ዘግይቷል በዝቶ ቸርነቱ

የኢየሱስ ቤዛነት ለፍጥረት ሁሉ ነው
 ለአይሁድ ለግሪክ ሰው የእግዚአብሔር ኃይል ነው
 ሁሉንም ለማዳን ሰፊ ነው መንግስቱ
 ከነገድ ከወገን ይዋጃል በደሙ

የእርግማን ሕይወት ክፋት የሞላበት
 በበጎ ፈቃዱ ሆኖአል ለበረከት
 የተዘጋው ሰማይ አሁን ግን ተከፍቶአል
 የሚያድነን ጸጋ ሌተ ቀን ይጎርፋል

',0),(NULL,'እግዚአብሔርን ተስፋ አድርግ','hebret6','እግዚአብሔርን ተስፋ አድርግ
  በርታ ልብህ ይጽና ታምነህ ተሰማራ
 ኢየሱስ ይረዳሃል
 የልብህን መሻት ይሰጥሃል /2/

በወንጌሉ ጽና ጌታ ይረዳሃል
 ባሕሩን አሻግሮ በድል ይመራሃል
 መንገድህን ሁሉ ለእግዚአብሔር ስጥ
 የጸለይክበትን ከአምላክህ ጠብቅ

ሥጋህ አያውክህ ነፃነት አትስጠው
 ፍጹም አትፍገምገም በርታና ታገለው
 ምድረ በዳውን ሁሉ በፀጋ እለፈው
 ጌታ ከአንተ ጋር ነው ክንዱን ተደገፈው

ልብህ አይታወክ እግዚአብሔርን እመን
  በሚያስፈራህ ሁሉ በእምነት ጥራ ስሙን
 ልጆቹን አይጥልም ኢየሱስ ታማኝ ነው
 አይጨክንብህም ጌታችን ሩህሩህ ነው

የእግዚአብሔር አይኖች ወደ ጻድቃን ናቸው
 ጆሮዎቹም ደግሞ ወደ ጩኸታቸው
 በቀንም በሌሊት መንጋውን አይተውም
 ሊጠብቃቸው ፍጹም አይታክትም

',0),(NULL,'ኢየሩሳሌም ሆይ','hebret6','ኢየሩሳሌም ሆይ እግዚአብሔርን አመስግኚ
 ጽዮንም ሆይ ለአምላክሽ እልል በዪ
 የደጆችሽን መወርወሪያ አጽንቷልና
 ልጆችሽን በውስጥሽ ባርኳልና /2/

በአብርሃም ቃል ኪዳን ለመንግስቱ ጠርቶ
 ሊባርክ ሊያበዛ ከአለም የለየን
 አልዋሽም ፈጽሟል የተናገረውን
 በድል ላይ ድል ሰጥቶ በቤቱ አጸናን

በምህረቱ ብዛት ተጠብቀን ቆምን
 አጥፊው እንዳይጎዳን በደሙ ሸፈነን
 የኢየሱስ ስም ግርማ ጋሻ ሆኖልናል
 በግራና በቀኝ መላዕክት አጥረውናል
 
በሕዝቡ ዙሪያ ሰላምን አድርጓል
  ፍርዱን ሥርዓቱን ሌተ ቀን ይናገራል
 ለሌሎች አህዛብ እንዲህ አላደረገም
 የማዳኑን ምስጥር አልበራላቸውም

በደሙ ለገዛን ቤቱ ይጠነቀቃል
 በዘላለም ፍቅር በቅንዓት ያያታል
 ልጆቹን በክንፉ አቅፎ ያሳድጋል
 ላይጥለን ላይተወን በኪዳኑ ምሏል

',0),(NULL,'ክብርህን ትተህ ወርደሃል','hebret6','ክብርህን ትተህ ወርደሃል
  ራስህን ባዶ አርገሃል
 አሁን ግን አንተ ከፍ በል እኔ ዝቅ እላለሁ
 ከእግርህ ሥር ወድቄ እሰግድልሃለው /2/

ለኃጥያተኛው ለእኔ
 የሞትክልኝ መድህኔ
 ፍቅርህ የማይረሳ ነው
 ውለታህም ብዙ ነው /2/

በጌቴሴማነ
  ከዚያም በጎልጎታ
 ለእኔ ተንገላተሃል
 ምስጋና ይገባሃል /2/

በፊትህ ኮረብታ
 እንዳልሆንብህ ጌታ
 ና ልቤን ስበርልኝ
 ትህትናን አስተምረኝ /2/

ከመስቀልህ በቀር
 ሌላ ትምክህት የለኝም
 ደካማና ጎስቋላ
  መሆኔን አውቃለሁና /2/
',0),(NULL,'ሃሌሉያ እንበል እንዘምር በደስታ','hebret6','የምስራች ታላቅ የምስራች
  እንደተስፋው ቃል ዓለምን የሚያድን
 በቤቴልሔም በረት ውስጥ ተወልዶአል
 ስሙ ኢየሱስ ነው ከኃጥአት ያድናል

ሃሌሉያ እንበል እንዘምር በደስታ
ተወልዶልናል መድኃኒታችን ጌታ
እናንግሰው በእልልታ /2/
ከሞት ጥላ በታች ላለን ሕዝብ 
ታላቅ ብርሃን እነሆ ወጣልን 
የጋረደን ጨለማ ተገፎአል 
የአለም ብርሃን ኢየሱስ ተወልዷል

የኃጥአታችን ሸክም አስወግዶ 
የአስጨናቂያችን ቀንበር ሰብሮ
 የአዲስ ኪዳን በር ከፍቶልናል
 በጽድቅ መንገድ ይመራናል

እጅ መንሻ እናቅርብለት 
እናክብረው እንዘምርለት 
ኃያል ነውና እንስገድለት 
ንጉስ ነውና እልል እንበልለት


',0),(NULL,'እንደ ፈቃድህ ይሁን','hebret6','እንደ ፈቃድህ ይሁን ኢየሱስ
እንደ ፈቃድህ ይሁን
ዓላማህን ፈጽም በሕይወቴ
 ክበርብኝ ኢየሱስ መድኃኒቴ /2/

እኔ እንዳልኩት ሳይሆን አንተ እንደፈለከው
 ዓላማህ ይፈጸም ጌታ ኢየሱስ ያልከው
 ሐሳቤን መንገዴን በፊትህ አጽናልኝ
 ምኞቴን መሻቴን አንተ ፈጽምልኝ

አንተ የወደድከው ይሁን በሕይወቴ 
ሥጋዊ ስሜቴን ደምስስ መድኃኒቴ 
ፈቃድህን መፈጸም ነውና ምኞቴ 
ክፈትልኝ ጌታ መንፈሳዊ አይኖቼን

ለምድር እንግዳና መፃተኛ ነኝ 
ጥያት እሄዳለሁ ሰማያዊ ዘር ነኝ 
ስለዚህ እንደቃልህ ሩጫዬን ፈጽሜ 
መሄድ ፈልጌአለሁ ገድል ተጋድዬ

',0),(NULL,'የእስራኤል አምላክ በድል መርቶናል','hebret7','የእስራኤል አምላክ በድል መርቶናል
 በኃያላን ፊት ሞገስ ሰጥቶናል
 ምስጋናን አሜን እናቅርብ ዛሬ
 ኢየሱስ ረድቶናል ኢየሱስ ረድቶናል /2/

ኢየሱስ ድንቅ ነው የሕይወት አለኝታ
 በምድረ በዳ ውስጥ የሚሆን መከታ
 ያለእርሱ ማን አለ ሁሉን የሚረታ
  ምስጋናን እንሰዋ ለሞተልን ጌታ/2*

ብርሃኑን አብርቶ ተመርተንበታል
 ክንዱን ተደግፈን ሁሉን ድል ነስተናል
 ኢየሱስን ይዘን በሁሉ ከብረናል
 ተማምነን እንጓዝ ኃይሉንም አይተናል/2*

ቃል ኪዳኑን ኢየሱስ ከእኛ ጋር አድጓል
 በሩቅ ያሉትንም በምርኮ ሰጥቶናል
 ያለ ዋጋ አብረን በረከት በልተናል
 ዛሬ እናመስግነው በብዙዎች ታውቀናል/2*

ተቃርቧል በጽዮን መሰብሰቢያችንን
 ሸክምን ኃጢያትን ሁሉን አስወግደን
 የእምነታችንን እራስ የሱስን በማየት
 እንሩጥ እንበርታ በትዕግስት ወደ ፊት/2*
',0),(NULL,'በክብርህ ታላቅ አምላክ ነህ','hebret7','በክብርህ ታላቅ አምላክ ነህ
 በስምህም ታላቅ አምላክ ነህ
 በሥራህም ታላቅ አምላክ ነህ
 በፍቅርህም ታላቅ አምላክ ነህ
 እንዳንተ ያለ ኢየሱስ ማን አለ/4*

የአህዛብ አማልክት ሁሉ ከንቱ ናቸው
 የተቀረጸ አምድ የሰው ሥራ ናቸው
 የሐሰት ምስል እስትንፋስ የላቸው
  ከብርና ከወርቅ የተሰሩ ናቸው

እውነተኛ አምላክ ጌታ ኢየሱስ ነህ
 የዘላለም አባት ሕያው እግዚአብሔር ነህ
 ፍጥረታት ሁሉ በአንተ ተፈጥረዋል
 አንተን የሚመስል ከወዴት ይገኛል

ስምህ የጸና ግንብ ጽኑ መደገፊያ
 ለጻድቁ ኃይል ነው ለልቡ ማረፊያ
 ጋሻና ጦሩ ነው ጠላትን መዋጊያ
  ተኩላና እባቡን በእግሩ መጫሚያ

ሥራህንም ሰምተው አህዛብ ይመጣሉ
 መፈራትህን አይተውም ክብርን ይሰጣሉ
 ክብራቸውን ትተው ነገስታት ይሰግዳሉ
 የአንተን ታላቅነት ይመሰክራሉ
',0),(NULL,'ሕይወት እውነት የሆነው ቃሌ','hebret7','ሕይወት እውነት የሆነው ቃሌ
  ለእናንት የሠጠሁት ኃያሉ ወንጌሌ
 አይሻርም አይለወጥም ሕያው ነው
 የአሳቾች ልፋታቸው ከንቱ ነው /2/

ሰማይ ምድር ያልፋል ቃሌ ግን አያልፍም
 ብዬ የተናገርኩ ትናንትና ዛሬም
  እንዴት በእናንተ ዘመን ቃሌ ይበረዛል
 ልጆች እንደሌሉኝ እውነቴ ይሻራል

እናንተ በቃሌ ኃይል የተፈወሳችሁ
  ታላቅነቴንና ማዳኔን ያያችሁ
 እንደ ነቢያቴና ሐዋርያት ሁኑልኝ
 ዛሬም ተነሱና ለቃሌ ቁሙልኝ

ለዘራችሁ ሁሉ ማዳኔ እንዲደርስ
  ለልጅ ልጆቻችሁ መንግስቴ እንዲወረስ
 አንዳች ሳትጨምሩ ቃሌን ጠብቁና
 ለሚተኩ ስጡ ነገም እንደገና

ጌታ ጌታ ሆይ ማለት ልቤን አይሞላውም
 መዘመር ብቻውን ልቤን አይነካውም
  የሚወደኝ ቢኖር ቃሌን ይጠብቃል
 እስከ ሞትም ድረስ የታመነ ይሆናል
',0),(NULL,'መልካሙን ገድል ልጋደል','hebret7','መልካሙን ገድል ልጋደል
መልካሙን ገድል ልጋደል
የወንጌል ማህበርተኛ እሆን ዘንድ
 በጨለማ ላሉት የምስራች ላውራ
  አምላኬን ላገልግል በመክሊቴ ልስራ /2/
 
ቀንበሬ ተሰብሮ ሸክም ወርዶልኛል
 የናዝሬቱ ኢየሱስ ሕይወቱን ሰጥቶኛል
 እንዳገለግለው ይጠብቅብኛል

 ከግብጽ ባርነት በአምላኬ ድኛለሁ
 እርሱን ላገለግል ነጻ ወጥቻለሁ
 በምድረ በዳ እሰዋለታለሁ

 ወደ ሞት ሲነዱ ነፍሳት እንዳይጠፉ
 በመክሊት ተግቼ ወደ ኢየሱስ ይምጡ
ከዲያቢሎስ ቀንበር ከወጥመዱ ይውጡ
የታሰሩ ይፈቱ ያዘኑ ይጽናኑ
 ከጥፋት ጎዳና ከሞት ይመለሱ
 የሰላም አለቃ ጌታን በእኔ ይዩ
',0),(NULL,'ሙሽራው ሲመጣ መሯሯጥ','hebret7','ሙሽራው ሲመጣ መሯሯጥ
 መቻኮል ዘይትን ለማግኘት
 አያዋጣም በሩ ይዘጋል
 ጊዜው አልፎ መቼ ይከፈታል
 የመዳን ቀን ዛሬ ነው ሰዓቱም አሁን ነው
 ጌታን የምናውቅበት/2* 
ምህረት እንድናገኝ የተጠራንበት

ቅዱሳን ሲነጠቁ ወደ ሕይወት ሲወሰዱ
 ገና ሊድኑ የሚመጡ ባዶ መሰዊያ ፊት ሲወጡ
 ማረን ባክህ ሲሉ
 ለመንፈስ ቅዱስ ሙላት ጌታን ሲማልዱ/2*
 ከንቱ ልፌት ምህረት የሌለበት

አብርሃም አብርሃም ስማኝ
 አልአዛርን ላክልኝ
 ምላሴን በውሃ ያርስልኝ 
በንዳድ በእሳት ውስጥ ነኝ
 ከዚህ ወደ አንተ ከአንተም 
ወደ እኛ መምጣት አይቻልም/2*
 ፍርድህን ተቀበል ጌታን አላወቅክም

የሰማይ መስኮት ተከፍቷል
 ዝናቡም ማንጠባጠብ ይዟል
 በየት በኩል መሄድ ይቻላል 
መንገዱ ሁሉ ተዘግቷል
 ኖህ ኖህ ክፈትልን መግቢያ መውጫ አጣን
 እባክህን ማረን እባክህን ማረን
 ጩኸት ብቻ አልተገኘም መዳን/4*

',0),(NULL,'ማንን እልካለሁ ማንስ ይሄድልኛል','hebret7','ማንን እልካለሁ ማንስ ይሄድልኛል
 ሕዝቤን ጥፋታቸው ማን ይነግርልኛል
 ከጨለማ ውጡ ብሎ የሚነግራቸው
 የሕይወትን መንገድ የሚያሳያቸው ማን ነው? 

ማን ነው/3* የሚላከው
 ማን ነው/3*የሚሄደው

በዲያቢሎስ ተይዘው ለሚጨነቁ
 የሰላምን ወንጌል ለሚናፍቁ
 መንገዱን ላላወቁ ተስፋ ለሌላቸው
 ከእናንተ ማን ይሆን የሚራራላቸው

የወገኖቹ ፍቅር በልቡ የሚሰማው
 ለነፍሳቸው መጥፋት የሚገደው ማን ነው
 ያለውን ሁሉ ሸጦ የሚከተለው
 የምስራቹን ቃል የሚነግርልኝ

የጌታዬን ጥሪ ድምጹን ሰምቻለሁ
 መስቀሌን ተሸክሜ እኔው እላካለሁ
 ስደት ቢኖር መከራ ረሃብ ቢኖር ጥማት
  ምንም ችግር አልፈራም እሄዳለሁ እስከሞት
የጌታዬን ጥሪ ድምጹን ሰምቻለሁ
    መስቀሌን ተሸክሜ እኔው እላካለሁ

ላዘኑት መጽናናት ለሚያለቅሱት ደስታ
 ኢየሱስ የሠራውን የመስቀሉን ውለታ
 እመሰክራለሁ በደስታ እላካለሁ
 ከዛሬ ጀምሮ ራሴን ክጄዋለሁ 
',0),(NULL,'ማሳደግን አሳድገን','hebret7','ማሳደግን አሳድገን
  ወደ ሙላትህም አድርሰን
 ግን ይሁን በዝግታ
 እንድናስተውለው ጌታ /2/

በጻድቅ ሰው ሳኦል ቀና
  ደሙን ሊያፈስ ልቡን አጸና
 ግን ዳዊት አምላኩን ፈራ
 የሳኦል ቅባት ከላይ ነውና

ጌታ የቀባውን ንጉስ
  ዳዊት ሸሸ እንዳያረክስ
 ሳኦልን ሊገድለው ሲችል
  በስደት ኖረ ስለ ጽድቅ ሲል

በመታገስ በቆይታ
 ዳዊት ቆመ በከፍታ
 የጌታን ልብ እስኪያውቅ ድረስ
 በአምላኩ ፊት ሞገስ ሆነለት

 እንደ ዳዊት ዝቅ እንድንል
 እርዳን ኢየሱስ እንድናስተውል
 ሥፍራውን እንደ ረሳው
  እንደ ሳኦል አንሁን ጌታ
',0),(NULL,'እስራኤል ሆይ ስማ አምላክህ አንድ ነው ','hebret7','እስራኤል ሆይ ስማ አምላክህ አንድ ነው
በሲና ተራራ በክብሩ የታየው
  ዛሬም በአዲስ ኪዳን ሥጋ ለብሶ መጥቷል
  አማኑኤል ሆኖ በምድር ላይ ኖሯል
 በአምላክነት ስሙ ኢየሱስ ተብሏል /2/
በሕይወት እንድትኖር ዕድሜህ እንዲረዝም
 ደግሞም እንድትወርስ መንግስቱን ዘላለም
  እስራኤል ሆይ ስማ ሌላ እግዚአብሔር የለም
 አንድ አምላክ ብቻ ነው ያለ የሚኖርም

ይህን አምላክህን ውደድ ከልብህ
 ከራስህም በላይ ከሁሉ አብልጠህ
 ተኝተህ ስትነሳም ዘውትር ተጫወተው
 ለልጆችህም ሕግ አርገህ አስተምረው

ስትበላም ስትጠጣም ስትሄድ ብታስበው
 በደጅህ መቃን ላይ ከፍ አድርገህ ብትጽፈው
 ሊያጠቃህ የመጣ ዲያቢሎስ ይወድቃል
 አህዛብ ሁሉ አንተን አክብረው ያዩሃል

በእጅህ ላይ ብታስረው ከአንተ ባይለይህ
 ድልን ይሰጥሃል በፈተና ላይ
 ፍጹም ሳትጠረጥር አንድነቱን ብታምን
  ሁሌ ይባርክሃል በሕይወትህ ዘመን

እስራኤል ሆይ ስማ /2/
አምላክህ አንድ ነው /2/
',0),(NULL,'ጉልበቴ ሳይዝል ሳይደክም','hebret7','ጉልበቴ ሳይዝል ሳይደክም
  እተጋለሁ በመክሊቴ
 ወንጌሉ እንዲያድግ እንዲሰፋ
 የጌታ ኢየሱስ መድኃኒቴ /2/

ነፍሴን ወደ ሰጠኝ ወደ ፈጣሪዬ
 ሳትመለስ ልትጋ በሁሉም ድርሻዬ
 አገልግሎቴንም በትዕግስት እወጣለሁ
 ሳልቀብር መክሊቴን ነግጄ አተርፋለሁ

ሥጋ በድካሙ ቢፈታተነኝም
 ዲያብሎስ እንቅፋት ሊሆነኝ ቢጥርም
 ሁሉን በሚያስችለኝ በርትቼ እሰራለሁ
 የኋላ የኋላ ዋጋ አለኝ አውቃለሁ

በእጆቼ ሳልቦዝን ባፌም ሰው ሳላማ
 ተቀድሼ ልስራ ፍጹም ሳላቅማማ
 ትኩር ብዬ እያየሁ ብድራቶቼን
 ለኢየሱስ ላስገዛ ልቤን ጉልበቴን

እንደጥላ ለሚያልፍ ለጥቂት ዕድሜዬ
 ጉልበቴን ሳልቆጥብ ልስራ ለጌታዬ
 አውቃለሁ ተግቼ በቅን ባገለግል
 እንደሚሸልመኝ የሕይወትን አክሊል
',0),(NULL,'የሚሳንህ የለም አውቀናል','hebret7','የሚሳንህ የለም አውቀናል
 የሚሳንህ የለም ተረድተናል
 ባህሩን ከፍለን ተሻግረናል
 ምድረበዳው ለምልሞ አይተናል /2/

የሙሴ አምላክ ነው ጌታ ኢየሱስ
 ከጥንት የነበረ የእኛ ንጉስ
 ከአለት ውሃን ያፈለቀው
 ሕዝቡን መና የመገበው

የኢያሱ አምላክ ነው የእኛ ጌታ
 የሚዋጋልን እንዳንረታ
 ፊታችን አልፎ ይጋርደናል
 ለእኔ ትታችሁ እለፉ ይለናል

በቤቱ አኑሮ ባርኮናል
  የድል አምላክ ነው ድልን ሰጥቶናል
 በእርሱ እንድንታመን ረድቶናል
 ምስጋና ልንሰጠው ይገባናል
',0),(NULL,'ያለና የሚኖር የላካችሁ','hebret7','ያለና የሚኖር የላካችሁ
 በቅዱስ አጠራር የጠራችሁ
  ተነሱና ተናገሩ
 የኢየሱስን ማዳን አውሩ
 ለምን ታመነታላችሁ
 ድል እያለ ከፊታችሁ /2/

የጌታን አንድነት ምስጢር ተናገሩ
 ስሙ ኢየሱስ ነው ለአለም ሁሉ አውሩ
 ያን ጊዜ የሰይጣን ሥራ ይፈራርሳል
 ከእግራችሁ በታች ወድቆ ይቀጠቀጣል

በእግዚአብሔር ቃል መረቡን ብትጥሉ
 ወደ መዳን መንገድ ብዞቹ ይመጣሉ
 ከነገድ ከቋንቋ ከተለያየ ወገን
  በአንድነት ሆነው ይጠራሉ ስሙን

የኢያሪኮን ቅጥር በምስጋና ዙሩት
 የኢየሱስን ስም በእምነት ጥሩበት
 ግንቡ ይፈርስና ምርኮ ይሰበሰባል
 የእግዚአብሔር ቤት በነፍሳት ይሞላል

በዘመን ፍፃሜ የእግዚአብሔር ቤት
  ጸንታ ትቆማለች በተራሮች አናት
 ጽዮን ተነሽና አብሪ ተብላለች
 በብርሃኗ ምድርን ሁሉ ትሞላለች
',0),(NULL,'እኔም በበገና ስለ እውነትህ አመሰግናለሁ','hebret7','እኔም በበገና ስለ እውነትህ አመሰግናለሁ
 የእስራኤል ቅዱስ አምላክ ሆይ
 በመሰንቆ ዘምርልሃለሁ
 እውነትህን ቃልህን አውጃለሁ
',0),(NULL,'ታላቅ የምስራች','hebret8','ታላቅ የምስራች ለሁሉ ሰው የሚሆን
 ጌታ አምላካችን በሥጋ መጣልን
    የምስራችህ በጨለማ ላሉት ብርሃን ወጣላቸው
    የምስራች በሞት ለተዋጡት ሕይወት ሆነላቸው
    ከሲኦል ከግዞት ነፍሳት አመለጡ
    ለዘላለም ሕይወት ወደ ኢየሱስ መጡ /2/

ስለ አዳም በደል ሞት ተፈርዶብን
 ሥጋ ለባሽ ሁሉ ጨለማ ሆነብን
 ነፍሳችን በሲኦል ታስራ እንዳትቀር
 ኢየሱስ ተወለደ የምስራች ለምድር

የአምላክ ቸርነት ምድርን ሞልቶአታል
 ነፍሳትን ለማዳን ቃሉ ሥጋ ሆኗል
 የተወለደውም ክርስቶስ ኢየሱስ ነው
 በሞት ያለውን ሥልጣን በሞቱ የሻረው

በልደቱ ዕለት መላዕክት ዘምረዋል
 በምድር ለሚገኙ ሰላም አውጀዋል
 የአምላክን ቁጣ በራሱ የወሰደው
 በሥጋ የመጣው ጌታ ኢየሱስ ነው

በተዓምራቱ ምድርን ያስደነቀው
 ከልደት እስከሞቱ ሁሉን ያስገረመው
 በሥሙ ለሚያምኑት ቃሉን የሚያበራው
 ነፍሳት የምሥራች ኢየሱስ አዳኝ ነው
',0),(NULL,'የሠራዊት ጌታ እግዚአብሔር','hebret8','የሠራዊት ጌታ እግዚአብሔር
  ኢየሩሳሌምን ይጋርዳታል ይከልላታል
 ይታደጋታል አልፎም ያድናታል /2/

ጌታ ለቤቱ ይጠነቀቃል
 እንደ አይኑ ብሌን ይጠብቃታል
 ቀንና ሌሊት አይለያትም
 ለክፉ ጠላትም አይጥላትም

መሰረቷን እያጸናላት
 መልክና ውበት እየሆነላት 
ኢየሱስ በሥሙ ይጋርዳታል
 አካሄዷን ይቆጣጠራል

ኢየሩሳሌም ቤተክርስቲያን ናት
 ጌታ ነፍሳትን የሚያገኝባት
 በቅዱስ ደሙ የተዋጀች ናት
 ለሰው ደህንነት የተሰራች ናት

ጌታ በክንፉ የሚከልላት
 በቅዱስ መንፈስ የሚገነባት
 በኢየሱስ ስም የምትመራ
 ቅዱስ አካል ናት የምትፈራ
',0),(NULL,'ክብር የሚገባውን አምላክ አመልካለሁ','hebret8','ክብር የሚገባውን አምላክ አመልካለሁ
 ለጌታ ለኢየሱስ እንበረከካለሁ
 አምልኮ ስግደትም አቀርብለታለሁ
 ምስጋና ለስሙ እሰዋለታለው /2/

የዘላለም አምላክ ስሙ የተፈራ
 ሁሌ ይመለካል በጽዮን ተራራ
 እኔም ለጌታዬ ክብር እሰጣለሁ
 ቀንና ሌሊትም እሰግድለታለሁ

የሰላም መሰረት እርካታን የሚሰጥ
 የዲያቢሎስን ሥራ የሚያናውጥ
 ቀድሞም የነበረ ዘላለምም የሚኖር
የሠራዊት ጌታ ኢየሱስ ይመለክ

                   የምስጋና ዜማ ቅዱስ መሰዋዕት 
ሊቀርብ ይገባዋል ከሁሉም ፍጥረት 
ጌታዬ አምላኬ ኢየሱስ ነው ስሙ 
ከኃጥያት የሚያድን በፈሰሰው ደሙ

እኔ የማመልከውን እናንተም አምልኩ 
ለጌታ ለኢየሱስ ዘወትር ተንበርከኩ 
አምልኮ ስግደትም ለእርሱ ይቅረብለት 
ምስጋና ውዳሴም ክብርም ይድረስለት
',0),(NULL,'በሸለቆም በተራራም','hebret8','በሸለቆም በተራራ
 የአምላክን ስም ባላወራ
 ወንጌልን ባልሰብክ ወየውልኝ
 የደሙ ዕዳ አለብኝ /2/

ጌታዬ ለእኔ የሞተውን
 ቅዱስ ደሙን ያፈሰሰውን
 በቀራንዮ የተጨነቀውን
 ስለ ሕይወቴ ያደረገውን

ተአምራቱን ኃያልነቱን
 ሞትን ድል አድርጎ መነሳቱን
 ለአለም ሕዝብ መሰዋቱን
 የእግዚአብሔርን ስም አዳኝነቱን

እነ ጴጥሮስ መሰከሩለት
 ኢየሱስን አይተው አመኑት
 ስለ መንፈሳዊ በረከት
            ስለመንጻት

እኔም ድርሻዬን እሰብካለሁ
 እንደ ሐዋርያትም ተጠምቄአለው
 በመንፈስ ቅዱስ ተሞልቻለሁ
መዳን በኢየሱስ ስም ብቻ እላለሁ
',0),(NULL,'የወንጌል ሰባኪነትን ሥራ አድርግ','hebret8','የወንጌል ሰባኪነትን ሥራ አድርግ
 ወደ ሞት የሚነዱትን ታደግ
 እግዚአብሔር ጠርቶሃልና ቸል አትበል
 ስለ ኢየሱስ ስም መከራ ተቀበል /2/

አፌ ኮልታፋ ነኝ አትበል
 በእናትህ ማህፀን ሳለህ ጠርቶሃል
 ብላቴንነትህን አትመልከት
 መልካም ሥራ ነውና ሰባኪነት

ሰባኪ በመሆንህ ደስ ይበልህ
 መልካም ዕድል ነውና የገጠመህ
 ከሐዋርያት ከተማርከው ልብህ ይጽና
 መመስከር አትፍራ በእርሱ ጽና

መንገዱ አድካሚ እንኳን ቢመስልህ
 ርሃብ ዕርዛትም ቢመጣብህ
 የቀድሞ ሐዋርያትም ቀምሰውታል
 ክርስቶስ ጌታዬም አልፎበታል

መስቀሉን ተሸክመህ ተከተለው
 እራስህን ክደህ ሁሉን ቻለው
 ዕርፉን ጨብጠህ ወደ ኋላ
 መመልከት አትችልም ወደ አለም
',0),(NULL,'የግያዝን ሃይማኖት አልፈልግም','hebret8','የግያዝን ሃይማኖት አልፈልግም
 ኤልሳእ እንዲገስጸኝ አልሻም
 ለገንዘቡ ብዬ በሽተኛ 
መሆን  አልፈልግም ውሸተኛ /2/

የለምጽን በሽታ ስለ ገንዘብ
 ቃሉ ይመክረኛል እንዳላስብ
 እንቢ ብዬ ብሄድ ብቀበል
ምንስ ይጥቅመኛል ብኮበልል
የአመጽን ገንዘብ በውሸት
 ለማግኘት መሞከር በስህተት
 ይሆናል በኋላ ቁጭት
 ከጌታ ሲቆረጥ ልደቴ

ኢየሱስ የማያየው የለምና
 ዓይኖቹ ወደ እኔ ናቸውና
  በገንዘብ ኃጥያትን አልሸምትም
 የእግዚአብሔርን ቁጣ አልጎትትም

አመጸኛ ሆኜ በሕይወቴ
 ገሃነም እንዳልገባ በጥፋቴ
 ከአሁኑ ልጠንቀቅ እንዳልጠፋ
 ኢየሱስ ሆይ እርዳኝ የእኔ ተስፋ

አመጸኛ ሆኜ በሕይወቴ
 ገሃነም እንዳልገባ በጥፋቴ
 ከአሁኑ ልጠንቀቅ እንዳልጠፋ
 ኢየሱስ ሆይ እርዳኝ የእኔ ተስፋ
',0),(NULL,'የእውነት ወንጌል በአለም','hebret8','የእውነት ወንጌል በአለም
  ተሰብኮ በጌታ በኢየሱስ ስም
 የጌታ ቃል አድጎ ምድርን
 ሲያሸንፍ ነፍሳትን ሲያድን
 የመንፈሱ እሳት ሲቀጣጠል
 ቤተክርስቲያን ለምልማ
 ነፍሳት እንደሚጎርፉ ለመዳን
 መስማትስ በጆሮ ሰምተን ነበር
  እነሆ በአይናችን ዛሬ አየን /2/

እግዚአብሔር በምድር ሁሉ ላይ ይነግሳል
 ነፍሳትን ያድናል ስሙም አንድ ይሆናል
 የአጋንንትን ኃይል በቃሉ ያደቃል
 የጣዖታት አምልኮን ከሕዝቡ ያስርቃል
    ተብሎ የተነገረው ሲፈጸም አይተናል

 ዲዳ ይናገራል ደንቆሮ ይሰማል
 ዕውሩ ይበራል ለምጻሙ ይነጻል
 ጌታ ከፍ ከፍ ይላል ተአምራት ይበዛል
ውሸት አፉን ዘግቶ እውነትም ይሰፋል
ተብሎ የተነገረውን ሲፈጸም አይተናል

የምስጋና መስዋዕት ለጌታ ይቀርባል
 አዳዲሱ ቅኔ በቤቱ ይሰማል
 መንፈስ ቅዱስ ወርዶ ሕዝቡን ይለውጣል
 የዲዳውን ምላስ ለእርሱ ይዘምራል
ተብሎ የተነገረውን ሲፈጸም አይተናል

    የሐዋርያት ትምህርት በግልጽ ይሰበካል
 የጌታ ኢየሱስ ስሙ ከፍ ከፍ ይላል
 የነፍሳት አንድነት በቃሉ እንዲሆን
 ጌታ የጸለየውን ፍጻሜ ለማየት
    ሁሉ የጠበቀውን ሲፈጸም አይተናል
',0),(NULL,'አንድ አምላክ አለን የምናመልከው','hebret8','አንድ አምላክ አለን የምናመልከው
 ቃሉን ሥጋ አድርጎ የተገለጠው
 በሰማይ በምድር ብቻውን ያለው
 አዳኝ ነው ፈዋሽ ነው ስሙ ኢየሱስ ነው /2/

አልፋ ኦሜጋ አንድ አምላክ አለን
 ብቻውን ያለው አንድ አምላክ አለን
 የዘላለም አባት አንድ አምላክ አለን
 ስሙ ኢየሱስ ነው ሃሌሉያ

ያለና የሚኖር አንድ አምላክ አለን
 ፊተኛው ኃለኛ አንድ አምላክ አለን
 ዘላለም የሚኖር አንድ አምላክ አለን
 ስሙ ኢየሱስ ነው ሃሌሉያ

አብ ወልድ መንፈስ ቅዱስ አንድ አምላክ አለን
 አባት ስለሆነ አብ የምንለው
በስጋ ስለመጣ ወልድ የምንለው
በመንፈሱ ቀዳሽ ስሙ ኢየሱስ ነው

በሐዋርያት በነብያት የተሰበከው
 በቅዱሳት መጽሐፍት የሚነገረው
 ሊያድን ሊያጠፋ ሥልጣን በእጁ ያለው
 ኢየሱስ ነውና ሁሉም ይስገድለት
',0),(NULL,'ቃሉን አለመስማት','hebret8','ቃሉን አለመስማት ደግሞም አለመጠበቅ
 የአፍ ብቻ ሳይሆን የተግባር ክህደት ነው
 በሲኦል ውስጥ ሆኖ ጸጸት አይጠቅምምና
 መፍትሔ የለውምና በጨለማ ታስሮ ዋይታ ከንቱ ነው
 ሰሚ አይገኝምና ሰምቶ ጠብቆ የመዳን
ጊዜው አሁን ነው /2/

የክህደቱ ሥራ ከአመጽ ይጀምራል
 ቃሉን ባለ መስማት አእምሮ ይታወካል
 ስንፍና ተጭኖ ኃጥያት ይበዛል
 ከአምላክ ጋር አጣልቶ በገሃነም ያስቀጣል

ቃልን ባለመስማት ኃጥያት ለምን ይሆናል
 በሚቀረው አለም ቃሉ እንዴት ይናቃል
 ኃጥያት የምትሰራ ነፍስ ትጠፋለችና
 ባዶ ክርስትና አያድንምና

ከሞት በኋላ ንስሐ ያልተፃፈ ቃል ነው
 ያለ ሥጋ ንስሐ ለነፍስ የት ነው ያለው
 የጌታችን ቀንበር አይከብድም ቀላል ነው
 የኢየሱስን ትዕዛዝ መፈጸም ለሕይወት ነው

በማይወጡበት ሕግ ገብቶ ከመጸጸት
 አምኖ ንስሐ መግባት መራቅ ከክህደት
 ሰአቱ አሁን ነው በስሙ ለመጠመቅ
 በሐዋርያት ወንጌል አምኖ ለመታጠቅ

',0),(NULL,'እከተለዋለሁ','hebret8','ምክንያቴን ሁሉ ቆርጨ
 እከተለዋለሁ ሁሉን ነገር ትቼ
 አገለግላለሁ በሙሉ ፈቃዴ
 በዚህ ነው የሚለካው ጌታዬን መውደዴ /2/

ለአገልግሎት ጥሪ ምክንያቴን አልሰጥም
 ከጌታ ጋር ስኖር ግራ ቀኝ አልልም
  እርሱ ከፈለገኝ ፈቃደኛ ልሁን
 ልቤ ሳይከፈል ላክብረው ጌታዬን

ሥጋዬ በምክንያት ቢያስጨንቀኝም
 ወደ ኋላ እንድሄድ ቢያስቸግረኝም
 በተንኮል ጥበቡም ብወተውተኝም
 አምላኬን ማገልገል በጭራሽ አልተውም

በቃሉ ልጽና ፈቃዱ ሆኖአል
  ስለ ስሙ ክብር መቆም ይገባኛል
 ፍቅሬን ምስጋናዬን ለእርሱ አደርጋለሁ
 ምንም ነገር ቢከብድ በእርሱ እታመናለሁ

ለጥፋት ምክንያት ማቅረብ አይሁንብኝ
 ወደ ኋላ ማፈግፈግ በኢየሱስ ስም ይራቅ
 የኢየሱስን ፈቃድ እከተለዋለው
 ጌታን በመንገዱ አገለግለዋለሁ
',0),(NULL,'እንግዲህ ልጄ ሆይ','hebret8','እንግዲህ ልጄ ሆይ
 አንተ በክርስቶስ ኢየሱስ ባለው ጸጋ በርታ
 ፀጋውንም አነሳሳ ያላመንህ አትሁን 
ፍጹም አታመንታ /2/

ፀጋውን በሙላት እንደተቀበልከው
 ለአገልግሎት ትጋ እንደ ተማርከው
 ኢየሱስ እራሱን ለአንተ ከገለጠ
 ስለ ነፍስህ ብሎ ሕይወቱን ከሰጠ

በቅድስና ኑር ሌሎችንም አድን
 እራስህን አሳይ መልካም ምሳሌ ሁን
 ለሚታየው ነገር ልብህ ሳይዘነብል
 ፀንተህ ብትዋጋ ታገኛለህ ዕድል

ጌታችን ሲመጣ ትሸለማለህ
 መክሊትህን አትርፍ እንዳታስቀር ቀብረህ
 በጥቂቱ ታመን በብዙ ትሾማለህ
 በአደራ ገንዘብ ይታይ ታማኝነትህ

በተረዳኸው ኑር የእግዚአብሔር ሰው ሆይ
 እንደ ሐዋርያቱ ትገኛለህ ሰማይ
 የአምላክህን ስም ኢየሱስ ነው ብለህ
 መመስከር አትፍራ የሰውን ፊት አይተህ
',0),(NULL,'አምናለሁ እንደሚባርከኝ','hebret8','አምናለሁ እንደሚባርከኝ
 አውቃለሁ እንደሚጎበኘኝ
 በቃሉ መሰረት እንደሚታገልኝ
ኢየሱስ እንደ አይኑ ብሌን እንደሚጠብቀኝ
',0),(NULL,'ምስጋናው ይነሳ','hebret11','ምስጋናው ይነሳ ዝማሬው ያርግለት
 ለገናናው ኢየሱስ አምልኮ ይብዛለት
 ጠላቶችቹ ይፈሩ ስሙ ከፍ ይበል
 በአለም ሁሉ ይታይ የእግዚአብሔር ልጆች ድል ድል /2/

አክሊላችን ይውረድ ክብራችን ይዋረድ
 ከእግሩ ሥር ወድቀን ለክብሩ እንስገድ
 ለታላቅነቱ ፍጻሜ የሌለው
 ለኢየሱስ አምልኮ ክብርን እንስጠው

ቅዱስ ቅዱስ ቅዱስ እያልን እናክብረው
 ብቻውን በሰማይ ገኖ ለሚኖረው
 መላዕክት ሌተ ቀን የሚዘምሩለት
 ከእኛም ዛሬ አምልኮ ውዳሴ ይቅረብለት

ከእግዚአብሔር ልጆች ምስጋናው ሲነሳ
 ምህረቱና ጸጋው ማዳኑ ሲወሳ
 በሕዝቡ ዙሪያ ክንዱ ይንቀሳቀሳል
 የተቆላለፈው ሁሉ ይከፈታል

መድረኩ ይናወጥ በቅዱሳን ዜማ
 ከጽዮን ሕዝብ ውስጥ ምስጋናው ይሰማ
 በረከቱ ይዝንብ ኢየሱስ ደስ ይበለው
 ክብርና ውዳሴ አምልኮም የእርሱ ነው
',0),(NULL,'ኢየሱስ ነው የባረከን','hebret11','ኢየሱስ ነው የባረከን የጠበቀን
  በየዘመናቱ እያበዛን እያሰፋን ያሳደገን
 ለእርሱ ክብር ይሁን ለኢየሱስ ክብር ይሁን /2/

በባህር በእሳት በድል አሳለፈን
 የምንሞት ስንመስል ሕያው አርጎ አቆመን
 ስንደክም ኃይል ሆኖ በርቱ አይዟችሁ አለን
 ደግፎ አጽንቶ እዚህ አደረሰን

አምላካችን በእውነት ከእኛ ጋር ሆነ
 ምርኮም ተቻኮለ ብዝበዛው ፈጠነ
 ኢየሱስ እየመራን ቀድሞ ስለሄደ
 ከእኛ እጅግ ደካማዎች ሺውን አሳደደ

ጥቂቶች ነበርን ስንታይ በሰው ዓይን
 እንመስል ነበር የምንጠፋ ወድቀን
 ቃሉ አይጠፋም እኛ የተወለንድበት
 በዛን ተባረክን ምድሪቱን ሞላናት

ጥንት ሠርቶ ያሳየን ዛሬም የሚሰራ
 በእኛ አይደለም ኃይሉ ከጌታ ኢየሱስ ነው
 የሚያደርግልንን ድንቅ ታምር እያየን
 ዳግም እስኪመለስ እንጠብቀዋለን
',0),(NULL,'የተጓዘበትን ረጅሙን ጎዳና','hebret11','የተጓዘበትን ረጅሙን ጎዳና
 የእግዚአብሔር ሕዝብ አልፎ በምስጋና
 ዛሬ በድል ቆሞ በአምላኩ አደባባይ
 ምስጋናን ይሰዋል 
  በኢየሩሳሌም ላይ በኢየሩሳሌም ላይ /2/ 2

ወደቀ ሲባል ጠፋ
 ሲጨክን ሲጥል በአምላኩ ላይ ተስፋ
 አለጣለውም አሸነፈ/2* 
የሰይጣን ተንኮል ከሸፈ/2*

ሕይወቱንም ሰውቷል
  ችግርን መከራን ታግሶ አሳልፏል
 ጸንቶ ቆሞ ለዚህ በቃ/2*
 ኢየሱስ ሆነ የክብር ዕቃ/2*

አያድግም ሲባል አይለማም
 እርጉም ነው ጠፊ ነው አይቆምም
 እውነት በልጆቹ በርቶ ታይቷል/2* 
ለአህዛብም ብርሃን ሆነዋል/2*

ቢያደቁትም አልሞተም
 የሐዋርያትን እውነት አልተወም
  ኢየሱስን ከፍ አረገው/2*
 በምርኮ ሞልቶ አከበረው/2*
',0),(NULL,'ከእኛ ጋራ ታምራት የሠራው','hebret11','እሾሁን እንቅፋቱን እባብና ጊንጡን
 ከእግራችን በታች ጥሎ ያስረገጠን
 ማነው ዛሬ በድል በፊትህ ያቆመን
 ከስምህ በስተቀር ሁሌ የሚረታን

ከእኛ ጋራ ታምራት የሠራው
 ስምህ ይመስገን ኢየሱስ/2* 2

ሞት ፊታችን ቆሞ
  ሌት ቀን ሲያስፈራራን
 ሲኦል ተከትሎት ተጨንቃ ነፍሳችን
 ማነው ጨለማውን ብርሃን ያረገልን
 ስምህ ብቻ እኮ ነው ድልን ያመጣልን

በመካከላችን ድንቅ ሥራ እየሰራ
 በዙሪአችን ላሉት ግርማው እያስፈራ
 ማነው በተራሮች እራስ ላይ ያቆመን
 ስምህ ነው ኢየሱስ ከሁሉ የለየን

ፍርሃታችን ጠፍቶ ሰላም የበዛልን
 ሰይጣንን የጣለው በቀኝ በግራችን
 ማነው ከአሸናፊዎች በላይ ያደረገን
 የኢየሱስ ስም ነው መመኪያ ጋሻችን

አለም ብትጠይቀን ብትመረምረን
 ይህን ሁሉ በረከት ከየት እንዳገኘነን
 ለምን እንደበዛን ለምን እንደሠፋን
 ስምህ ነው ኢየሱስ ሁልጊዜ መልሳችን
',0),(NULL,'መምጣቱ ነው የእኛ ጌታ','hebret11','መምጣቱ ነው የእኛ ጌታ
 በክብር ደመና ማራናታ አሜን
  ጌታ ኢየሱስ ሆይ ና

በመጨረሻው ቀን ሊሆን የሚገባው
 ትንቢት ተፈጽሟል ጌታ የተናገረው
 አይናችን ወደ ላይ ቀና ብሎ ይመልከት
  ስለተቃረበ የጌታችን መምጣት

መቅረዛችን ሞልቶ በመንፈሱ ዘይት
  ከዓለም እርኩሰት ፍጹም በመለየት
 እየተጠባበቅን ያን ታላቅ የድል ቀን
  እንኑር በናፍቆት ማራናታ እያልን

መከራና ስደት የምድር ስቃይ ሁሉ
 ኢየሱስ ሲገለጥ በሙሉ ይቀራሉ
 የዘመናት ቁጥር በሌለበት አገር
 በደስታ እንኖራለን ዘወትር በመዘመር

ከዚህ ከደካማ ሥጋ ተለይተን
  የሚበሰብሰው ለአፈር አስረክበን
 የከበረውን ሥጋ የሱስን ለመምሰል
 በብርሃን ልንታይ ቀኑ እጅግ ተቃርቧል
',0),(NULL,'ምህረት ለኢትዮጵያ','hebret11','ምህረት ለኢትዮጵያ  ሰላም ለኢትዮጵያ
 ፍቅር ለኢትዮጵያ ፀጋ ለኢትዮጵያ
 ብለን ብንጸልይ 
እግዚአብሔር ብቻ ነው ሁሉን የሚያሟሏው 
እግዚአብሔር ብቻ ነው ሁሉን የሚያሟሏ

ኢትዮጵያ እጆቿን ወደ እግዚአብሔር ትዘርጋ
 በቃል ኪዳኑ ላይ አላት ታላቅ ተስፋ
 ጉልበቷም ይንበርከክ ምህረትን ትለምን
 የሱስ ይታረቃት አሁን በዚህ ዘመን

አመፃ በደል ፍጹም ተወግዶ
 የእግዚአብሔር መንፈስ እንደ ዝናብ ዘንቦ
 ለማየት ከፈለግን ኢትዮጵያ ለምልማ
 ሁሉም በእግዚአብሔር ፊት አሁን ንስሐ ይግባ

እግዚአብሔር ፍቅር ነው ፍቅርን ይወዳል
 ጸብና ሁከትን ፈጽሞ  ይጠላል
  ኢትዮጵያ በልጽጋ ለማየት ከፈለግን
 ለአንዱ ለፈጣሪ ጉልበት ሁሉ ይንበርከክ

ምህረቱ ለዘላለም ቸርነቱ ብዙ
 ጌታችን ኢየሱስ  ሰፊ ነው ትዕግስቱ
 ከልብ የመነጨ ንስሐ ከገባን
 ሰላሙን ፍቅሩንም እግዚአብሔር ያወርዳል
',0),(NULL,'ጽኑ አይዙአችሁ','hebret11','ጽኑ አይዙአችሁ ከእኛ ጋር ያለው/2*
 እጅግ ይበልጣል በአለም ካለው/2*

ብንወድቅ አንስቶ ከፍ ያደርገናል
 በምህረት አይኑ ሁሌ ያየናል
 መናወጥ ይቅር ዲያቢሎስ ይፈር
 ፀንተን እንጠብቅ ኢየሱስ ይክበር

ኢየሱስ ያነፃል ይጠግነናል
 ክብሩ ሲገባን ይፈውሰናል
 አውጥቶ አይጥልም የእሱ የሆኑትን
 ጸንቶ የቆመ ያያል ምህረቱን

ሙታን ያስነሳል እውር ያበራል
  ሽባን አቁሞ ያራምደዋል
 በእርሱ እንድንጸና ሁሉን ያደርጋል
 የተሰበረ ልብ ይጠግናል

ሁሉ ለበጎ ብሎ ከሠራ
 ተስፋ እንናደርገው አንዳች ሳንፈራ
 በእውነት ያነሳል የሱስ መልሶ
 በመንፈስ ቅዱስ ለውጦ አድሶ
',0),(NULL,'ጌታ ሆይ ኢየሱስ ሆይ','hebret11','ጌታ ሆይ ኢየሱስ ሆይ
 አብን አሳየንና ይበቃናል
 አንተ ወልድ ነህና
  አብን አሳየንና ይበቃናል

እስከ አሁን ከእናንተ ጋር ስኖር
 አታውቁኝምን? 
እንዴትስ አብን አሳየን ትላላችሁ
 እኔ ራሴ ሆኜ እያያችሁ

በሥጋ ሰውነት ለዓለም ታያቻለሁ
 የአብና የወልድ ባህሪን ይዣለሁ
 መለኮትነቴ በሥጋዬ አድሯል
 ምስጉን ነው በእኔ የማይሰናከል - ምስጉን ነው

መንፈስ በመሆኔ ሁሉን ስለሞላሁ
 የምወደው ልጄ ብዬ ተናገርሁ
 ከሰማይ ወረድሁ ሰማይም ያለሁ
  የሰው ልጅ እኔ ነኝ ቃሌን አስተውሉ - አስተውሉ

እኔ አብ መሆኔን ካላስተዋላችሁ
 ልትድኑ አትችሉም ከኃጢያታችሁ
 መለኮትነቴ በሥጋዬ አድሯል
  አብን ከእኔ ውጭ ማን ማግኘት ይችላል - ማን ይችላል

አባት ሆይ አባት ሆይ ብዬ ስለጸለይኩ
 የምልጃ አገልግሎት ስለ እናንተ አቀረብኩ
 ሌላ አባት በሰማይ ያለ ቢመስላችሁ
 አማላጅ ተማላጅም እኔው ነኝ አይዞአችሁ - እኔው ነኝ 
አንተው ነህ
',0),(NULL,'የእግዚአብሔር ምህረት ችሮታው','hebret11','የእግዚአብሔር ምህረት ችሎታው
 ለሕዝቡ ያደለው ስጦታው
 በጎነቱ እንዴት ድንቅ ነው
  በየዘመናቱ ያሳየው /2/

የተዋረደውን አንስቶ በከፍታ ላይ የሚያወጣው
 የባዘነውን የጠፋውን ፈልጎ የሚሰበስበው
 እንደ ኢየሱስ ማን ይገኛል
  ሽታው ፍቅር ፍቅር ይላል

ሕዝቡን ሲነካ ደስ አይለውም
  ልቡ ከመጠን ይልቅ ያዝናል
 የቀባዋቸውን አትዳሱ ብሎ ለምድር ሁሉ ያውጃል
 ኢየሱስ ነው ትጉ እረኛ ለልጆቹ የማይተኛ

እርግማንን በረከት አድርጎ ለሕዝቡ የሚዋጋላቸው
 በተዘረጋ ክንድ በኃይሉ መክቶ የሚጋርዳቸው
 አለ ኢየሱስ ከሕዝቡ ጋራ 
ታምራትን እየሰራ

ስሙን ለሰጣቸው ወገኖች በመንፈስ ቅዱስ ላተማቸው
 ሰማያዊቱን የተስፋ ሀገር የሱስ ቃል ገብቶ ሊያውርሳቸው
 ታላቅ ተስፋ ድንቅ በረከት 
ለልጆቹ የጠበቃት
',0),(NULL,'እሩቅ አይደለም የማርፍበት ቀን','hebret11','እሩቅ አይደለም የማርፍበት ቀን
 በእምነት በተስፋ የጠበኩትን
 ጉዞው መክበዱ ምልክቱ ነው
 የኢየሱስ መምጫው 
እጅግ ቅርብ ነው /2/

በናፍቆት በሲቃ በጨከነ  ተስፋ
  ተግቼ የጠበኩት መብራቴ ሳይጠፋ
 ልሸለም ልዘጋጅ አክሊሌን በደስታ
 አንድ ሆኖ ሲመጣ ያመንኩበት ጌታ

ወዲያ ወዲህ ሳልል ሳላንገራግር
 ድንገት ዛሬ መጥቶ በፊቱ እንዳላፍር
 ነገን ተስፋ አድርጌ ትላንትን ረስቼ
 በዛሬ ላይ ቆሜ ልጠብቅ ተግቼ

ድካሜ ልፋቴ  እንዳይቀር መና
 ብኩርናዬን ስጨ ለአለም ምስር ቃና
 በጌታ ኢየሱስ ፊት ተንቄ እንዳልገኝ
 በእርሱ ሁሉን መቻል መጠበቅን ልመን

ከአዘጋጀልኝ ጋር ይህን ሳስተያየው
 የጽዮንን ውበት በእምነት ስቃኘው
  ከቶ አይገናኝም የኢየሱስ ይበልጣል
  በዘላለም ደስታ ነፍሴን ያረካታል
',0),(NULL,'ላመስግንህ እንደገና','hebret12','ጌታ ኢየሱስ ሆይ አከብርሃለሁ
 ምስጋናዬንም ሰዋልሃለሁ
 ለእኔ ያረከው ብዙ ነውና
 ላመስግንህ እንደገና
 ደጋግሜ እንደገና ላመስግንህ እንደገና  /2/

ከምን እንዳወጣኸኝ ነፍሴ ታውቀዋለች ጌታዬ
 በድቅድቅ ጨለማ በሞት ውስጥ ተጥዬ
 ደስታ ርቆኝ ሐዘን ውጦኝ
  ኢየሱስ አንተ ደረስክልኝ

ነፍሴ እረኛ አጥታ በጭንቀት ውስጥ ሳለች አየሃት
 ወደ እቅፍህ በረት በደምህ ጠራሃት
 እንኳን አንተ አነፃሃት
  በማዳንህ አረካሃት

በዘላለም ክንድህ ኢየሱስ ሆይ ተጠግቻለሁ
 በደምህ ውስጥ ተሸፍኜ በዕረፍትህ እኖራለሁ
 በሰይጣን ራስ ላይ ቆሜአለሁ
 በስምህ ድል አግኝቻለሁ

ተስፋ የሌለኝን በታላቅ ተስፋ ሞልተሃል
 በሰማይ መዝገብህ ስሜን አስፍረሃል
 እርስት አለኝ በአርያም
  ሞት ሲኦልን ከቶ አልፈራም
',0),(NULL,'ኃይል የሌለኝን','hebret12','ኃይል የሌለኝን ፍጡር እኔን ደካማ
 እንደምን ወደድከኝ/ አሰብከኝ/ ጌታ/ኢየሱስ
  እንደምን ወደድከኝ/አሰብከኝ/ 

ስቅበዘበዝ በጨለማ በደረቅ በረሃ
 አይንህ አየኝ በጭንቅ ሆኜ በአይኖቼ ሳነባ
 የምህረት እጆችህን ዘርግተህ አነሳኸኝ
 ከሞት ባሕር ከረግረጉ እግሮቼን አወጣኸኝ

አዕምሮዬ እጅግ መደነቅ መገረም ይዞታል
 ያለፍኩትን ያን የጥንቱን ማሰብ ተስኖታል
 ምን ነበርኩኝ ከየት መጣው እንዴትስ እዚህ ደረስኩ
 አስገራሚ ድንቅ ሥራ ነው የነፍሴ መፈወስ

አውቃለሁ የእኔ ኃጥያቴን በደሌን ብዙ ነው
 ግን ቢሆንም በአንተ ምህረት ዛሬ ሰው ሆኛለሁ
 አካልህ ነኝ የደምህ ዋጋ አትጣለኝ የሱስ
 ነቅለህ አውጣው በመንፈስህ የልቤን ግብስብስ

አዕምሮዬ እጅግ መደነቅ መገረም ይዞታል
 ያለፍኩትን ያን የጥንቱን ማሰብ ተስኖታል
 ምን ነበርኩኝ ከየት መጣው እንዴትስ እዚህ ደረስኩ
 አስገራሚ ድንቅ ሥራህ ነው የነፍሴ መፈወስ
',0),(NULL,'ዝራው ዘሩን','hebret12','ዝራው /2 ዘሩን በትነው/2
 ዝሪው /2 ዘሩን በትኚው/2
 እንሂድ እንውጣ ዘሩን እንበትን
 ከጌታ ከኢየሱስ የተቀበልነውን
 የወንጌል አደራውን

በሜዳ ተራራ ዳገት ቁልቁለቱን
 ፈልፍለን እንግባ እንማስ ጋራውን
 ስለ ስሙ እናውራ ምስክሩ ሆነን
 ጌታ ኢየሱስ ለእኛ ያደረገልንን

ተዘግቶ የኖረው አንደበት ተከፍቷል
 ሽባ የነበረው ተፈውሶ ዘሏል
 ዲዳ የነበረው ሃሌሉያ ብሏል
 ደንቆሮውም ሰምቶ በወንጌሉ አምኗል

የራሳችን መዳን ለጊዜው ደስ ቢለን
 የደም ዕዳ ሸክም እንዳለብን አውቀን
 በየቦታው ሄደን ቃሉን ካላበራን
 አደራ በይዎች ሆነን እንዳንቀር

ዕዳውን ሳንከፍል ስንኖር በከንቱ
 ሁሉም ይመዘናል ፍሬ እንደማፍራቱ
 ዘሩን ሳንሰበስብ መከሩን በወቅቱ
 ድንገት እንዳይደርስብን ኢየሱስ ባለቤቱ
',0),(NULL,'ጌታዬ እግዚአብሔር ሆይ','hebret12','ጌታዬ እግዚአብሔር ሆይ
 እዚህ ያደረስከኝ
  በፊትህ እኔስ ምንድነኝ /2/

ስንከራተት ነበር በጨለማ
  እነዳ ነበር  ወደ ሞትም ስፍራ
 አሁን ግን አምላኬ መለሰከኝ
 በቃል በመንፈስህ አደሰከኝ /2/

ከክፋት ከተማ መለስከኝ
 ከረግረግም ጭቃ አወጣኸኝ
 አረማመዴንም አጸናህ
 በቃል በመንፈስህ አጽንተህ /2/

ጌታዬና አምላኬ መድኃኒቴ
 ምን አለኝ የምሰጥህ እኔ ለአንተ
 ስለ አደረክልኝ ውለታህ
 የምከፍለው የለም ላመስግንህ /2/
',0),(NULL,'ምስጋናዬ','hebret12','ምስጋናዬ /2 ያርግ ለጌታዬ
 ምስጋናዬ/3 ያርግ ለጌታዬ
 ምስጋናዬ ከፍ ከፍ ይበል 
ይክበር ኢየሱሴ

የምስጋና መስዋዕቴን ላቅርብለት ለጌታዬ
 ልወድሰው ከፍ ይበል ስሙ ይክበር አለኝታዬ
 ምስጋና ይድረሰው ቸሩ መሃሪዬ
 ለዘላለም ይንገስ ባለውለታዬ

የከበደኝን ሸክም ሁሉ ወስዶልኛል ስለስሙ
 ኃጥያቴንም አጠበልኝ ጌታ ኢየሱስ በደሙ
 ሰላሜ ብዙ ነው ደስታ ነው ኑሮዬ
 ነጻነት አገኘሁ ተከፍሏል ዕዳዬ

በክንፎቹ ሸሽጎኛል እስከዛሬ ጠብቆኛል
 ከረግረግ ውስጥ አውጥቶኛል ጌታ ኢየሱስ አድኖኛል
 እግሮቼን በአለት ላይ አጽንቶ ላቆመኝ
  ምስጋና ይድረሰው እዚህ ላደረሰኝ

ስሙ ኃይሌ መመኪያዬ ሆኖልኛል የጌታዬ
 ክንዱ ለእኔ ድጋፌ ብርታቴ ነው ለኑሮዬ
 እርሱ ረዳቴ ነው ሌላ አምባ የለኝም
 ስሙ ብሩክ ይሁን አንዴም አልጣለኝም
',0),(NULL,'ማዘን መበሳጨት','hebret12','ማዘን መበሳጨት ለምንድነው
 ማዘን መተከዝህ ለምንድነው
 ሊያድንህ ፈጥኖ ሊረዳህ ከጎንህ ያለው
 ኢየሱስ ሁሉን የሚችል ኤልሻዳይ ነው  /2/ 2

ፍቅሩ ፍጹም ነው ለዘላለም
 ዛሬ ወዶ ነገ የሚጠላ አይደለም
 መልካም እረኛ ኢየሱስ እያለህ
 ለምን የሌላ ድምጽ ትከተላለህ
በሐዘን ጊዜ የሚያጽናናህ
  በችግርም ወቅት የሚረዳህ
 ሁሌ የማይለይህ ወዳጅህ ነው
 በኢየሱስ ተማመን ኤልሻዳይ ነው
 ምንም ማይሳነው ሁሉን ቻይ ነው

የእግዚአብሔር ማደሪያ ቤተመቅደሱ ነህ
 ከዓለም ከኃጥያት ለእርሱ የለየህ
 የከበረ ዕቃ ከእንቁ የበለጠ
  በውስጥህ ስላለ በስሙ የለወጠ
እርኩሱን አትንካ ተጸየፈው
 ሐዘንን አስወግድ ከአንተ አርቀው
 ሁሌ ደስ ይበልህ አመስግነው
 በዚህ ነው ዲያቢሎስ የሚረታው
 እግዚአብሔር አምላክህ ብሩክ ነው

ከኢየሱስ እቅፍ ማንስ ይለይሃል
ከጉያውስ ደግሞ ማን ያወጣሃል
እግርህም ላልቶ እንዳትሰናከል
መሸሸጊያ ሆኖ ይከልልሃል
ከአለም እርኩሰት አመጻ
ለይቶሃል ዛሬ አመስግነው
ለአንተ ያደረገውን አስተውለው
እግዚአብሔር አምላክህ ርሁሩህ ነው
',0),(NULL,'የኋላዬን ትቼ የፊቴን','hebret12','የኋላዬን ትቼ የፊቴን ለመያዝ እተጋለሁ
 የጌታ የኢየሱስን ወንጌል ተሸክሜ እጓዛለሁ
 ጥርጥር ማመንታትን በጭራሽ ከውስጤ አወጣለሁ
 ያለፈው በደሌን ይቅር እንዳልክልኝ አምኛለሁ /2/

አልመለስበት የጥንቱ ያለፈውን ስህተቴ
 ደግሞ እንዳያዝንብኝ አፍቃሪው ኢየሱስ አባቴ
 ፈጽሞ አላስበው የቀድሞ ድካሜን ስህተቴ
 በድል እንዳገኛት የዘላለም ዕርስት እቤቴ

እንግዲህ ልነሳ ወንጌሉን ልመስክር አምኜ
 እራሴ ቀድሼ ቃሉን እንዳከብር ፈጥኜ
 ምስራቹን ላውራ በአለም ዙሪያ ሁሉ ደፍሬ
 ብዙ ነፍሳት ድነው እኔም እንድከብር አብሬ

መዘንጋቱ ትቼ በጸሎት ልበርታ ጠንክሬ
 ሥጋዬ ደልሎኝ እኔም እንዳልጠፋ አብሬ
 አየሁት ሁሉንም የዚህን ዓለም ነገር መርምሬ
 አባብሎ ደልሎኝ ሊያስቀረኝ መሆኑን ከክብሬ

ዘሩን እየዘራሁ እስከ መጨረሻው ተግቼ
 አምላኬ ሲመጣ በክብር እንድከብር ጸንቼ
 የድልንም አክሊል በድል እንድቀበል ከኢየሱስ
 ዘወትር እየተጋሁ እየተጠባበኩ ያንን ቀን
',0),(NULL,'ለአምላኬ ለኢየሱስ','hebret12','ለአምላኬ ለኢየሱስ
  ስለ ውለታው ምን ልክፈል
 ስለ ውለታው ምን ላድርግ
 በበረከት ላይ በረከትን ሰጥቶኛል
 መንፈሱን አፍስሶልኛል /2/

በአመጽ ተጸንሼ
 በኃጥአት ተወለድኩኝ
  ኢየሱስ ሆይ በምህረትህ
 በጸጋህ በቸርነትህ ዳንኩ /2/

ተርቤ አልለመንኩም
 አጥቼ አላስችህገርኩም
 በእቅፉ ገብቻለሁ
 ሁሉን ነገር አግኝቻለሁ /2/

የማዳን ደስታ ሰጥቶኛል
 ወደ ቤቱ አምጥቶኛል
 በሰማይ ደግሞ ያኖረኛል
 ኢየሱስ ልጁ አድርጎኛል /2/

ከሸክሜ አሳርፎኛል
 ለነፍሴ ሰላም ሰጥቶአታል
 ስለዚህ ስለ ውለታህ
 ከምስጋና በቀር ምንልስጠህ /2/
',0),(NULL,'እንደ ኢየሱስ ማን ነው','hebret12','እንደ ኢየሱስ ማን ነው ረዳት የሚሆነው
 እንደ ኢየሱስ ማን ነው መጠጊያ የሚሆነው
 እውነተኛ ፍቅር ያለው
 በቃሉ ታማኝ የሆነው
 ሳይተወን ሳይጥለን ሰማይ የሚያደርሰን
 ኢየሱስ ነው
 
ዘመን ይለወጣል ጓደኛም ይከዳል
 ገንዘብም ያልቅና ድህነት ይመጣል
 ውበትም ይረግፋል ደም ግባት ይጠፋል
 ጌታ ኢየሱስ ብቻ ከእኛ ጋር ይኖራል

እውቀትም ይሻራል ጤናም ይቃወሳል
 ኃያል እንኳን ሳይቀር በቀኑ ይደክማል
 ጌታ ኢየሱስ ብቻ ጽኑ አምባ ይሆናል
 ዘላለም ሳይደክም ሕዝቡን ይጋርዳል

እስከ መስቀል ሞት ያፈቀረን ጌታ
 እርሱን የሚመስል አይገኝምና
 የማይከዳ ወዳጅ ሆኖ ይረዳናል
 ወረት አይለውጠው ቃሉን ይጠብቃል

 አይኖቹ ዘወትር ወደ ጻድቃን ናቸው
 ጆሮቹም ደግሞ ወደ ጩኸታቸው
 እውነተኛ አምላክ ፍቅርን የተሞላህ
 በቀንም በሌሊት ይሆናል ከለላ
',0),(NULL,'ምስጋና ምስጋና','hebret12','ምስጋና ምስጋና
  ዝማሬ ዝማሬ
 እልልታ እልልታ
 ይክበርልን ጌታ /2/

 ግርማው ከዳር እዳር ከሩቅ ሲያስተጋባ ምስጋና
 ምድር ተናወጠች ድምጹን ሲያሰማ ምስጋና
 ምስጋናን ሊቀበል ተነስቷል ከክብሩ
 ለሠራዊት ጌታ ለኢየሱስ ዘምሩ /2/

ኢየሱስ ታላቅ አምላክ ነው ፈቃር ታጋሽ ነው
 ኃይሉ ከሁሉ በላይ ሁሉን ሚያደርግ ነው
 የጠላት እራስ ተቀጠቀጠ የወንጌል እውነት ተገለጠ
  አገኘን ሕይወት እና በረከት
 ምስጋናን ለእርሱ እናቅርብለት
 
ለእርሱ ምስጋና እንሰዋለን እንዘምርለታለን
 ይክበር ከፍ እናደርገዋለን እናከብረዋለን
 ኃያሉ ክንዱ እየረዳን ነው
 ከእኛ ጋራ ድንቅ እያደረገ ነው
 ከፍ ይበል ኢየሱስ ለዘላለሙ
 ድልን የሰጠን ይመስገን ስሙ

ክብሩ ሰማይ ምድር ሞልቷል ምህረቱ በዝቷል
  ግርማው ኃይል ታምር አድርጓል ኮረብቶች ቀልጠዋል
 እንደ እርሱ የሚሆን ከቶ የት አለ
  ከጥፋት ሕዝቡን ሁሉ የከለለ
 በሰማይ በምድር አቻ የሌለው
 የሱስን ማን ነው ሚስተካከለው
',0),(NULL,'ስትወጋ ከጎን የወረደው','hebret13','ስትወጋ ከጎን የወረደው
 እያቃሰትክ ለእኔ ያፈሰስከው
 ከአቤል ደም ይልቅ የከበረው
ደምህ ነው ኃጥአቴን ያጠበው/2*

የኃጥያቴን ብዛት የበደሌን ቁጥር
 የአስጨናቂዬን ዘንግ የጫንቃዬን በትር
 ሰብረህ አዲስ ፍጡር አዲስ ሰው ያረከኝ
 ደምህ ነው ኢየሱስ ኃጥያቴን ያጠበው

እንደሚታረድ በግ ዝም ብለህልኝ
 እኔ እንዳልቆስል አንተ ቆሰልክልኝ
 ጀርባህን ለጅራፍ ጎንህንም ለጦር
 ሰጠህ በደምህ እኔን ልታከብር

እስከ መስቀልም ሞት ኢየሱስ የታዘዝከው
 ጭንቀትህ ስቃይህ እኔን ለማዳን ነው
 እያቃሰትክልኝ ለካ ያፈሰስከው
 ደምህ ነው ኢየሱስ ኃጥያቴን ያጠበው

በብርና በወርቅ በሚያልፍ ነገር
 በጎጆ ኑሮዬ በምድር በሚቀር
 ከቶ አይደለም ኢየሱስ እኔን የገዛኸኝ
 በክቡር ደምህ ነው ወደ አንተ ያቀረብከኝ
',0),(NULL,'ባዋ ባዋ','hebret13','ባዋ ባዋ
 አቶተታይ ባዋ
 ናአንቶ የለተናን
 ሃታፐነ አያናፐ

ክልን ሳሉዋን ሻራን ቀፊያ ከሳዳ ኔኒ ፓልኮካ
 ጦሳ ኬታን ዳርን ጋምአስ ያጋዳ ኔኒ ጬቅኮካ
 ዮሐንሳ ዎንጌሊያ ሸምፗ ሄዛ ቦላን ዮቶጋ እጥኮ
 አቶተታይ ባዋ ሃታፐነ ኢያናፐ የለንተናን ዲኮ

ጦሳ ሲቁዋ ግሻው ነ አሹዋ ቃንጣዳ ታማን ያርሽኮካ
 ጉልባታይ ሙሉግን ጋላስነ ቃሚ ጦሳው ጎይንኮካ
ኢሳያሳ ማጣፋን አይታማነ አይዳን ዮቶጋ እጥኮ
 ሳሉዋ ሳአ መልአይ እስ ጦሳ ጊሸን ጦሳ ሄዛ ጊኮ

ነ አ ሱንታ ጤስን ሃርጋንቻይ ፓጥድ ጉንዳይ ጉፒኮካ
 በን ኤልያሳዳን ሳሉዋፐ እራዳን ታማ ቡክስንካ
 ማርቆሳ ማጣፋን ታማነ ኡሱፑናን ዮቶጋ እጥኮ
 አማኖይነ ሜቻይ አሸስ ያግሽን አሸና ያግኮ
',0),(NULL,'ደች ሁምናሳትን ካን ኡሜ','hebret13','ደች ሁምናሳትን ካን ኡሜ
 ሰንስ ቤኩምሳሳትን ካን ድርርሴ
 ዱራትስ አማስስ ኢየሱስ ቶኩማ
 ካራንስ ዱጋንስ ጅሩንስ እሱማ

ቃልቢን ኬሳን ማልፍ ፋፋጫአ አዳን
 ካን ኑኡሜ ቶኩማ ማልፍ ታራራአምታን
 ዱካና ኑባሱፍ ኑባይሱፍ ድርቃሜ
 ሉቡሳ ኑዳርባሴ ፋኖአን ፋንፋሜ

ኡማ ሁንዳ ካኑሜ ራቢ
 ፎኒን ሙላቴ
 ኢየሱስ ካንጀዳሙ ሉቡን ኑፋይቴ
 ዱካና ከሳ ካንጅርታን ባአ ጀዴ ላላበ
 ዱአ ኑራ ዳባቴ ጅሩሳት ኑጅጅሬ

ኩቴ ኑራ ደርቤ ኃጢአትን ሂዳምኔ
 ኦኔ ኬኛ ባልፍኔ አዳዳሙራኔ
 ሉቡ ኢሳትን ዳባቹ ሙራኔ
 ኢየሱስ ቆፋ ጎፍታ ካንዋስ ኑታኤ

ቤኩምሳ ቶኮ ፍዱፍ ቤኩምሳ ኢሳትን
 አዱኛን ፋይዳ ሂንቃብዱ ሁንድ ሂንደባትር
 ሐዳባኑ አማትን ዱራትስ ሐፉፉኑ
 ኑቤክስሳ ኑት ሂማ ማልሳ ማል አካ ጎኑ
',0),(NULL,'ኢየሱስ  ጌታና አምላኬ','hebret13','
ኢየሱስ/3* ጌታና አምላኬ ነህ /2/
 ከአንተ በቀር በሰማይም ሆነ በምድርም
 ሚያድን የለም /2/

በመከራው ሰአት የሱስ ሆይ እላለሁ
 ጠዋትና ማታ ስምህን ጠራለሁ
 ታማኝ ነህ አምላኬ ኢየሱስ
 እንደማትሰለቸኝ አውቃለሁ

የአማልክት ስም ሁሉ አይደርስም ስምህን
 እንደ አንተም ደግሞ ሕይወትን አይሰጥም
 አያድንም አልጠራውም
 ከስምህም ሌላ አልመኝም

ስምህ ሥልጣን አለው በሰማይ በምድር
 የዘላለም ሰላም ፈውስን የሚሰጥ
 አምላኬ ነህ መዳኔ ነህ መድሃኒት ነህ
 ሁሉን በሁሉ ነህ
',0),(NULL,'የሱሳ ኬሳን ሃሌጫሞ','hebret13','የሱሳ ኬሳን ሃሌጫሞ
 ኪ አዜን ማጠማሞ
 ኬሳን አመዕነማሞ
 ኬሳን ድከአሞ
 አን ሆግማ መቆዕ አቴቲ
 አን ሀጣታሟ ሙጭርመዕ አቴት
አብኑክ አብኔአኔ ደሊ ሁንዲሃ
 የሱሳ አት ኢሃ አን ኪሃ  /2*

ኪድክሻን ሔአሞ ኪ ሀሌቾን ገላሞ
 ኬዕሜኤራ ሁንደንራ ኬሳን ኩዕላሞ
 ኪ አጉሪን ፈኤሞ አብሽ ማሰአሜሞ
 ቅሽጡክ በተኤያን ቤቱክ የመሜሞ  /2*

አለማን ሀዊቶሪ ፍሎጭተ ሀሌቱ
 ሰገቤን ጎደአንቶሪ ሄቸተ ቡዕሌቹ
 ሀዊ በር ማጣንቿ ሆንጋኒ ድክሸተ
 ኦሱክ ሼጣኑ በዕሱምቦጋ አቲ አተታ/2*

ሱዕመክ ገእሲሱንታ መቆክ አዲሴኤ
 ወደ ሐዋሪያትገን አሰንቺን ዊንሼኤ
 ኪ ሙጩርማን ድክሴኤ ኡባምበአ
 አት መቆ እኔኤ ሆረን ሆጋምበአ/2*
',0),(NULL,'የመጣው ቢመጣ','hebret13','የመጣው ቢመጣ
  የሆነው ቢሆንብኝ
 ሥጋዬን በጥርሴ ይዤ አመልከዋለሁኝ/
እዘምራለሁኝ/አገለግላለሁኝ /2/

በሥጋዬ ሕመም በጣም ቢበዛብኝ
በሰው ፊትም መቆም ፋታ ባይሰጠኝም
 ስጋዬን ቢያሳፍር ቢያሸማቅቀኝም
 ለአንተ ከመዘመር ወደ ኋላ አልልም

ማዕበል በሕይወቴ በዝቶ ቢያናውጠኝ
 ተስፋ አስቆራጭ ነገር ደጋግሞ ቢገጥመኝ
 ኑሮዬ ተሳክቶ ተሟልቶ ባላይም
 አንተን ከማገልገል ፊቴን አልመልስም

ጠላቴ ዲያቢሎስ በነፍሴ ቢነሳ
 ቁጣው በላዬ ላይ ቢነድድ ቢበዛ
 ሕያውም ሳለሁኝ ሊውጠኝ ቢመጣ
 የመጣው ቢመጣ ከእቅፍህ አልወጣም

የነፍሴ መድኃኒት ኢየሱስ አንተ ነህ
 በጊዜውም እምትጠግን ስብራቴን አይተህ
 ሰዎች እንደሚሉኝ አንተ አትለኝም
 አይተው እንደሚፈርዱት ደግሞ አትፈርድብኝም
',0),(NULL,'መጠጊያ ለማግኘት የሚባዝነውን','hebret13','መጠጊያ ለማግኘት የሚባዝነውን
በዚህ ዓለም ምስቅልቅል ኑሮ የከበደውን
በፍቅሩ ፍለጋ ኢየሱስ ያገኝና
ለክብሩ ያቆመዋል ከአመድ ያነሳና
ለተረሳ አስታዋሹ
ሰቆቃን አይቶ ደራሹ
ኢየሱስ ነው የማይረሳ
ከፋንድያ የሚያነሳ 

በምስጋና አንደበት ከፍ በል እንበል
 ክብሩንም ለመግለጽ ጭብጨባዉም ያይል
 ልባችን ይሙላ በእርሱ ዝማሬ
 ምስኪን ሲያነሳ አይተናል ዛሬ /2/
እፎይታን ተጠምቶ ነበር አመጣጡ
 ሰላምን ፍለጋ ሲሆን አወጣጡ
 ያመልካም አባት ግን ቸሩ ጌታ ኢየሱስ
 ልክበርብህ አለው ሰጥቶት ታላቅ ሞገስ

ዓለም አትበጀኝም ፍጹም አትጠቅመኝም
 ብሎ የጣለችውን ኢየሱስ ከቶ አይንቅም
 ትቢያውን አራግፎ በዘይት ይቀባዋል
 ጸጋን አትርፎለት ይጠቀምበታል

ተስፋው ተሟጦበት መድረሻ ለጠፋው
 ወዳጅ ዘመን ሸሽቶት ለሚንከራተተው
 ኢየሱስ የሚባል አለ መልካም ወዳጅ
 የወደቀን አንሺ ለሕይወት የሚበጅ
',0),(NULL,'ንገትምዱ አጋና አጋና','hebret13','ንገትምዱ አጋና አጋና
  ንገትምዱ አጋና
 ብር ወርቅኔ ኬናሞቤአኔ
 ለች ቆሮምኔ ሲደሞ ቤአኔ አጋና

ብርኔ ወርቅኔም ኩገትም ሲደሞዮ
 ለችኔ ቆሮምኔም ሲድምና ጠናሞዮ
 ንዋእ ኔሶኦ እታቴ ከሐንቃ ጫክሱኮ
 ሙል ኬንና ይጳኮ ሔች ጎጎኔ ኡልሱኮ

ዋእ ብክና ዩኩዬ በላ ሕሞ በዶሮ ኬን
 እጤና ዮ ዶሌ ኡራቴ  ኡል ሁንደም ዶአኬን
 ዋእ መቶማ ለአቴ እጦ አመነማቴ
 ሞላን የሱስ ሱምኔ ባጥል ሙጨራቴ

ንዋእንዱ ገለታ ዋሮ ቁንቅ ገንታሞ
 ሞላን ኢየሱስ ቡምኔ ከረት ትርማሞ
 መንፈስኔ ወምናቴ ዱት ሰገርኔ ወንጫሞ
 እመን ሄች ኡልካ ካርና አልናም
',0),(NULL,'የእሾህ አክሊል','hebret13','የእሾህ አክሊል በራሱ ያረገው
 ጎኑንም በጦር የተወጋው
 እጆቹን በሚስማር የተመታው
    ለእኔ ነው/2*
    ኢየሱሴ ለእኔ ነው
    እንዲህም የሆነው /ክብሩንም የተወው
 
መልክና ውበት የሌለው
 እንወደው ዘንድ ደምግባት የራቀው
 የተናቀ በሰው የተጠላ 
የህማም ሰው ደዌን የሚያውቅ ነው

በእውነት ደዌዬን ተቀበለ
  ሕመሜንም እርሱ ተሸከመ
 ስለ መተላለፌም ቆሰለ
    ለእኔ ነው…

ስለ እኔ በደል ደቀቀ
 በመስቀል ላይ ሆኖ ተጨነቀ
 ግርፋትን ሁሉን የቻለው
    ለእኔ ነው /2* አሜን ለእኔ ነው
    እንዲህ የተዋረደው

ከነፍሱ ድካም ብርሃን ያያል
 ከኃያላን ጋር ምርኮ ይካፈላል
 ከአመጸኞች ጋር ተቆጥሯልና
 ስለ እኔ ኃጥያት ማልዷልና
',0),(NULL,'ሕናሳንቹ  ማጋን','hebret13','ሕናሳንቹ  ማጋን ሐላለ ጣዊስዎኤ
 ሙላ ሐራሜሞሃ ቤቶስ አስሪዎኤ
 ሱምስን ጩአመ ጩቡን ት’ዳማይታ
 ባደ ጣዊስኖኤ የሱሲራ ጋላታ

አነን ማና አሰ ሕናሰ ባጥኖኤ
 ሐላለስ አፋታ እለ’ያ ፋንኖኤ
 ላመሆ ሳሰሆ ያና ዶጎ ቱንስትዎኤሀ
 ጋትሰ ፉሽኖኤ ካጱ ኤገምዎኤሀ

ማጋ’ነሞ ማጋኖ ባደ አፉሞክን
 አማኖሞላ ያን ዶጎ ቡጡሞክን
 የሱስ’ያ ማሳሞ እስሐ አስርዎኤ
 ማጣሜ ቴ’ልዎኤሐ ፎጆስ ሌልሽዎኤ

ሱምስን ጡአመ የሲሳ ኡድሩሞ
 ሕናስዎኤሐ አና ሎስሲን አፉሞ
 ሔዶሞክ ጋርን እስሐ አስርዎኤ
 ኬራንቾ ሙንዴስን ጩቦ’ያ ሐይሽኖኤ

አንን ኪሮ ኤኤ ማናሆ ያማሙሞ
 ማደ ቆለ ቱንጎይሁ ማኑ ኪሮ ኤኡሞ
 ሙላ ገደ አስነ ባላልስነ ሑኖይሐ
 የሱሳ ጋላጤሞ ሉቦ’ያ ሕ’ድዎኤሐ
',0),(NULL,'ኢየሱሴ ክብሬ ሞገሴ','hebret13','ኢየሱሴ ክብሬ ሞገሴ
  አንተ ነህ ለእኔ ሀብትና ቅርሴ
 አንተ ነህ ለእኔ ሀብትና ቅርሴ /2/

ለትውልዶችም ሁሉ የማወርሰው
 የምመካበት አለኝ የምለው
 የምጠራበት የክብር ልብሴ
 አንተ ነህ ኢየሱስ ክብሬ ሞገሴ/2*

በአባትነትህ ያወረስከኝን
 ሕይወት ሰላምን የሰጠኸኝን
 እኔም ለልጅ ልጅ ለዘሬ ውርሴ
 ብር ወርቅ አይደለም ነህ ኢየሱሴ/2*

የታመንኩበት ሁሉ ሲተወኝ
 ተስፋ ያረኩት ሁሉ ሲጥለኝ
 አንተ ብቻ ነህ ቀሪ ገንዘቤ
 የምትረዳ የውስጥ የልቤን/2*

ውዴ የእኔ ነህ እኔም ያንተው ነኝ
 ማንም አይችልም ከቶ ሊለየኝ
 በክንፍህ ሆኜ ሁሉን አገኘሁ
ከመልካም ክንድህ ኢየሱስ ምን አጣሁ/2*
',0),(NULL,'ጌታ ገለተው','hebret13','ጌታ ገለተው/2/ የሱስ ገለተው
የውዘየሊዪ ተአምራተው
ባወርርም ቲያልቅ የቂናሊዪ
ለጉግርሙ ዬክብር ጌታዲ

ክብረው ገፈረም ምድር ወረደም
 ንፍስዲ ያተርፍይ መኸራ አየም
 በመስቀል ላለ ደመው ጎደሊም
   የዲ ያተርፍየን ጉባው? ሞትሊም
 
ጌታ ገለተው . . .

ሴጣን አገዴም እጅም እግርዲ
 ሰላም ፈታዬው የሱስ ጌታዲ
 ተጥፋት ገንዳ ዝ አወጣዬም
    ማለቂ እዝጌር መንፈሰው አቤም 

ጌታ ገለተው . . .

ተክፉ ሞጮ ተረፍኩም እዲ
 በብልአተው ሞላም ልብዲ
 ጌታዲ እየሱስ የማሬ ኩዋትን
 ለዚ ያሰላዬ ገለት የስላንን
 
ጌታ ገለተው . . .

በየሱስ መዛ እዲ ፎየሁም
         ተኩዋ የመጣሆም ኬረው አዠሁም
',0),(NULL,'በዘመኔ ሁሉ ለአንድ አምላክ','hebret14','ሁሉን የምትችል ፈጣሪ ነህ ኢየሱስ
 የአማልክት አምላክ የነገስታት ንጉሥ
 እውነት ፈራጅ አምላክ አንተ ብቻ ኢየሱስ
  ግዛኝ ለዘላለም ክበርብኝ ኢየሱስ
በዘመኔ ሁሉ ለአንድ አምላክ እሰግዳለሁ
 ምስጋና ለስሙ ዝማሬ አቀርባለሁ
  አንድ አምላክ ኢየሱስ እንደሆነ አውቃለሁ
 የልቤን መስዋዕት አምልኮ አቀርባለሁ

ከቶ ማነው ለአንተ ምክርን የለገሰ
 እንዲህ አድርግ ወይ እንዲያ ብሎ ያስተማረ
 አንተነህ ኢየሱስ ከጥንትም የነበርክ
  ሰማይና ምድርን በቃልህ የፈጠርክ

የሲድራቅ የሚሳቅ የአብድርናጎም አምላክ
 ከሚነደው እሳት ከእቶን ያድናል
  በሰማይ በምድር ታምራት ይሰራል
  ነገስታትን ሁሉ ኢየሱስ አስደንቋል

ክብርና ውዳሴ ለአንተ ይሁንልህ
 እልልታ ዝማሬ ዘውትር ይቅረብልህ
 ገናና ነህ ኢየሱስ አምልኮ ይብዛልህ
  ለታላቅነትህ ዘውትር ልስገድልህ

ሕይወት እስከነትርፉ አምላኬ ሰጥቶኛል
 ከዚህ የበለጠ ሌላ ምን ይገኛል
 ለውለታው ምላሽ ምን ይከፈለዋል
 ለክብሩ መግለጫ ቃላትም ያጥረኛል
',0),(NULL,'እግዚአብሔር ከእኛ ጋር ይሰራል','hebret14','እግዚአብሔር ከእኛ ጋር ይሰራል /2*
 እንባችንን ከአይናችን ያብሳል /2*
 ጸሎታችንም ይመለሳል/2*  /2/

የዕውሮች አይን ገና ይከፈታል
 ዲዳዎችም ለእርሱ ይዘምራሉ
 ለምጻሞችም ገና ይነጻሉ
 የኢየሱስን ማዳን ያወራሉ

የወንጌል ቃል በእርሱ ይሰበካል
የሚድኑ ወደ እርሱ ይመጣሉ
ኢየሱስን ከፍ ከፍ ያደርጋሉ
የአምላካችን ማዳን ያያሉ

የሚድኑ እጅግ ብዙ ናቸው
 ጌታ ኢየሱስ ለእርሱ ያሰባቸው
 ተነሱና ወንጌሉን እናብራ
 በሸለቆም ቢሆን በተራራ

በአራቱ ማዕዘናት በምድር ዙሪያ
 የጌታ የኢየሱስ ስም አበራ
 ወንጌሉ ለፍጥረት ያደርሳል
 አምላካችን በክብር ይነግሳል
',0),(NULL,'የቀናውን መንፈስ በውስጤ አድስልኝ','hebret14','
የቀናውን መንፈስ በውስጤ አድስልኝ ኢየሱስ አድስልኝ
የቀናውን መንፈስ በውስጤ አድስልኝ 
የልቤን ሸለፈት አንተ ግረዝልኝ ጌታ ግረዝልኝ
 የአይኔንም ቅርፊት ከእኔ አስወግድልኝ
አንተን እንዳይ ኢየሱስ/2*
አንተን እንዳይ ጌታ/2*

መራራ ሕይውቴን አንተ አጣፍጥልኝ/2*
 ሸካራውን ልቤን ጌታ ለውጥልኝ/2*
 መላው ሕዋሳቴን ባርከህ ቀድስልኝ/2*
 አረማመዴንም አንተው አስተካክልልኝ/2*
አንተን እንዳይ  …
አንተን አሳዝኜ ሰላም የላት ነፍሴ/2*
 የሕይውቴ ትርጉም አንተ ነህ አምላኬ/2*
 ላክብርህ ጌታዬ ዘወትር ተንበርክኬ/2*
 ውሰድ ተረከበው እንካ ሁለንተናዬን/2*

የኑሮዬ ክብር የነፍሴ እርካታ ነህ /2*
 ዘወትር መሻቴ ኢየሱስ ምርጫዬ ነህ/2*
 በልቤ ዙፋን ላይ ከፍ ብለህ ከብረህ/2*
 አንተ ንገስብኝ ሁሉን ተቆጣጥረህ/2*

ፊትህን አብራልኝ ሰላምህ ይብዛልኝ/2*
 ሰማያት ተከፍተው ባርኮትህ ይምጣልኝ/2*
 የቃልህን ምስጥር አንተ ግለጽልኝ/2*
 መሻቴንም አይተህ ኢየሱስ ፈጽምልኝ/2*
',0),(NULL,'ቤቴል ቤቴ ናት','hebret14','ቤቴል ቤቴ ናት ከሷ አልወጣም
 ቤቴል ቤቴ ናት የትም አልሄድም
 ሕይወት እስከ ትርፉ ያገኘሁባት
 ቤተክርስቲያኔ መኖሪያዬ ናት/2*  /2/

ሰላም በረከት ፈውስን አግንቼ
 የሰማይ መናን ቃሉን በልቼ
 የእናቴን ጡት ወተት ጠጥቼ
 ይኸው ኖራለው በእርሷ ረክቼ/2*

ሸክሜን በሙሉ ያራገፍኩባት
 ቀንበር ተሰብሮ ቀና ያልኩባት
 ከዲያቢሎስ እጅ ያመለጥኩባት
ቤተክርስቲያኔ የረካሁባት/2*

መኖርያ ቤቴ ማደሪያዬ ናት
 ቤተክርስቲያኔ መመኪያዬ ናት
 ባጣም ባገኝም ብራብ ብጠማም
 ለዘለአለም ከእሷ አልወጣም/2*

ከአንቺ ጋር ልኖር ቤተክርስቲያኔ
 ቃል ገብቻለሁ በሕይወት ዘመኔ
  ከአንቺ የሚበልጥ ምንም የለኝም
 ለአንቺ እገዛለሁ ለዘለአለም /2*
',0),(NULL,'ቢዘገይም','hebret14','ቢዘገይም /3*
 አምላኬን በትዕግስት እጠብቀዋለሁ
 መዳን የሆነልኝ ከእርሱ እንደሆን አውቃለሁ

እኔ ግን በኢየሱስ እጅግ ደስ ይለኛል
 ማግኘት ማጣት ቢሆን እንዴት ይለየኛል
 ወገቤን በእምነት ታጥቄ ቆማለሁ
 ዳገት ቁልቁለቱን በኢየሱስ አልፋለሁ

እድሌ ባማረ ስፍራ ወድቆልኛል
 የርስቱን መያዣ መንፈሱን ሰጥቶኛል
 የቃል ኪዳን ልጅ ነኝ ቃልም ገብቶልኛል
 ኑሮ ሞላ አልሞላ ምንስ ይገደኛል

በሐዋርያት በነብያት መሰረት ቆሜአለሁ
 ከዚህ ሌላ እውነት እንደሌለ አውቃለሁ
 ትካዜዬን ደግሞ በአምላኬ ጥላለሁ
 ቢዘገይም ኢየሱስ ይመጣል አውቃለሁ

 ዛሬ በበረት ውስጥ ከብቶች ባይገኙም
 በለስም ለምልማ ፍሬ ባትሰጠኝ
ሥጋዬን በጥርሴ ነክሼ ቆማለሁ
 ኋላ ረፋዱ ላይ በረከት አያለሁ

አይኖቼ እንድያዩት ሲመጣ አምላኬ
 በመቅረዜ ይሙላ ሁልጊዜ ዘይቴ
 ከሰነፎች ጋራ እንዳልቆም በግራ
 ዘወትር መብራቴ በአምላኬ ፊት ይብራ
',0),(NULL,'ለኢየሱስ ምንስ ምን ይሳናል','hebret14','ለኢየሱስ ምንስ ምን ይሳናል ምን ይሳናል
 ሁሉንም በጊዜው አስተካክሏል
  ሁሉን ችሏል
 በኢየሱስ ምን አለ ያልታለፈ
  በክንዱ ሥር ሁሉ ተሸነፈ
 ሁሉንም አስገዛው በበታቹ
 ጠላትን ረጋግጧል በእግሮቹ
 
ኃይለኛ ነው ኢየሱስ ኃይለኛ ነው
 የጠላትን ሰፈር ያስጨነቀው
 መመኪያነው ኢየሱስ መደገፊያ ነው
 ለችግረኛው መጽናኛው ሆነው

እንደ ኢየሱስ ያለ ይገኛል ወይ
  አላየንም እኛስ በምድር በሰማይ
 እንደ ኢየሱስ ያለ ከየት ይገኛል
 ልባችን ነፍሳችንን አርክቷል

ዮሴፍን ሲያከብር በግዞቱ ምድር
 አስነሳው ከጉድጓድ በፈቃዱ ምክር
 በርኃቡ ዘመን ጥጋብ ሆኖለታል
 በፈርዖንም ፊት ሞገስን ሰጥቶታል

ከፍ ያደርጋል ኢየሱስ ያሳድጋል
 ለተበደሉትም ፈጥኖ ይፈርዳል
 ጸጥ ያደርጋል አውሎውን ጸጥ ያደርጋል
 ወጀቡን ነፋሱን ይገስፃል

ለእኛም ብዙ ተደርጎልናል
 ለኢየሱስ ምንስ ይሳነዋል
 እንደ ኢየሱስ ያለ ከየት ይገኛል
 ልባችን ነፍሳችን በእርሱ ረክቷል

ዳዊት የእሴይ ልጅ ታናሽ ብላቴናው
 በግርማው ኃይል መጣ ጎልያድ ሊያስፈራራው
 ዳዊት ከኮሮጆው ጠጠሩን አወጣው
 የጥላቱን ከንቱ  ህልሙን አጨለመው

ተዋጊ ነው ኢየሱስ ያውቅበታል
 የጠላቱን ጦር ቀስት ይሰባብራል
 ተናወጥ ስፍራው ተናወጠ
  ያስጨነቀን ሐሳብ ተለወጠ

ጎልያድ ተመታ ጭፍራው ተሸበረ
 ለእግዚአብሔር መዝሙር ተዘመረ
 ጎልያድ ተመታ ጭፍራው ተሸበረ
 ለእግዚአብሔር መዝሙር ተዘመረ

ለእረፍታችን ምክንያት ሰላም እፎይታችን
 በደስታ እንድንኖር ኢየሱስ ሰላማችን
 ከእኛ ጋር ወረደ እስከ ጉድጓዱ ጫፍ
 አይቶ አዘነልን በሕይወት ለማትረፍ

አምላክ አለን እኛስ አምላክ አለን
 ስንደክም ስንበረታ አለሁ የሚለን
 ደስታ ሆነልን እንባችንን አይቶ
 ልመና ጩኸታችንን ሰምቶ

እንደ ኢየሱስ ያለ አይገኝም
 በሽምግልና ዘመንን የሚያለመልም
 እንደ ኢየሱስ ያለ ከየት ይገኛል
 ልባችን ነፍሳችን በእርሱ ረክቷል
',0),(NULL,'የኤልያስ አምላክ','hebret14','የኤልያስ አምላክ ታምራትን ሰርቷል
 የበአል ነቢያትን አሳፍሯቸዋል
 ዛሬም በዚህ ዘመን በኃይሉ ተገልጧል
 ከስም ሁሉ በላይ የሆነ ስም ይዟል /2/

ይገባዋል ምስጋና ይገባዋል ውዳሴ
 ኃያል ጌታ ነውና ይገባዋል ምስጋና /2/

የኤርትራን ባሕር ከፍሎ ያሻገረው
 ጥንት በሙሴ ዘመን ዛሬም የሚሰራው
 በሥጋ ተገልጦ ምድር የወረደው/2*
 ታምራት የሠራው ኢየሱስ እሱ ነው/2*

የከበደብንን የሞት ዕዳ ሊከፍል
 አማኑኤል ሆኖ ወደ ምድር መጥቷል
 ረሃብ እርዛትን ጉስቁልናን ችሎ/2*
 በደሙ ገዝቶናል በመስቀል ተሰቅሎ/2*

በሰውና በአምላክ መሃከል ያለውን
 የጥሉን ግድግዳ በሥጋ ያፈረሰው
  በጭራሽ አልቻለም ሞት ማርኮ ሊያስቅረው/2*
 የሞትና የሲኦል መክፈቻ በእጁ አለው/2*

የአህዛብ አማልክት አይሰሙ አያዩ
 ከብርና ከወርቅ ቀልጠው የተሰሩ
 የእኛ አምላክ ኢየሱስ የሁሉ ጌታ ነው/2*
 በሰማይ በምድር ሥልጣን የእርሱ ነው/2*
',0),(NULL,'ልዩ ነው ልዩ ነው','hebret14','እሾህ አሜከላ መንጥረህ ኢየሱስ አሳለፍከን
 ተራራውን ሜዳ አርገህ ጌታችን መራኸን
 ሰይጣን ፍላጻውን ወርውሮብን ኢየሱስ አዳንከን
 በልዩ ጥበቃ አንተ ነህ ዛሬን ያደረስከን

ልዩ ነው ልዩ ነው ጥበቃህ በእኛ ላይ ልዩ ነው
ልዩ ነው ልዩ ነው ምህረትህ በእኛ ላይ ልዩ ነው
ኧረ ስንቱን ነው በድል የሱስ ያሳለፍከን ያሻገርከን
አቤት ልዩ ነው ጥበቃህ ያደረክልን
ከጠላታችን ቀስት ጠበከን ኢየሱስ ሰወርከን
 በግርማ ከለልከን ሸፈንከን አምላክ ሆይ ጋረድከን
 ስምህ በዙሪያችን የእሳት ቅጥር ሆኖልናል
 በአንተ ተጠብቀን ሳንፈራ ዘወትር እኖራለን

ከፊት ከኋላችን ፈርዖን ከነሠራዊቱ ከቦን
 መግቢያ መውጫ አጥተን ሳለን የሱስ ደረስክልን
 ዮርዳኖስን ከፍለህ በደረቅ በየብስ ተሻገርን
 ይኸው በአንተ ምህረት ኢየሱስ አልጠፋንም አለን

ጌታ አምላካችን አንተ ከእኛ ጋራ ባትሆን
 ጨርሶ በጠፋን ነበር ዛሬንም ባላየን
 በአደባባዮችህ ቆመን ሥራህን እናውጃለን
 ለልጅ ልጅም ታምራትህን እንናገራለን
',0),(NULL,'እንደ ፈቃዱ ማድረግ የቻለ','hebret14','እንደ ፈቃዱ ማድረግ የቻለ ማነው እንዳንተ ያለ
 ዘንዶን ቀጥቅጦ በጥልቅ የጣለ ማነው እንዳንተ ያለ
 በልቡ ትሁት የዋህ የሆነ ማነው እንዳንተ ያለ
 ምህረቱ ብዙ ኃይሉ የገነነ ማነው እንዳንተ ያለ

ስለዚህ ኃይልም ባለጠግነት
  ምስጋና ክብርም ብርታት በረከት
 በዙፋን ላለኸው ለአንተ ይድረስህ
 ለዘለዓለም ኢየሱስ አንተ ንገስ/2*

በላይ በዙፋን ብቻውን ያለ ማነው እንዳንተ ያለ
  ለፍቅር ብሎ መስቀል ላይ ዋለ ማነው እንዳንተ ያለ
 ሞትን ሲኦልን ድልን አድርጎ ማነው እንዳንተ ያለ
 የሚያቆም ማነው ምስኪን ከፍ አርጎ ማን ነው እንዳንተ ያለ
ስለዚህ..................

ብቻውን ሆኖ ታምራት ሠሪ ማነው እንዳንተ ያለ
 የሌለው አቻ ተወዳዳሪ ማነው እንዳንተ ያለ
 ሥራውም ፍጹም ቅዱስ የሆነ ማነው እንዳንተ ያለ
 በሰማይ በምድር ቃሉ የታመነ ማነው እንዳንተ ያለ
ስለዚህ..................

ጠላትን አልፎ ሰብሮ ቀዳሚ ማን ነው እንዳንተ ያለ
 የእምነት እራስ ትርጉም ፈጻሚ ማን ነው እንዳንተ ያለ
  በክብር ግርማ በኃይል የሚመጣ ማን ነው እንዳንተ ያለ
 እንባን አብሶ ነፃ የሚያወጣ ማን ነው እንዳንተ ያለ
ስለዚህ..................
',0),(NULL,'ሕይወት ሰላም የሆነልን','hebret14','ሕይወት ሰላም የሆነልን  እንደ ወይራ ያለመለመን
 ምህረቱ የማያልቅበት  ባለፀጋ የሁሉ አባት
 ኢየሱስ ነው መጠጊያችን  ኢየሱስ ነው ሰላማችን
 ኢየሱስ ነው የወደደን  ለዛሬው ቀን ያደረሰን

ለእግዚአብሔር ምን ምን እንመልሳለን ስላደረገልን
 በክብር ቦታ ሆኖ በክብር ስላየን ስላልናቀን
 ለዚህ ያደረሰን ወደደን የተዋረደውን አይንቅም
 ለደካማ ጣለለት ጉልበትን አትረፍርፎ ሰጠን ሰላምን

ሁሌ መሃሪ ነው ምህረትና ይቅርታን ይወዳል
 በደልን ሳይቆጥር እኛን በምህረቱ አስቦናል
 ነፍሳችን አትረሳው አምላኳን ኢየሱስ ነው ባለውለታዋ
በከፍታ ላይ ታዜማለች ይድረስላት ለእርሱ ምስጋናዋ

የሱስ በልባችን ሰላሙን እንደወንዝ አፍስሶታል
 የጥበቃው ብዛት ከስውር ፍላፃ ሰውሮናል
 የእስራኤል አምላክ አይተኛም መንጋውን ሌተቀን ይጠብቃል
 ነፍሱን ስለ በጎቹ የሰጠ እውነተኛ እረኛ ኢየሱስ ነው

ከማይቻል ቦታ ጌታ ኢየሱስ ችሎ አመለጥን
  አስቸጋሪውን ገደል ዳገት ቁልቁለቱን አሳለፈን
 በዛን ለመለምን በኢየሱስ ቅባታችን መንፈሱ ሆነን
 የነዳንኤል አምላክ የእኛም ነው ዛሬ በሰዎች ፊት ሞገስ ሰጠን
',0),(NULL,'ይሁን ያልከው ሁሉ','hebret15','ይሁን ያልከው ሁሉ ይሆንልሃል
 ማዕበል ወጀቡ ይታዘዝሃል
 ሙታንን ከመቃብር ሕያው ታደርጋለህ
 ኤልሻዳይ አምላክ ነህ የለም የሚሳንህ

ዛሬም ነገም… የሚሳንህ የለም/2*

እንዴት እናልፋለን እንዘላለን ቅጥሩን
 ብለው ሲጨነቁ እስራኤል ሲፈሩ
  ምንም አይሳንህ ኢየሱስ አንተ እኮ
 ቅጥሩ ፈራረሰ ወደቀ ኢያሪኮ

አራት ቀን አልአዛር መቃብር ቢቆይም
 የቀናቱ ብዛት እጅግ ቢያስቸግርም
 ድምጽህን ሰማና ወጣ ከመቃብር
 ሁሉን ቻይ አምላክ ነህ ክብር ለአንተ ይሁን

የሞትና የሲኦል መክፈቻ በእጅህ ነው
 ሞትን ድል አድርገህ በክብር ያረግከው
 ዳግም ተመልሰህ ልጆችህን ትወስዳለህ
 በምድር በሰማይ ብቻህን ትነግሳለህ
',0),(NULL,'ስምህ መጠጊያዬ','hebret15','ስምህ መጠጊያዬ ኢየሱስ ጌታዬ
 ከማንም ከምንም መሸሻ መዳኛዬ
 ከሁሉ የለየኝ መለያ አርማዬ
 በክፉ ዘመን ማረፊያ ጥላዬ  /2/

ስምህ መጠጊያዬ ኢየሱስ ጌታዬ
በክፉ ዘመን ማረፊያ ጥላዬ  

የሰው ልጅ በስጋት ይወጣል ይገባል
 በጭንቅ በመከራ በሐዘን ይኖራል
 ኢየሱስ የሰጠኸኝ ሰላሜ ብዙ ነው
  አንተ ነህ አምባዬ የሚያስፈራኝ ማን ነው?

ከብር ከዕንቁ ይልቅ ስምህ ይሻለኛል
 ቢኖረኝ ባይኖረኝ ሁሌ ደስ ይለኛል
 ስምህ መሸሻዬ መሰወሪያዬ ነው
 በሕይወቴ ዘመን መታመኛዬ ነው

ስለ ስምህ ሰዎች ሁሉ ቢጠሉኝም
  ዘመድ ወዳጆቼ ከእኔ ቢለዩኝም
 ለአንድ አፍታ እንኳን ኢየሱስ ሳትለየኝ
 ጥበቃ በዝቶልኝ እዚህ አደረሰኝ

በዚህ ክፉ ዘመን ሰው ዕረፍት ባጣበት
 ሁከትና አመጽ ክፋት በበዛበት
 እኔ ግን በሰላም ወጥቼ ገባለሁ
 ከቶ ሳልናወጥ በቤትህ ኖራለሁ
',0),(NULL,'ኢየሩሳሌም','hebret15','ኢየሩሳሌም /2* ውብ ከተማ
 የተስፋ ሀገሬ የእኔ መኖሪያ
 የአምላኬን ፊት የማይባት/2*
 
መኖርያዬ ኢየሩሳሌም ናት/2*    /2/

ለዚህ ምድር እንግዳ ነኝ
  በሰማይ ቤት መኖሪያ አለኝ
 ከአምላኬ ጋር ምኖርባት /2*
 ውብ አገሬ ኢየሩሳሌም ናት/2*

የደስታ የዝማሬ አገር
  እጓጓለሁ በዚያ ለመኖር
 ክፋት ተንኮል የሌለባት/2*
 የሰላም አገር ኢየሩሳሌም ናት/2*

ሐዘን ጭንቀት በዚያ የለም
  መዘመር ነው ለዘላለም
 ከበጉ ጋር ምነግስባት/2*
 ቅድስቲቷ ኢየሩሳሌም ናት/2*

ልብሳቸውን በበጉ ደም
 አጥበው ያነጹ ቅዱሳን
 ለዘላለም ሚኖሩባት/2*
 የተስፋ አገር ኢየሩሳሌም ናት/*

ብርሃኗ ኢየሱስ የሆነላት
 ሌተ ቀንም ሚያበራላት
 ጻድቃን በዚያ ሚጽናኑባት/2*
 የደስታ አገር ኢየሩሳሌም ናት/2*
',0),(NULL,'እስከዚህ ያደረስከኝ','hebret15','ኢየሱሴ እኔ ማን ነኝ?
 በክንፍህ ሸሽገኸኝ
  እስከ ዛሬ ያደረስከኝ እኔ ማን ነኝ /2/

በሐሩር በርሃ ምንጭ ያፈለክልኝ
 በምድረ በዳ ላይ መናን የመገብከኝ
 ክፉ እንዳይነካኝ ከቶም እንዳይጎዳኝ
 እንደ አይንህ ብሌን እኔ የጠበከኝ

በአለት ንቃቃት ጌታዬ ሰውርከኝ
 በክንፍህ ጥላ ሥር ኢየሱስ ሸሸከኝ
 እንደ ጠላት ሐሳብ ቢሆንማ ኖሮ
 እዚህ አልነበርኩም ጠፍቻለው ድሮ

በጦርነት ውጊያ ትጥቄ እንዳይፈታ
 አጽንተህ አቆምከኝ ኢየሱስ የእኔ ጌታ
በመከራዬ ቀን ጉልበቴ እንዳይላላ
 መጠጊያ ሆንክልኝ እንዳልሆን ተላላ

እኔ ከአንተ ጋር ነኝ ጽና በርታ ያልከኝ
 በድቅድቅ ጨለማ ብርሃን የሆንክልኝ
 የእስራኤል አምላክ ኢየሱስ አንተ ነህ
 የሚሳንህ የሌለህ ኤልሻዳይ አምላክ ነህ
',0),(NULL,'ይዘመርልህ በአደባባይህ','hebret15','ይዘመርልህ በአደባባይህ
 ገናናው ክብርህ ዛሬም ይታይ
 ከብረህ ታይ  ከብረህ ታይ  ከብረህ ታይ  
በበረከት ሸለቆ በጽዮን ላይ/2*  /2/

ክብርህ ይገለጥ ዛሬ እንደገና
 ይሰዋ ሕዝብህ የአፉን ምስጋና
  ይዘመር የሱስ በአንተ ቤት /2*
  ይስገዱልህ ኃያል ነገስታት/2*

የሕይወት ውሃ በጽዮን ይፍሰስ
 የተጠማች ነፍስ መጥታ ትፈወስ
 በእልልታ በአደባባይ/2*
 በዝማሬ ከፍ ብለህ ታይ/2*

ምድር ትናወጥ አህዛብም ይፍሩ
 በምስጋና ቃል አንተን ያክብሩህ
 ክበር ንገስ ለዘለአለም /2*
 እንዳንተ ያለ ቸር ወዳጅ የለም/2*

ምድር መርገጫህ ሰማይ ዙፋንህ
 የለም አምላኬ ለአንተ የሚሳንህ
  ኃይልህ ይውረድ ከሰማያት /2*
 ለአለም ይታይ ለፍጥረታት/2*
',0),(NULL,'ከሆንኩት በላይ እሆናለሁ','hebret15','ከሆንኩት በላይ እሆናለሁ
  ለአምላኬ ክብር ዘምራለሁ
 ሚልኮል ትሳቅብኝ በፊቱ ዘላለሁ
 ለኢየሱስ ክብር ይዋል እንጂ ክብሬን እጥላለሁ /2/

በጨለማ ሳለሁ ብርሃንን ሳላገኝ
 ስጨንቅ ስቸገር አይቶ ለራራልኝ
 ለነፍሴ እፎይታን እረፍትን ለሰጠኝ
 እኔ ሳልወደው ወዶ ለመረጠኝ

በአለም ስቅበዘበዝ አምላኬ አይቶኝ
 ከረግረግ ከጭቃ ከትቢያ ላነሳኝ
  እልልታ ዝማሬ ምስጋና አቀርባለሁ
 ከሆንኩትም ሁሉ በላይ እሆናለሁ

ሁሉን ለሚችለው ብቻውን ለሚኖር
 ለፍጥረታት ገዢ ለአንዱ እግዚአብሔር
 ብዘል ባሸበሽብ ለአምላኬ ብዘምር
 ይሄ አይበዛበትም ቢሆን ለእርሱ ክብር

ነፍሱን አሳልፎ የሱስ ሞቶልኛል
  እዳዬንም ደግሞ እርሱ ከፍሎልኛል
 ታዲያ ለዚህ አምላክ ምን ይከፈለዋል
 ምስጋና ውዳሴ ማቅረብ ይገባኛል
',0),(NULL,'ምንድነው የከበደህ','hebret15','ምንድነው የከበደህ
  ሸክም ሆኖ ያስቸገረህ
 ከአቅምህ በላይ ሆኖ ያስጨነቅህ
 የሚሳነው የለም ለአምላክህ ንገረው/2*
 ለጥያቄህ ሁሉ ኢየሱስ መልስ አለው/2*  /2/

ለአንተ የከበደውን ኢየሱስ ይችለዋል
 የልብህን ሐሳብ እርሱ ይመረምራል
 ለችግርህ ሁሉ መፍቴው ኢየሱስ ነው
 ምንም አይሳነው ኤልሻዳይ አምላክ ነው

አይንህን አንስተህ እርሱን ተመልከተው
  ጌታህ ኢየሱስን ሳትጠራጠረው
 እግዚአብሔር አምላክህ እርሱ ይረዳሃል
 ሳታስብ በድንገት ከተፍ ይልልሃል

አንዳንዴ በኑሮ ማዕበል ቢነሳብህ
 ዝም ብሎ ቢያይህ ኢየሱስ ሊታዘብህ
 አይዞህ አትረበሽ አምላክ ከጎንህ ነው
 ማዕበሉን ሊገስፅ ሙሉ ስልጣን ያለው

የፈተናው አይነት መልኩ እጅግ ቢበዛ
 አንዱን ሳትሻገር ሌላው ቢገጥምህም
 በትዕግስት ዝም ብለህ ጌታህን ጠብቀው
 ራሱ እስኪሰጥህ ሁሉንም በጊዜው

አንተ እንዳሰብከው ባይሳካልህም
 ቶሎ ሳይመለስ መልሱ ቢዘገይም
 ሁሉን ቻይነቱን አሸናፊነቱን
  አትጠራጠረው ኤልሻዳይነቱን
',0),(NULL,'ቤተክርስቲያኔ አረሳሽም','hebret15','ቤተክርስቲያኔ አረሳሽም አልተውሽም
 የቀረው ቀርቶብኝ አልለይሽም
  ከአንቺ ወዴትም አልሄድም /2/

ለነፍሴ ዕርካታ ኢየሱስ ሰጥቶኛል
 ፈውስና በረከት በአንቺ ሆኖልኛል
 ሰላምና ዕረፍት ሕይወት በዝቶልኛል
 ከዚህ የበለጠ ሌላ ምን ይገኛል

የእዚህ አለም መከራ ፈተና ቢበዛም
 አንቺን ከማገልገል ፊቴን አልመልስም
 ትምክህቴ ኩራቴ እኔ ምመካብሽ
 ከደስታዬ ሁሉ በላይ ቤተክርስቲያኔ ነሽ

በችግር በስቃይ ከቶ አልረሳሽም
 በምንም ፈተና እኔ አልዘነጋሽም
  ርቦኝ አበላሽኝ ጠምቶኝ አጠጣሽኝ
 እርስቴ አንቺው ነሽ እኔን ያሳደግሽኝ

በማግኘት በማጣት በክብር በውርደት
 ኢየሱስ ከጎኔ ነው አልፈራም እስከ ሞት
 ግብጽን ትቻታለሁ ወደ እሷ አልመለስም
 የቀረው ይቅርብኝ እኔ አልለይሽም
',0),(NULL,'አይቼሃለው ኢየሱስ አይቼሃለሁ','hebret15','አቤት በእውነትም ኢየሱስ አምላክ ነህ
 አቤት በእውነትም ኢየሱስ ጌታ ነህ
 ኃያል አምላክ ታላቅ ጌታ /2*
 በሰማይ በምድር የለህ የሚረታ/2*

አይቼሃለው ኢየሱስ አይቼሃለሁ
 አይቼሃለሁ አምላኬ አይቼሃለሁ
 የማይቻለውን ችለህ ስትሰራ
 ብርሃን ስታደርገው ድቅድቁን ጨለማ ሃሌሉያ /2/

አይቻልም ብዬ ደምድሜ የተውኩትን
 ሰርተህ አሳየኸኝ ግሩም ድንቅ አድርገህ
 በእውነትም ኢየሱስ የአማልክት አምላክ ነህ/2*
 ኃይልና ችሎታ ብርታት የተሞላህ /2*

እጅግ ታላቅ የሆነ ማዕበል ተነስቶ
 ልቤን ሲያናውጠው የሚረዳኝ ጠፍቶ
 ነቃህና ኢየሱስ ማዕበሉን ገሰፅኸው/2*
 እኔም የሚሳንህ እንደሌለ አየሁ/2*

በድል ላይ ድል የምትሰጥ የኃያላን ኃያል
 አንተ አምላኩ የሆነው እንደምን ታድሏል
 ብርሃን በሌለበት በተዘጋ ልብ ውስጥ/2*
 ስትል አይቻለሁ ሰላም ለእናንተ ይሁን/2*
',0),(NULL,'ኢየሱስ አንተ የዘላለም አምላኬ ነህ ','hebret15','ኢየሱስ አንተ የዘላለም አምላኬ ነህ
 መታመኛዬ ሁልጊዜ ለእኔ አንተ ነህ
  አንተም የእኔ ነህ እኔም ያንተ ሆኛለሁ
 ከመከራም ሥጋት ጌታ በአንተ አርፌአለሁ
ስለዚህም አንተን በፍጹም ልቤ ወድሃለሁ
በፍጹም ነፍሴ ወድሃለሁ
በፍጹም ሐሳቤ ወድሃለሁ
በፍጹም ኃይሌ ወድሃለሁ  /2/
በሰማይ በምድር እንዳንተ ያለ የለምና
 አመልክሃለሁ ለዘላለም አንተን ጌታ
 የሚከብደኝን ሸክም ሁሉ ከእኔ ላይ ወሰድክልኝ
 ምስጋናዬንም ላቅርብልህ ውለታህ አለብኝ

ዛሬ በእምነት አንተን ጌታዬ ሆይ ዳስሻለሁ
 ፊት ለፊት ቆሜ አንድ ቀን ግን አይሃለሁ
 ያን ጊዜ ድካሜ ሁሉ ለእኔ ይረሳና
 አከብርሃለሁ ፊትህ ቆሜ በምስጋና

በአንተ ምህረት ኢየሱስ በቤትህ ገብቻለሁ
 ለነፍሴ መዳን ከአንተ ዘንድ አግኝቻለሁ
 እኔ ከገመትኩት ካሰብኩት በላይ አርገህለኛል
 ፍቅርህ በውስጤ ገብቶ ኢየሱስ ለውጦኛል
',0),(NULL,'ስምህ ኢየሱስ ስምህ አምላኬ','hebret16','ስምህ ኢየሱስ ስምህ አምላኬ 
 ስምህ ኢየሱስ ስምህ
 ታምራትን ሰርቷል ስምህ ኢየሱስ
 ጠላትን አንቅጥቅጧል ስምህ ኢየሱስ
 ወጥመድንም ሰባብሯል ስምህ ኢየሱስ
 ጉልበትን አንበርክኩኣል ስምህ ኢየሱስ /2/

ሁሉን ቻዩ አምላክ ትልቁ ስምህ
 የጠላትን ሰፈር አስጨንቀልን
 ታወከ ሰራዊቱ ሰልፉ ተበተነበት
 ስምህ ሲጠራ ኢየሱስ በእኛ አንደበት

ሊቋቋም አልቻለም ሃይልና ግርማህን
በስም ውስጥ ያለው ጉልበት ችሎታህን
 መክበብንስ ከበበ እያገሳ በዙሪኣችን
 ግን አሸነፈልን ስምህ አምላካችን

ከቶ አንናወጥም ስምህን ይዘናል
የጸና ግንብና መጠጊያ ሆኖናል
 እስራታችንን ፈቶ ነጻ ያወጣን ስምህ ነው
 ዛሬም እንጠራዋለን መታመኛችን ነው

የዘንዶውን እራስ በባህር ቀጥቅጧል
የአስጨናቂውን ዘንግ ቀንበርን ሰባብሯል
 ክብርና ሞገሳችን ስምህ እኮ ነው ኢየሱስ
  ስብራታችንን ፈጥኖ የሚፈውስ
',0),(NULL,'ለእኔ የሚረባኝን ነገር','hebret16','ለእኔ የሚረባኝን ነገር የሚያስተምረኝ
 በምሄድባትም መንገድ ሁሌ የሚመራኝ
 እግዚአብሔር አምላኬ ሁሉን ቻይ ነውና
 ልሰዋ ለስሙ ክብርና ምስጋና /2/

ከሰው ሁሉ የተናቅኩ ኃጥያት የበዛብኝ
መሆኔንም አውቆ የሱስ አይተወኝም
ሸክሜን በሙሉ እርሱ ተሸክሟል
ለዚህ ሁሉ ውለታው ምስጋና ይግባዋል

ግራ ቀኜን አልለይ የምሄድበትን
ሚጠቅመኝን አላውቅ ወይ የሚጎዳኝን
በምድረበዳ ላይ ስቅበዘበዝ አይቶኝ
የሱስ በደሙ አጥቦ ልጁ አደረገኝ

በድንግዝግዝ ሕይወት ብርሃን ከሌለበት
በጣኦት አምልኮ ከመንከራተት
ቃሉን ግልፅ አድርጎ አስተማረኝና
በእውነት መንፈስ ልሰግድ ቆምኩኝ በምስጋና


ለሰው ቅን የምትመስል ፍፃሜዋ ሞት
ከጠማማ መንገድ ከሐሰት ትምህርት
ከዘላለም ቅጣት ከገሃነም እሳት
በወንጌሉ አዳነኝ በጽኑ መሰረት
',0),(NULL,'እረኛዬ የሱስ እረኛዬ','hebret16','እረኛዬ የሱስ እረኛዬ /2*
 እከተልሃለሁ ከኋላ
  አለህ ለእኔ መሰማሪያ
 መልካም እረኛ ነህ አውቃለሁ/2*
 ከኋላህ ከኋላህ እሮጣለሁ/2*  

የእሳት ቅጥር ሆነህ በዙሪያዬ
 ጠብቀኸኛል እረኛዬ
 ለአውሬ አሳልፈህ አልሰጠኸኝም/2*
 ከአንተ ጋር ኖራለሁ አልለይም/2*

እኔን ስትጠብቅ አይደክምህም
 ኢየሱሴ አይታክትህም
 ታማኝ ነህ እከተልሃለሁ/2*
 መልካም እረኛ ነህ አውቃለሁ/2*

አንተ ያልከው ሁሉ ይሆናል
 ምድረ በዳው ይለመልማል
 አልፈራም ሁሉን ትችላለህ/2*
 ኢየሱስ እውነተኛ እረኛ ነህ/2*

መንፈስህን በእኔ ላይ አፍስሰሃል
 ጥሜን ኢየሱስ አርክተሃል
 የማያቋርጥ የውሃ ወንዝ/2*
 ከሕይወቴ አፍልቀሃል በመታዘዝ/2*
',0),(NULL,'አያለሁ ገና አሜን','hebret16','አያለሁ ገና አሜን አያለሁ ገና/2* 
ኢየሱስ ከብሮ አሜን አያለሁ ገና/2* 
ስሙ ሲከብር ባይኔ አያለሁ ገና /2/

በምድር ዙሪያ ስሙ በክብር
  እየተጠራ ለእርሱ ሲዘመር
 አያለሁ ገና ኢየሱስ ከብሮ
 በአለም ዙሪያ አሜን ታምራት ሰርቶ

ጥንትም ለሙሴ የተናገረው
 እስራኤላውያንን በድል የመራው
 ፍጥረታት አውቀው አምላክነቱን
 አንዱ እግዚአብሔር እርሱ የሱስ መሆኑን

የአህዛብ አማልክት ተወግደው
 ጣኦቶቻቸው ሁሉ ከምድር ጠፍተው
 በአለም ዙሪያ ኢየሱስ ከብሮ
 አያለሁ ገና አሜን ከፍ ከፍ ብሎ

በባለሃምሳ ቀን መንፈሱ ወርዶ
 እንደተጠሩ ሶስት ሺ ነፍሳት
  ፍጥረታት ሁሉ ለእርሱ ሲሰግዱ
 ጌታን በክብር አሜን ከፍ ሲያደርጉ
',0),(NULL,'አለኝ የልቤን የሚረዳልኝ','hebret16','በዘላለም ፍቅር ወዶኛል ጌታዬ
 ላይጥለኝ ቃል ገብቶ አብሷል እንባዬን
 የሚያስፈራኝ የለም አምላክ አለኝ እኔ
 የልቤ የሚረዳ ማይጠፋ ከጎኔ

አለኝ የልቤን የሚረዳልኝ/2*
   አለኝ ጸሎቴን የሚሰማ/2*
 እስከ ጽዮን ድረስ አባቴ/2*
 ይንከባከበኛል መድሃኒቴ/2*

እውነተኛ አባት መኩሪያዬ ነውና
 ነፍሴን ያሳረፋት ከታላቅ መከራ
 የገባልኝን ቃል እስከ ጽዮን ሚጠብቅ
 የምታመንበት አለኝ የቅርብ ወዳጅ

በጠራሁት ጊዜ ፈጥኖ የሚረዳኝ
 ጸሎቴን ሚሰማ እኔስ አምላክ አለኝ
 አልጠራጠርም ሁሉን በመቻሉ
 እንደሰው አይደለም ታማኝ ነው በቃሉ

ተስፋ ያደረኩት በሕይወት ዘመኔ
 ለኑሮዬ ትርጉም ደስታ ነው ለነፍሴ
 በመውጣት መግባቴ ሁሌ ይጠብቀኛል
 እንደ አይኑ ብሌን ይንከባከበኛል
',0),(NULL,'እንደቀድሞ ሕይወቴን አድስ','hebret16','እንደቀድሞ ሕይወቴን አድስ/2*
 ጌታ ኢየሱስ ሆይ ዛሬም በእኔ ንገስ

ገና ስትጠራኝ ወደ እቅፍህ ጉያ ና ብለህ
 ስታሳውቀኝ የፍቅርህን ጣዕም 2*
 በደስታ ምስጋና እንደሰባ እንቦሳ
 የፈነጨሁበት ዘመኔ ዛሬ እስኪ ይነሳ

እስከሞት ድረስ መታመን ስራዬ እንዲሆን
 ይሁን ብያለሁ ያኔ ከጅማሬ /2*
 ዘንግቼ እንዳልሆን የጥንቱን ቃል ኪዳን
 ይታደስ ጉልበቴ አይላላ  ያስከብር ስምህን

ሊሞቱም ያሉት የቀሩትን ነገሮቼን
 አጽናልኝ የሱስ ልቁምም በርትቼ/2*
 አለማስተዋልም ሆኖብኝ እንቅፋት
 እንዳይጥለኝ ዛሬ ቀይረው ድካሜን በብርታት

ብርሃን በርቶልኝ ልቤን አስፍተህው በቃልህ
 የጨለማን ስልጣን ከእግሬ ስር ጥለሃል/2*
 ተስፋ እንደሌለው ሰው እንደአቅመቢስ
 እንዳልመላለስ አድሰው ኃይሌን በአንተ መንፈስ
',0),(NULL,'ከመንፈስህ ወዴት እሄዳለሁ','hebret16','ከመንፈስህ ወዴት እሄዳለሁ
  ከፊትህስ ወደ ማን እሸሻለሁ
 አንተ አንተ እግዚአብሔር ነህ
  ባህር ምድርን ሰማይን የሞላህ/2*
 እንዳንተ ፍቅር የለም እንደ አንተ
 እንዳንተ ሰላም የለም እንደ አንተ
 እንዳንተ ሩህሩህ የለም እንደ አንተ
 እንዳንተ ሚሆን የለም እንደ አንተ

 ፍቅር ደስታ በቤትህ በእቅፍህ ያለው
 መባረክም እርካታ መዘመር ባንተ ነው
 ሰላምህም አለም እንደሚሰጠው አይደለም
 ሞልቶ ተርፎ ከአእምሮ ከአሰቡት በላይ ነው/2*

አባቴ ነህ ቁልፉ ሁሉ በእጅህ ነው
 የሚሳንህ የሚያቅትህ ላንተ ምንድነው
 ቤትህ ዘውትር የተወደደ ሚናፈቅ
 ምንጭህ ኢየሱስ የማያልቅ የማይደርቅ/2*

የሕይወት ቃል ከአፍህ ጣፋጭ ምክር አለህ
 ከሞት ወደ ሕይወት ታሪክን ትለውጣለህ
 ማንም ሊያይው በማይቻል ብርሃን ውስጥ አለህ
 ጌታ አምላኬ ጨለማዬን ታበራለህ/2*

ለአለም ሁሉ ሲገለጥ ሰውን መውደድህ
 ከምንም በላይ ራስህን ሰጥተህ አሳልፈህ
 በፍቅር በፍርሃት በፈቃዴ ልገዛልህ
 ከአንተ ልማር ሰላም እረፍቴን ታበዛለህ/2*
',0),(NULL,'የኤርትራን ባህር ክንድህ ከፈለልን','hebret16','ቃልህን ላክልኝ እንድፈወስበት
 ጨለማዬ በርቶ እንድጓዝ በእውነት
 ከሞትም ፍርሃት ነፃ አወጣኸን
 በብዙ በረከት በድንቅ ተስፋ መራኸን

የኤርትራን ባህር ክንድህ ከፈለልኝ
 በደረቅ ምድረበዳ መና ነው ያበላኝ
 ጌታ እግዚአብሔር ዛሬም አምላኬ ነህ
 በሰማይ በምድር የሚመስል የሌለህ
 ጌታ እግዚአብሔር ዛሬም አምላኬ ነህ
 ክንደ ብርቱ አምላክ የሚመስል የሌለህ

ከአለቱ ውሃ ፈልቆ ጠጥቻለሁ
 መናን እለት እለት ወርዶ በልቻለሁ
 አልጎደለብኝም ደግሞም ሰላም አለኝ
  ስምህን ስጠራው ብርታት ሆኖ ሚያቆመኝ

እንዳንተ ያለ ማን ነው በሰማይ በምድር
 በውን ሥራህ መስክሯል በብዙ ተአምር
  ዛሬ እዘምራለሁ  ቸርነት ምህረትህን
  ከአማልክትም በላይ አምላክ ኢየሱስ መሆንህን

መልካምነትህን ሁሉ ቀምሻለሁ
 ክንድህ ድጋፍ ሆኖኝ በቤትህ ኖራለሁ
 የዘንዶውን እራስ በባህር የቀጠቀጥህ
 የአስፈሪውን ዛቻ ተዋግተህ ያስቅረህ

በሌሊት በእሳት ቀን በደመና አምድ
 መርተኸኛል ኢየሱስ በእውነተኛ መንገድ
  በሰላም ከተማ በስምህ ጥበቃ ውስጥ
 መኖር አርክቶኛል ከአንተ ጋር ኢየሱስ
',0),(NULL,'ኢየሩሳሌም ሆይ ብረሳሽ','hebret16','ኢየሩሳሌም ሆይ ብረሳሽ ቀኜ ትርሳኝ
 ብረሳሽ ባላስብሽ
 ከደስታዬ ሁሉ በላይ አንቺን ባልወድ /2/

የወንጌልን ምስጥር ፍቹን እያስረዳሽ
 ቃሉን እየመገብሽ በሥርዐት ኮትኩተሽ
 አሳድገሽኛል ቤተክርስቲያኔ
 አልወድም ልለይሽ ምቹ ነሽ ለእኔ

 ከጨለማው አለም ባንቺ ተለይቼ
 የአምላኬን ሕጉን በውስጥሽ ሰምቼ
 ዛሬም ያለ ሥጋት በእምነት ቆሜአለሁ
 ሰላምና ዕረፍት ደስታን አግንቻለሁ

ኢየሱስ በቃሉ እንደተናገረው
 መቶ እጥፍ በምድር ያገኛል አንዳለው
 እናትና አባት እህት ወንድሞቼ
  ባንቺ አትርፌአለሁ

በፈረሰው ቅጥርሽ በጸሎት ከልቤ
  ጠላት እንዳይጎዳሽ ዙሪያሽን ከብቤ
 ሐሜት ጥል ክርክር ሳይታይ በውስጥሽ
  ልኖር እወዳለሁ እያገለገልኩሽ
',0),(NULL,'ክብሬ ትዋርድ ዝቅ ልበል','hebret16','ክብሬ ትዋርድ ዝቅ ልበል
 ኢየሱስ አምላኬ ከፍ ከፍ በል
 እኔ ላንስ አንተ ልትልቅ ያስፈልጋል
 የጌቶች ጌታ ነህ መንገስ መክበር ይገባሃል /2/

በሰማይ በምድር ሁሉ ሥልጣን ያለህ
  መወደስ መፈራት መክበር የሚገባህ
  ኢየሱስ አምላኬ የሆንከው ገናና
 ከልቤ ልባርክህ ነፍሴ ላንተ ትቅና

እኔ ዝቅ ብዬ ራሴን አዋርጄ
 በቤትህ ኖራለሁ ሥጋዬንም ክጄ
 በመንገዴ ሁሉ ከምንም በላይ
 ኢየሱስ አንተ ብቻ ከፍ ብለህ ታይ

ለሥጋዬ ዝናን ክብርን ከማትረፍ
 መስቀሌን ልሸከም ለስምህ ልነቀፍ
 ክብሬና ማረጌ ባንተ ነው ጌታዬ
 ከእግርህ ሥር ልኑር የሱስ ነህ ምርጫዬ

በዘመኔ ይታይ ኢየሱስ ታምራትህ
 ሥጋዬ ተዋርዶ ይብዛልኝ ባርኮትህ
  የተናቀውንም ከፍ ታደርገዋለህ
  ከአፈር ከትቢያ አንተ ታነሳለህ
',0),(NULL,'አኑረኝ','hebret17','አኑረኝ/3* የሱስ ሆይ አኑረኝ
 አኑረኝ/3* በእቅፍህ አኑረኝ
 አኑረኝ/3* በቤትህ አኑረኝ
 አኑረኝ/3 በጥላህ አኑረኝ
  ሁሉም እንደጥላ እንደጤዛ ያልፋል
 ከአንተ ጋር መኖሩ ለእኔ እጅግ ጠቅሞኛል
 ሁሉም ነገር እንደጢስ እንደጉም ይበናል
 በእቅፍህ መኖሩ ምቾት ሆኖልኛል

ተመችተኸኛል ተደላድያለሁ
 ሰላምና ዕረፍት ከአንተ አግንቻለሁ
 አሁንም አኑረኝ ዘላለም በእቅፍህ
 የሚያልፈው እንዳይጥለኝ አደራህን ባክህ/2*

ምንም ባይመቸኝ ባይደላኝ ይህ ዓለም
 መኖር ደስታዬ ነው ከአንተ ጋር ዘላለም
 ኢየሱስ ጌታዬ ዘወትር አምላኬ ነህ
  ማግኘቴ ማጣቴ ከእኔም የማያርቅህ
 አኑረኝ ዘላለም አምላኬ በእቅፍህ

ከአለም ደስታ ምቾት ከዝና ከክብር
 አንቱ ከመባልም በሚያልፈው ነገር
 በቤትህ ተጥዬ መኖር ይሻለኛል
 የዓለም ዝና ክብር ወዴት ያደርሰኛል
 በዚች ጠፊ ምድር ውጦ ያስቀረኛል

በቤትህ ከኖርኩኝ በዕቅፍህ ካለሁኝ
 እራስ እንጂ ጅራት መች እሆናለሁኝ
 አንተን በማመኔ ደግሞም በማምለኬ
 ተጠቀምኩኝ እንጅ ምንተጎዳሁ እኔ
 ሕይወት ከነትርፉ ሆንክልኝ ጌታዬ
',0),(NULL,'የተፈታሁበት ታላቅ ስምህ ይንገስ','hebret17','የተፈታሁበት ታላቅ ስምህ ይንገስ
የዳንኩበት ስምህ ኢየሱስ ይቀደስ
ሥልጣን ያገኝሁበት ኃይልን የያዘው ስምህ
ይባረክ ለዘላለም አሜን ብሩክ ይሁን /2/
ስጠራው ፈውስ ሆኗል ለአጥንቴ ጠገን
  አጽንቶታል ስምህ ቁርጭምጭሚቴን
 ኢየሱስ ስለ ስምህ ታምራት ሰርተሃል
 በሁሉ ላይ ሥልጣን ያለው ስምህ ከብሯል

የኃያላን ኃያል የጌቶች ጌታ ነህ
 በስምህ ኢየሱስ ድንቅን ታደርጋለህ
 ለሰው የተሰጠ የሚያድን ስምህ
  ሌላ የለምና ብቻውን ይግነን

ነፍሴን ከሲኦል አፍ ነጥቆ ሚያወጣልኝ
 ሥጋዬን በተስፋ ሚያሳድርልኝ
 ፈውስና በረከት ከአንተ ሚያመጣልኝ
 የተለየሁበት ስምህ ይክበርልኝ

ጠላቴን አሳዶ በጥልቅ ሚጥለው
 ጌታ ኢየሱስ ስምህ ከስሞች በላይ ነው
 እኔም በነፃነት የምመላለሰው
 ባገኘሁት ስልጣን በስምህ ኃይል ነው
',0),(NULL,'እንሄዳለን','hebret17','ሰማይ እንደጢስ ተና ስትበን
 ምድር እንደጨርቅ ስታረጅ
 ከምድር ዳርቻ እስከ ዳርቻ
 ሲሰበሰቡ ልጆቹ ብቻ

እንሄዳለን/4* ኢየሱስን እናያለን
 እንሄዳለን/4*
  እዚሁ ዘምረን መች እንቀራለን

ገና እዚያም ሄደን እንቀጥላለን
 እዚሁ ዘምረን መች እንቀራለን
 ከመላዕክቱ ጋር አምረን ደምቀን
 በእጃችን እኛም ዘንባባ ይዘን

በክብሩ ውበት ኢየሱስ ሲመጣ
 የናቀው ሁሉ መግቢያውን ሲያጣ
 እኛ ግን በደስታ እላይ ሰማይ
 እንሄዳለን ኢየሱስን ልናይ

ፀሃይ ያን ጊዜ ስትጨልም
  ሲወድቁ ደግሞ ከዋክብትም
 እርስት ያለን እኛ በውቧ ከተማ
 ይወስደናል ኢየሱስ እዚያ ልንጽናና

ያኔ ሲናወጡ የሰማይ ኃይላት
 ሲነፋ ደግሞ ድንገት መለከት
 እንለወጥና በቅጽበት ኃይል
 እዚያም ልንዘምር እንሄዳለን
',0),(NULL,'ተቤዥቼሃለሁ','hebret17','ተቤዥቼሃለሁ አትፍራ ሕዝቤ ሆይ
 ወድጄሃለሁኝ ከልብህ እመነኝ
 በውሃ ውስጥ ብታልፍ  እንኳን ከቶ አያሰጥምህም
 በእሳት ውስጥ ብትሄድም አያቃጥልህም
 የፈተናው አይነት ማዕበሉ ለጊዜው ቢያስፈራራህም
 እኔ ከአንተ ጋር ነኝ ሕዝቤ ሆይ
 ከቶ አልተውህም

አለም ሳይፈጠር ያኔ አስቀድሞ አወኩህ
 በማህፀን ሳለህ ለራሴ ለይቼ መረጥሁህ
 የሞት ዕዳህንም በመስቀል ከፍዬ
 እንዴት ተውሃለሁ እያየው ችግርህን በአይኔ

አንተ አልመረጥከኝም እኔ ግን መረጥሁህ
 አንተ አልወደድከኝም እኔ ግን ወደድኩህ
 ከሞት ከባርነት ከግዞት አውጥቼ
 ልጠቀምብህ ነው አይደለም ልጥልህ

ተስፋ አትቁረጥ ፍጹም እኔ ከአንተ ጋር ነኝ
 የረገጥከውን ምድር አወርስሃለሁኝ
 ለአብርሃም የማልኩትን መሃላ እፈጽመዋለሁ
 ዘርህን እንደ ምድር አሸዋ እጅግ አበዛለሁ

በኃጥያት ተፈርዶብህ ወድቀህ ስቃይህን አይቼ
 አዲስ ልብስን አለበስኩህ በደልህን አንስቼ
 በሰማይም ስፍራ ቤት አዘጋጅቼልሃለሁ
 አንድ ቀን ልወስድህ በክብር እመጣለሁ
',0),(NULL,'እንባዬን ከአይኔ አብሶ','hebret17','እንባዬን ከአይኔ አብሶ
  የደስታን ዘይት የቀባኝ እርሱ አምላኬ ነው
  የሐዘኔን ማቅ ቀዳዶ
  በሙሉ ደስታ ያስታጠቀኝ እርሱ አምላኬ ነው
 ጸሎቴን ሰምቶ የመለሰልኝ
 ታላቅ ነው እርሱ ኢየሱስ
  ምስጋና አለኝ አሜን ይመስገንልኝ

የአፌን ቃል ሰምቶ የራራልኝ ጌታ
 አይተወኝም ለአስጨነቀኝ እስራቴንም ፈታ
 ኃይሉን አያሳይቶኛል ከሁሉ በላይ ነው
 ከእሱ ሌላ አምላክ የለም ኢየሱስ ብቻ አምላክ ነው

ለኢየሱስ ማይገዛ ምንም ነገር የለም
  ሁሉን ሲያዝ አይቻለሁ ቃሉንም ሲፈጽም
 የረዳኝን ኢየሱስ ዘውትር አከብራለሁ
 ለአዳነኝ ለዚህ ጌታ እገዛለታለሁ

ክፉ የምላቸው ዘመናት አለፉ
 ሊጥሉኝ ያንገዳገዱኝ ነበር የተሰለፉ
  የአምላኬ የኢየሱስ ግርማ አስፈራቸው
 የስሙ ክብርና ኃይል ከፊቴ በተናቸው

በጠላቴ እራስ ላይ እግሬን በድል አራመደ
  በበላዬ የቆሙትን ጥሎ አዋረደ
 እኔን ግን በታምር በድንቅ እየመራ
 ጨለማዬንም ሁሉ በብርሃን አበራ
',0),(NULL,'የፈጠርኩትን ሳይሆን የፈጠረኝን','hebret17','የፈጠርኩትን ሳይሆን የፈጠረኝን
  አመልከዋለሁ በአምሳሉ የሰራኝን
 የፈጠረኝን ሳይሆን የፈጠርኩትን
 እኔ አላመልክም በእጄ የሠራሁትን

ከምድር አፈር ያበጀኝን
 እጅግ ተጠንቅቆ የፈጠረኝን
 በእስትንፋስ ሕይወት የሰጠኝን
 አመልከዋለሁ ጌታ ኢየሱስን

በአምሳሉ ፈጥሮ የወደደኝን
 ስለ እኔ ብሎ የሞተልኝን
 በክቡር ደሙ የገዛኝን
 አመልከዋለው በእጁ የሠራኝን

በእጄ ቀጥቅጬ ያሳመርኩትን
 የምሸከመው የማይሸከመኝን
 ከቶ ማይሰማ ማያየውን
  እኔ አላመልክም የሰው እጅ ሥራን

በክንዴ ኃይል የሰራሁትን
  ምግብ አብስዬ የምበላበትን
 ተመልሼ እዛው አምላኬ ምለው
 አይደለም ፍጹም እኔ የማመልከው
',0),(NULL,'እንደ ቃልህ ኢየሱስ','hebret17','እንደ ቃልህ ኢየሱስ እንደ ቃል ኪዳንህ
 አስባት ኢትዮጵያን ሕዝቧ ለአንተ ይሁን /2/

ጎብኝ እግዚአብሔር ኢትዮጵያውያንን
 አስብ እንደ ቃልህ ይህች ምድራችንን
 ልብን ሁሉ ለውጥ በቃልህ ብርሃን
  ቃልኪዳንህ ይከበር አሁን በዚህ ዘመን

ነፍሳት ይሰብሰቡ አምላክ ነህ ይበሉ
 የማያልቅብህን መዳን ይታደሉ
 ፍጹም በረከትን ሰላምንም ሁሉ
 ሁሉን ከምትችል ከአንተ ያገኛሉ

ሰማይና ምድርን በቃልህ ያጸናህ
  ጠፈር ይሁን ብለህ ወሰን የዘርጋህ
  ብርሃንን አዘህ ጨለማን የረታህ
 ኢየሱስ የእኛ አምላክ እየን እንደቃልህ

ጉልበት ሁሉ ይንበርከክ እንደ ቃል ኪዳንህ
 አንደበትም ይጥራህ ይመካ በስምህ
 እጆችም ይዘርጉ ወደ አንተ ለክብርህ
 አስባት ኢትዮጵያን ጌታ በፈቃድህ
',0),(NULL,'ገና እናያለን በአይናችን','hebret17','ገና እናያለን በአይናችን /2*
 ድንቃ ድንቅ ሲሰራ የሱስ አምላካችን

የምድር ነገስታት ኃያል ነን የሚሉ
  ታላላቆችና ታናናሾች ሁሉ
  ክብራቸውን ጥለው ለእርሱ ሲሰግዱለት
 እናያለን በአንድነት ኢየሱስን ሲያከብሩት

ዛሬ በአይናችን እኛ የምናየው
 ገና የመንገዱ መጀመሪያ እኮ ነው
 ከዚህ የሚበልጥ ነገር አምላካችን ሠርቶ
 እናያለን ገና ክብሩ ምድርን ሞልቶ

ምርኮአችንም ሁሉ ተመልሶልን
 እንባንም ከአይናችን የሱስ አብሶልን
 የሐዋርያት አምላክ ታምራት ሲሰራ
 እናያለን ቤቱን ሲያቆም በተራራ

ከጉባኤው ርቀው በሐዘን ያሉትን
 ከጽዮንም ሆነው የተበተኑትን
  ሰብስቦ አጽናንቶ በደስታ ሞልቶአቸው
 ሲመጡ እናያለን ኢየሱስ ማርኮአቸው
',0),(NULL,'በቤትህ በረከት የባረከኝ','hebret17','በቤትህ በረከት የባረከኝ
  አፌንም በምስጋና የሞላህልኝ
 ኃይሌን እንደ ንስር ያደስክልኝ
 ጌታዬ ኢየሱስ  ንገስልኝ
 ኃይሌን እንደንስር ያደስክልኝ
ጌታዬ ኢየሱስ ክበርልኝ   

በፍቅርህ ማርከኽኝ ጌታ በመውደድህ
 በቀራንዮ መስቀል ደምህን አፈሰስክህ
 በእውነት ቃልህም አስበህ ያዳንከኝ
 ድካሜን በኃይልህ አንተ ለወጥክልኝ

መባረክን ባርከህ ማስተዋል ሰጥኸኝ
 በከበረው ሥፍራ በቤትህ አስቀመጥከኝ
 ተሸክመኸኛል አጽንተህ በቃልህ
 ምስጋናና ክብር ለአንተ ይሁንልህ

በጠላቴ እራስ ላይ በድል አጫምተኸኝ
 እባብና ጊንጡን እረግጥ ቆምኩኝ
 የልጅነት ሥልጣን ከአንተ ወርሻለሁ
 በዘመኔ ሁሉ ለአንተ እገዛለሁ

ይሁን ያልከው ሁሉ ሆኖ አይቻለሁ
ተራራ ውጣ ውረዱ በአንተ አልፌአለሁ
ለኔ ያላረከው ጌታ ምን አለና
አንተ ብቻ ክበር ዛሬም እንደገና
',0),(NULL,'ከአባት ጉያ ኮብልለህ','hebret17','ከአባት ጉያ ኮብልለህ
 በረከት ሰላምን ጥለህ
 ወደ አለም ለምን ትሄዳለህ
 ለመጥፋት ለምን ትሻለህ
 ወንድሜ ሆይ ዛሬ ልምከርህ ልንገርህ
 የለም ሌላ ፍጹም እንደ ኢየሱስ ከለላ
 እህቴ ሆይ ዛሬ ልምከርሽ ልንገርሽ
 የለም ሌላ ፍጹም እንደ ኢየሱስ ከለላ

ወንድሜ ናና ተመለስ
  ነጩን ልብስህን አታርክስ
  ላታገኝ  ሩህሩህ እንደ ኢየሱስ
  ወደ አለም ፊትህን አትመልስ
 ዛሬም እግዚአብሔር መሃሪ ነው
 ፍቅሩ ምህረቱ ወሰን የለው
 እጁን ዘርግቶ ይጠራሃል
 ናልኝ ልጄ ሆይ ይልሃል

በአባትህ ቤት ስንቶች ናቸው
 ጠግበው የሚያድሩ ተርፎአቸው
 አንተ ግን ወደ አለም ኮብልለህ
 በመንፈስ ረሃብ ተጎዳህ
 ና ይላል ኢየሱስ ይጣራል
  ሕይወት እስከ ትርፉ ይሰጣል
 ዛሬም ጥሪውን ባትጥል
 ሩህሩህ ነው ኢየሱስ የሚምር
',0),(NULL,'እርኩሱም ወደፊት ይርከስ','hebret17','እርኩሱም ወደፊት ይርከስ
 አመጸኛውም ያመጽ
 አንተ ግን የእግዚአብሔር ሕዝብ ሆይ
  ከዚህ ሁሉ ሽሽ እራቅ ተለይ /2/

የራስህ አይደለህም ገዝቶሃል በደሙ
 በፈቃድህ እንዳትሄድ ማህተም አለብህ ስሙ
 ስለዚህ ከጨለማ ሥራ ጋር አትተባበር
 የጠራህም አምላክ ቅዱስ ነው እግዚአብሔር

የተመረጠ ትውልድ እንዳንተ ማን አለ
  ለርስቱ የለየህ በጉያው የያዘህ
 ስትወጣም ስትገባም አስብ ኢየሱስን
 በአሕዛብ መካከል ኑሮህ መልካም ይሁን

ከግብጽ ባርነት ለይቶ አውጥቶሃል
 ጽዮንን ሊያውርስህ ቃልም ገብቶልሃል
 አምላክህን ፍራ ከእርሱም ጋር ተጣበቅ
 ከከንቱ ንግግር እራስህን ጠብቅ

ጌታህን ለመምሰል እራስህን አስለምድ
 ለአፍህ ጠባቂ አምላክህን አድርግ
 በሁለንተናህ ላይ ኢየሱስን ሹም
 ቅድስናህ ያብብ እርሱን ብቻ አክብር
',0),(NULL,'ዝቅ ልበል በፊትህ አምላኬ','hebret18','ዝቅ ልበል በፊትህ አምላኬ
 ላመስግንህ ዘወትር ተንበርክኬ
 ተራራውን ሜዳ ታደርጋለህ/2*
 አምንሃለሁ ኢየሱስ ሁሉን ቻይ ነህ/2*

ለእኔ ከብዶ ያስቸገረኝ ሸክሜን
 አቀርባለሁ ፊትህ ልመናዬን
 እራሴንም ዝቅ ዝቅ አድርጌ
 እኖራለሁ ከእግርህ ሥር ሆኜ

ማድጋዬ ባዶ ቢመስለኝም
 ዙሪያው ገደል መስሎ ቢታየኝም
 ዓይኖቼንም ወደ አንተ አነሳለሁ
 ተስፋዬ ነህ ስትሰራ አያለሁ

ጠላት ከቦኝ ሊያጠፋኝ ቢጥርም
 ደምህ አለኝ ጋሻ እሚሆንልኝ
 አያለሁኝ ወጥመዱ ሲሰበር
 ተራራዬም ሜዳ ሲሆንልኝ

ሐማ እኔን ሊያጠፋኝ ቢጥርም
 ተስፋ ያጣሁ ለእኔ ቢመስለኝም
 ጽህፈቱን ኢየሱስ ገለበጥከው
 ጠላቴንም ፈጥነህ አዋረድከው
',0),(NULL,'ማን አለ እንደ ኢየሱሴ','hebret18','ማን አለ እንደ ኢየሱሴ ማን አለ እንደ አምላኬ? /2/
ሲሰራ የሌለው አቻ ኤልሻዳይ ኢየሱስ ብቻ /2/

የአስጨናቂውንም ዘንግ ሰብሮ
 ያጎበጠኝን ቀንበር ጥሎ
  ቀና አልኩኝ  ይኸው ተፈትቼ
 የእርሱ ባረገኝ ድል ነስቼ  /2/

ሊያሰጥመኝ ያለውን ያን ማዕበል
 ሲናገርበት በሥልጣን ቃል
 ጸጥ አለ ቀረ መታወኬ
 እጄን ሲይዘኝ ጌታ አምላኬ /2/

ስለ እኔ ቀድሞ እየተዋጋ
  ጠላቴን ያለው አላስጠጋ
 ወደ እርሱ ሮጬም  አመለጥኩኝ
 ድል የእግዚአብሔር ነው እኔ አየሁኝ /2/

ቆሞ አበረታኝ የእኔ ጌታ
  ቅጥሩን ዘለልኩኝ በእርሱ እርዳታ
 ስጠራው ደርሶ ያለኝ አቤት
 አለኝ አምላክ የታምንኩበት
',0),(NULL,'ዝንጉ ሰው በፊትህ አይገባም','hebret18','ዝንጉ ሰው በፊትህ አይገባም /3/
 እኔም ተስፋ አድርጌ እንደ አብርሃም
 መጓዝ ነው ምርጫዬ ከአንተ ጋር
 እኔም ተቀድሼ እንደ ማርያም
 መኖር ነው ምኞቴ ከአንተ ጋር

ነፍሴ ደስ ይበልሽ ብዪ ጠጪ
  እስካለሽም ድረስ ተደሰቺ
 እያሉ መዝናናት አያዋጣም
 ኢየሱስ ሲመጣ ምክንያት አይሰራም /2/

ተሰናክያለሁ በወንድሜ
 ከቶ አልተመቸኝም ለሕይወቴ
 ብሎ መፍረድና መጠላላት
  አያስገባም ፍጹም መንግስተ ሰማያት /2/

እንደ እኔ ያለ ብርቱ ኧረ ማነው?
 አምላኩን የሚፈራ የሚያከብረው
 ብሎ መታበይም አያዋጣም
  ይልቅ ዝቅ ማለት ያስፈልጋል በጣም /2/

ከሁሉ ከሁሉ የሚበልጠው
 ለነፍሳችን መዳን የሚሆነው
 በተሰበረ ልብ ስንቀርበው
 ያን ጊዜ ነው ኢየሱስ እጅግ ደስ የሚለው /2/
',0),(NULL,'እቀደስ ዘንድ እፈልጋለሁ','hebret18','እቀደስ ዘንድ እፈልጋለሁ
  ሕይወቴን ኢየሱስ ሰጥቼሃለሁ
 ቀድሰኝ፤ ቀድሰኝ ኢየሱስ ሆይ ቀድሰኝ
 ቀድሰኝ፤ ቀድሰኝ በፈቃድህ ምራኝ አሜን

አንደበቴ ጽድቅህን ይናገር ዘውትር የምስራቹን ያውራ
 ቀድሰኝና ምስክርህ ልሁን ኢየሱሴ ለሰራኸው ሥራ
 የማትከብርበትን ከሕይወቴ አውጣና በጽድቅህ ሕያው አድርገኝ
 በቤትህ ውስጥ ተክለህ አለምልመህ አላማህን ፈጽምብኝ

ተጠርቻለሁ ጌታዬ በስምህ እንግዲህ የአንተ ሆኛለሁ
 በፊትህ አለሁ ያሻህን አድርገኝ ሕይወቴን ለአንተ ሰጥቻለሁ
 ቅድስና ያብብ በእኔ ላይ ታጋሽም አድርገኝ ጌታዬ
 ልቤም ኢየሱስ ዙፋንህ ይሁንና ላንግስህ በሁለንተናዬ

ፍለጋህን ልከተል አምላኬ አንተን እየመሰልኩኝ ልኑር
 ከኃጥያት ልራቅ ፈቃድህን ላድርግ በውስጤ አኑር የእውነትን ፍቅር
 ሥጋዬንም እየጎሰምኩኝ እንዳስገዛው ኃይልን ስጠኝ
 ደስ የሚያሰኝህን እየመረመርኩኝ እንዳደርግ ደግፈኝ እርዳኝ

የሥጋዬን ፍሬ አውጣልኝና ሙላኝ የመንፈስህን ፍሬ
 የእኔ አይደለሁም በደምህ ተገዝቼአለሁኝ ላንተው ነው መኖሬ
 ቃልህንም ሰምቼ ልፈጽም እንድወድህ ኢየሱስ እርዳኝ
 ቀዳሼና የእስራኤል ቅዱስ እባክህ ቀርበህ ቀድሰኝ
',0),(NULL,'ካስፈለኩህ ከጠቀምኩህ','hebret18','ካስፈለኩህ ከጠቀምኩህ
  እንካ ተረከብ ውሰደው ጉልበቴን
 ተጠቀምበት መላው ሕይወቴን

አገልግለኝ ብለህ ከመረጥከኝማ
 በል ተጠቀምብኝ ላሰብከው አላማ
 ማልጠቅምህ ባሪያ ነኝ አውቃለሁ እራሴን/2*
 አንደበቴ ትብ ነው ኮልታፋ ምላሴ/2*

አላውቅበት እኔ መጸለይ መማለድ
 እንዴት እንደምጓዝ ኢየሱስ በአንተ ፈቃድ
 ጉድለቴን እያየህ እንደምን መረጥከኝ/ጠራኸኝ/2*
 ይኸው መጥቻለሁ እንደ ወደድክ አርገኝ/2*

ተጉዤ ነበረ በራሴ ሐሳብ መርከብ
 ኮብልዬ ለመኖር እንደራሴ ፈቃድ
 እጅህ ከሲኦል ሆድ ከጥልቁ አወጣችኝ/2*
  ድሮስ ምህረትህ መቼ ለቀቀችኝ/2*

 ኧረ ምን ይባላል እንዲህ ያለ ነገር
 ንጉሥ እያለልህ እረኛውን ስትመርጥ
 በሜዳ የምውል በለስ ለቃሚ ነኝ/2*
 ግራ ቀኜን እንኳን ማወቅ የሚያቅተኝ/2*
',0),(NULL,'ከእልፍ የተመረጠ ከእንቁ የከበረ','hebret18','ከእልፍ የተመረጠ ከእንቁ የከበረ
  ውዴ የሚወደኝ በዙፋኑ ያለ
  ሰዎች የሚጠሉት በልቤ ግን አድሮአል
  አጥብቄ ይዘዋለው ነፍሴን አድኖኣታል 2*

ሰዎች የሚጠሉት ምንም ሳይረዱት
       የህይወት ማፍለቂያ ጌታን መድሃኒት
       ደዌው ያደቀቀው እራሱን ሰውቶ
       የሞትን ሃይል ውጧል በመስቀል ላይ ሞቶ 2*

ለኔ ግን ክቡር ነው የሳሮን አበባ
   ወደ ተቀደሰው ወደ ክብሩ የገባ
   እጅግ የከበረ ለኔ እድል ፋንታዬ
   ኢየሱስ ብቻ ነው ፈዋሹ ጌታዬ 2*
                
ያዳነኝ እርሱ ነው ከረግረጉ ጥፋት
   ከሲኦል ያወጣን ነፍሴን የወደዳት
   ሃዘን የሚያስረሳ ሰቆቃን የሚያርቅ
   ችግረኛን ያያል ደካማውን ሳይንቅ 2*

ያም ያልፋል ይህም ያልፋል ያልፋል እንደጥላ
 ሁሉም ከንቱ ናቸው የዚህ አለም ተድላ
  ያለኝን በሙሉ በእርሱ ላይ ጥያለሁ
   ሌላ አያሻኝም ውዴን መርጫለሁ  2*
',0),(NULL,'በቀናኢነቱ እግዚአብሔር ሊሠራ','hebret18','ተነስቷል እግዚአብሔር ክንዱን ሊያንቀሳቅስ
 ብዙዎችን ለጽድቅ ከሞት ለመመለስ
 ተነሳ ተነሺ ተነሱ ወገኖች 
ወንጌል ለመመስከር ሳንታክት ሳንሰለች

በቀናኢነቱ እግዚአብሔር ሊሠራ
 ኃይሉን አነሳስቷል ነፍሳትን ሊጠራ
 መጠቀሚያው እቃ የራሱ ካረገን
 እኛም እንነሳ መንፈሱን ተሞልተን

ብዙዎችን ለጽድቅ የሚጠሩ ሁሉ
 አምረው እንደ ከዋክብት ፈክተው ይደምቃሉ
 በጊዜውም ቢሆን አለጊዜው ስበክ
 ብዙዎችን ታደግ ቃሉን እያስተማርክ

ሰዎች ሳይረዱ ስለ አምላክነቱ
 በሚመስል መንገድ ስንቶች ተሳሳቱ
 ለሚጠፉ ነፍሳት ተጠያቂ እንዳንሆን
 ተነሱ እንነሳ እናሳውቅ ወንጌሉን

አንዱን አይሁዳዊ አስር ነፍሳት ይዘው
 ሲመጡ እናያለን እውነትን ተሞልተው
 በታላቁ ክንዱ እግዚአብሔር ሲሰራ
 እኛም እንነሳ ከአምላካችን ጋራ

የከበረ ወንጌል የመዳን ቁልፍ ይዘን
 እስከ ምድር ዳርቻ መስበክ ግድ አለብን
 ሰው በልቡ አምኖ በአፉ ባይመሰክር
  ድኛለሁ ለማለት አይችልም ሊናገር
',0),(NULL,'መኖርያዬ የዘላለም አምላክ ነው','hebret18','መኖርያዬ የዘላለም አምላክ ነው
 ከበታቹ ተማምኜ እኖራለሁ
 ደረቁ እንኳን በእርሱ እንደሚለመልም አውቃለሁ
 ሁሉ የእርሱ በሆነው በኢየሱስ ታምኛለሁ
 ለምን እፈራለሁ
 ለምን /3*  እፈራለሁ… ኢየሱስን ይዣለሁ
 ለምን/3*  እሰጋለሁ… ለምን እፈራለሁ

ደረቅ በሆነው ምድረ በዳ
  ሰላምና እረፍት ደግሞም ደስታ
 የሚሰጠን ታሪክ የሚለውጥ
 አለ ከእኔ ጋር የሕይወቴ ንጋት /2/

ለምለም ነው የእኔ መሰማርያ
 መልካም ነው ኢየሱስ የእኔ እረኛ
 ሁሉንም ማድረግ ይችላል
 ሐሳቡንም ማን ይከለክላል /2/

እጁ ሙሉ ነው የእኔ ጌታ
  ልጆቹን አንዳች አያሳጣ
 ታምኜ በኢየሱስ ብኖር
 አበድራለሁ እንጂ አልበደር /2/

ዘመን ዘመናትን ሲተኩ
  ጊዜያት እየገፉ ሲሄዱ
 ወደ አንተ እጠጋለሁ ይበልጥ
 ምንም ነገር ሲመጣ አልናወጥ /2/

',0),(NULL,'ሞኝነት አይደለም እሱን መከተሌ','hebret18','ሞኝነት አይደለም እሱን መከተሌ
 ሕይወት ነው ሰላም ነው አርፌአለሁ እኔ/2*

እርሱን መከተሌ ሞኝ ቢያስመስለኝም
 እንደ እኔ የቀመሰው ነው የሚረዳኝን
 ፍቅር አስገድዶት ከዙፋኑ የወረደ
  ማንም የለ እንደ ኢየሱስ እኔ የወደደ
 ፍቅር ነው/3* ኢየሱስ ፍቅሩን አይቻለሁ

 ምህረቱን አይቼ ስለተገረምኩኝ
 ይበልጥ እንድጠጋው እንድቀርብ አረገኝ
 አልለቀውም ፍጹም ኢየሱስ አድኖኛል
 ሕይወቱን ሰውቶ ሕይወትን ሰጥቶኛል
 ሕይወት ነው/3* ኢየሱስ ሕይወት አግንቻለሁ

 ተቅበዥባዥነቴ ከእንግዲህ ቀረልኝ
 በኢየሱስ በአምላኬ አረፍኩ እፎይ አልኩኝ
 ሰላሙ እንደ ወንዝ በሕይወቴ ፈሶ
 ድኜ ቀረሁ ይኸው ቁስሌ ተፈውሶ
 ሰላም ነው/3* ኢየሱስ ሰላም አግንቻለሁ

ያደረገልኝን ቆጥሬም አልዘልቅም
 ምንም ብዘረዝር ብተርክለትም
 ኧረ እኔስ ቸገረኝ እንዴትስ ላክብረው
 ዝም ከምል እንጂ ምስጋናም ሲያንሰው ነው
 ምስጋና/3* ለኢየሱስ ለዚህ ክብር ንጉስ

ሞኝነት አይደለም እሱን መከተሌ
 ሕይወት ነው ሰላም ነው አርፌአለሁ እኔ/2*
 ሕይወት ነው/3* ኢየሱስ ሕይወት አግኝቻለሁ
 ሰላም ነው/3* ኢየሱስ ሰላም አግኝቻለሁ
 ፍቅር ነው /3* ኢየሱስ ፍቅሩን አይቻለሁ
',0),(NULL,'ዘምበል ብሎ እስኪጎበኘኝ','hebret18','ዘምበል ብሎ እስኪጎበኘኝ
 ኢየሱስን እጠብቃለሁ
ዘምበል ብሎ እስኪጎበኘኝ
 ኢየሱስን እጠብቃለሁ
የሚመልስልኝን እሰማለሁ /2/

እግዚአብሔር በተስፋ ለምትጠብቀውም ነፍስ መልካም ነው
 ምህረቱ የበዛ እንዴት ቸርና ሩህሩህ አባት ነው
 ባለፀጋና የነገስታትም ሁሉ ንጉስ
 ጠብቄ አገኛለሁ ፍሬውን ከአምላኬ በለስ

ባዘዘው ትዕዛዝ ከማደሪያውም እርሱ እስኪነቃ
 እታገሳለሁ ክረምቱ እስኪያልፍ ሌቱ እስኪነቃ
 እስከሚያቅላላ ብርቱውን ትግል እታገላለሁ
 ጠዋት ማለዳ በረከቴንም እቀበላለሁ

ቆይቼ ደጁን እጠናለሁኝ ዘንበልም ይላል
 ጩኸቴን ሰምቶ አምላኬ በሩን ይከፍትልኛል
 እኔ ካሰብኩት ከለመንኩትም እጅግ አብልጦ
 ያደርግልኛል ኢየሱስ አባቴ ከልቡ ራርቶ

በእምባ በጸሎት በፊቱ አብዝቼ እለምናለሁ
 ዝም አይልም ኢየሱስ ደግሞ አይዘገይም ይህን አውቃለሁ
 ክርክሬንም የሰማ ጌታ ይፈቅድልኛል
 ቅን ፍርድን ፈርዶ በደስታ ዛሬ ይመልስልኛል
',0),(NULL,'ሰላም ለአንተ ይሁን','hebret18','በተዘጋ ቤት ውስጥ ጨለማው በበዛ/2*
 ብቻዬ ቁጭ ብዬ በሐዘን በሰቆቃ/2*
 ኃያል ክንዱን ቆርጦ የብረቱን መወርወሪያ/2*
 ሰላም ይሁን ያለ መጣ የሰላም ጌታ/2*
 
ሰላም ለአንተ ይሁን ሰላም ለአንተ ልጄ
 ሰላም ለአንቺ ይሁን ሰላም ለአንቺ ልጄ
 ብሎ ኢየሱስ ገብቶ ፈወሰው ሕይወቴን/2*
 የሰላም አለቃ ሰላምን ሰጠኝ ምስጋና ይድረሰው/2*
 ማቄን ቀዳዶ ደስታ አስታጠቀኝ ክብር ለእርሱ ይሁን/2*

ዙሪያዬን ከበቡኝ ከሳሽ ጠላቶቼ/2*
 በድንጋይ ሊወግሩኝ ያለ ርህራሄ/2*
 እንደ ጽድቁ ፈርዶ ኢየሱስ አዳነኝ/2*
 በሰላም ሂጂ ብሎ በነፃ ለቀቀኝ/2*

ቀራጭ ኃጥያተኛ መሆኔን እያየ/2*
 ይህ የሰላም አምላክ እኔን ወደደ/2*
 ዛሬ ከአንተ/አንቺ ጋር ነኝ ብሎ ተናገረ/2*
 ወደ ልቤ አዳራሽ ሊገባ ፈቀደ/2*

ኃዘንና ለቅሶ ከሕይወቴ ርቋል/2*
 የሰላሙን ካባ ጌታ አጎናጽፎኛል/2*
 የእስራኤል ንጉስ ኢየሱስ በእኔ ነግሷል/2*
 በቤቴም በደጄም ሰላም ብቻ ሆኗል/2*
',0),(NULL,'ለአንተ ጌታ ኢየሱስ','bebereya','ዘውትር ጠዋት ማታ ክብር ሰጥሃለሁ
 መልካም ነህ ለሕይወቴ በአንተ ረክቻለሁ
 አይመስለኝም ነበር ለዚህ የምበቃ
 አደረክ ኢየሱስ ለአንተ የምተጋ

ለአንተ ጌታ ኢየሱስ ለክብርህ ዘምራለሁ
 ለአንተ ጌታ ኢየሱስ ለክብርህ እሰግዳለሁ
 ለአንተ ጌታ ኢየሱስ ለክብርህ እልል እላለሁ
 ለአንተ ጌታ ኢየሱስ ለክብርህ አሸበሽባለሁ
     በአማልክት ሁሉ ላይ ሥልጣን አለህ
     በክብር ከፍ ከፍ ያልክ አንድ አምላክ ነህ
     ከፍ በል /4*

ብቻህን በሰማይ ሰማይ ትኖራለህ
 ፍጥረታትን ሁሉ በኃይል ትገዛለህ
 ክብር ይገባሃል አንተን አከብራለሁ
 ታላቅ ነህ ጌታዬ ተመስገን እላለሁ

ስላደረክልኝ ስለ ብዙ ውለታህ
 አይሰለቸኝ ለአንተ ብዘምር በእልልታ
 ታሪኬን ለውጠህ በአንተ አምሮብኛል
 ከጉድፍ አንስተህ ለዚህ አብቅተኸኛል

ድንቅ ነህ ኢየሱስ ግሩም ስም ይዘሃል
 ሥልጣን የአንተ ነው ልትከብር ይገባሃል
 በቃልህ እውነተኛ ታማኝ ለልጆችህ
 አወቅኩህ ጌታዬ አንተ ብቻህን ነህ
',0),(NULL,'አደራ የሕይወት መንገዴን አደራ','bebereya','አደራ የሕይወት መንገዴን አደራ/2*
 ዘይትህን ሙላው ዘውትር በመቅረዜ
 በፊትህ ይመርልኝ ጌታ አረማመዴ  /2/

ክበርብኝ ኢየሱስ ዘውትር በመንገዴ
 ሁንልኝ አምላኬ ከፊቴ ሁልጊዜ
 አንተን ተከትዬ እኔም እንድጓዝ
 አደራህ ኢየሱስ ከእኔ ጋር ተጓዝ

ጥቃቅን ቀበሮን አጥምደህ ያዝልኝ
 ለሕይወት መንገዴ እንቅፋት እንዳይሆነኝ
 እንዳላሳዝንህ መንገዴን አደራ
 ለእኔስ ይሻለኛል መጓዝ ከአንተ ጋራ

መንገዴን ለአንተ አደራ እሰጣለሁ
 በጉዞዬ ሁሉ ተስፋ አደርግሃለሁ
 አካሄዴ ይመር ዘወትር  በፊትህ
 ይፈጸም በሕይወቴ ኢየሱስ ፈቃድህ

እርምጃዬን ሁሉ ለአንተ ክብር ይሁን
 እንዳሻህ አድርገህ ሥራኝ አደራህን
 የመንፈስህ ዘይት በሕይወቴ ይብዛልኝ
 አሳምር ኢየሱስ ዘውትር አካሄዴን
',0),(NULL,'ይታደስ ይታደስ ሕይወቴ','bebereya','ፍጠርልኝ ጌታ ንጹህ ልብ ያማረ
 የተስተካከለ በቃልህ የነጠረ
 የቀናውን መንፈስ በውስጤ አድስልኝ
 ሁልጊዜ በሕይወቴ አንተ እንድታየኝ

ይታደስ ይታደስ ሕይወቴ ይታደስ
 ዘይትህ በእኔ ላይ ጌታዬ ሆይ ይፍሰስ
 ይታደስ ይታደስ ጉልበቴ ይታደስ
 መንፈስህ በእኔ ላይ ጌታ ኢየሱስ ይፍሰስ

የቀደመው ፍቅሬ ለአንተ የነበረኝ
 ሚያዘምር ሚያናግር የሚያስመሰክረኝ
 ዛሬም ይንቀሳቀስ ይናገር ክብርህን
 እንደ ጥንቱ ዘመን ላውጅ ምህረትህን

በመንፈስህ እሳት አምላኬ ለውጠኝ
 ጣፋጩን በረከት አሁንም አብዛልኝ
 በሕይወቴ ግባ በእኔ ተጠቀም
 የደረቀው ሕይወቴ በመንፈስህ ይለምልም

ለወንድም ለእህቴ የነበረኝ ፍቅር
 ሕብረት አንድነቴ የሕይወት ትስስር
 ዳብሮ ከበፊቱ ማየትን እሻለሁ
 እንደ አሮን ሽቶ እንዲሆን እመኛለሁ

መሰራት አለብኝ መታደስ በመንፈስ
 ጸንቼ እንድቆም እስክትመጣ ድረስ
 ሕይወቴ በመንፈስ እሳት ተቀጣጥሎ
 ማራናታ ልበል እንድትመጣ ቶሎ
',0),(NULL,'አለኝ ምስጋና','bebereya','ያረክልኝን መቼው አልረሳው
 ከሕይወቴ ጋራ ቁርኝት አለው
 በሕይወቴ ላይ ታምር ሰርተኸሃል
 ምከፍልህ የለም ሁሉ ተችሎሃል

አለኝ ምስጋና/2* አለኝ ምስጋና
    አለኝ ክብር /2* ለአንተ ክብር  /2/

ኢየሱስ ጨለማዬ አብርተህልኛል
 ከሰይጣን እስር አላቀኸኛል
  ኢየሱስ ለነፍሴ ብዙ ውለሃል
 ያደረክልኝ ከቁጥር ያልፋል

ለክፋት ለኃጥያት ከመገዛት
  ለሰይጣን ጣኦት ከመሰዋት
 ለየኸኝ ለአንተ እንዳጥንልህ
 በሕይወቴ ላይ ድንቅ አድርገህ

እጅህ ልትረዳኝ  ፈጥና ደርሳለች
 ነፍሴም ደስ ብሏት ታከብርሃለች
 በእጥፍ አርገህ ሰላም ሰጠኸኝ
 በብዙ ደስታ ፍቅርህ በዛልኝ
',0),(NULL,'ላመስግነው ዛሬ በመቅደሱ','bebereya','ላመስግነው ዛሬም በመቅደሱ
 ከፍ ላርገው በአደባባዮቹ
 ያደረገልኝን ተአምራቱ /2*
   አወራለሁ ኤልሻዳይነቱ/2* 2

በጠራሁት ጊዜ ኢየሱስ ሰማኝ
 ከመቅደሱ ሆኖ ተመለከተኝ
 ከጥፋትም ጉድጓድ ከረግረጉ ጭቃ
 አወጣኝ አማልኬ ልሆን የክብሩ እቃ

ኃይሉን እንዲያስታውቅ ስለ ስሙ አዳነኝ
 የኤርትራን ባህር ከፍሎ አሻገረኝ
 በድቅድቅ ጨለማ ብርሃን ሆነልኝ
 የሰማዩን መና ሕያው ቃል መገበኝ

ሕይወቱ ሰውቶ ሕይወትን ሰጥቶኛል
 በክቡር ደሙ ገዝቶ ልጁ አድርጎኛል
 ለእኔ ያለውን ፍቅሩን ተረድቼዋለው
 ላመስግነው ሌላ ምን እከፍለዋለው

የእግዚአብሔርን ሥራ በጎነት ያያችሁ
 ከጨለማው አለም የተላቀቃችሁ
 ከታላቅ መከራ ጭንቅ ያመለጣችሁ
 አመስግኑት የእርሱ ምስክሮች ናችሁ
',0),(NULL,'በዘመኔ ሁሉ ሐሳብህን','bebereya','በዘመኔ ሁሉ ሐሳብህን ኢየሱስ አገልግዬ
 ሩጫዬን ጨርሼ መልካሙንም ገድል ተጋድዬ
 በቅድስናና በፍቅር በቤትህ ውስጥ ኖሬ
 ማለፍን እሻለሁ ስምህን በምድር ላይ አስከብሬ
    ስምህን በምድር ላይ አስከብሬ
    በቅድስና በፍቅር ኖሬ
    ወደ ወገኖቼ ሳልሰበሰብ
    ላገልግልህ ኢየሱስ የአንተን ሐሳብ

በዘመኔ ሁሉ ሐሳብህን አገለግላለሁ አላማህን
 መሆኔ ካልቀረ የአንተ ዕቃ መሳሪያ አድርገኝ መገልገያ
 በዘመኔ ፈቃድህ ይፈጸም በሥራዬ ኢየሱስ አንተ ክበር

ዳዊት በዘመኑ ሐሳብህን አገልግሎ አለፈ አላማህን
 እኔም እንደ ዳዊት ልሁንና ላገልግልህ አንተን በምስጋና
 ልትጋ መስቀሌንም ተሸክሜ ጸንቼ ልቁም እስከ ፍጻሜ

አለሙም ምኞቱም ሁሉ ያልፋሉ ከምድር ጋር አብረው ይጠፋሉ
 እርዳኝ እኔም ፈቃድህን ልከተል እንድቀበል ከአንተ የጽድቅ አክሊል
 አይኔ በሚያየው እንዳይረታ እንዳይወድ የዚህን አለም ደስታ

 ሩጫዬን ጨርሼ እንደ ቃልህ ትግሉ ተጋድዬ ላስደስትህ
 ቅድስና በሕይወቴ አብቦ በሞገስህ ዙሪያዬ ተከቦ
 ይሁን ያልከው በሕይወቴ ሆኖ ላይ እሻለሁ ስምህ በእኔ ገኖ
',0),(NULL,'ከጥንትም የነበረው','bebereya','በክንዱ ኃይል የሚተማመን
  እንደ እግዚአብሔር ብርቱ የሚሆን
 ይነሣ ያውራ እስቲ ይናገር
 እኔ ነኝ የሚል በሰማይ በምድር

የለም ማንም የለም ኢየሱስ ነው ዘላለም/2*
 ከጥንት የነበረው አምላክህ እግዚአብሔር አንድ ነው
 በልብህ እንደ ክታብ እሰረው
 በአይኖችህ መሃል ይሁንልህ
እርሱ ብቻውን ነው አምልከው/2*
ተስፋን ጨብጦ የተሰለፈ
 በጠላቱ ፊት በክብር ያለፈ
 አንድ ነው ይላል ሳይጠራጠር
 በአምላኩ ወንጌል በቃሉ ሳያፍር

እንዴት ምስጉን ነው ጽድቅ የታደለ
 በእግዚአብሔር ብቻ ጽድቅ ኃይል አለ
 እርሱን እመነው በአምላክነቱ
 ልብህ ይቅናለት ለአንድነቱ

አንድ መንጋ አለ አንድ እረኛ
 አንድ ፈራጅ ነው የእውነት ዳኛ
 መንገድ ሕይወትም ኢየሱስ እሱ ነው
 ያለ ጥርጥር በእምነት ኃይል አለው
',0),(NULL,'እናያለን በእምነት እናያለን','bebereya','የተስፋን ቃል የሰጠው እርሱ የታመነ ነው
 ፍጹም የማይከዳ የታመነ አምላክ ነው
 ኢየሱስን ተስፋ አርጎ ያፈረ ሰው የለም
 ከአፉ ለወጣው ቃል የሚተጋ አምላክ ነው

እናያለን በእምነት እናያለን/2*
 ዛሬ ለእኛ ከብዶ ተራራ የሆነብን
 ነገ ኢየሱስ ንዶት ሜዳ ሲሆንልን
 ቅጥሩን አዘልሎ እናያለን ኢየሱስ
 በምድር ላይ ከብሮ

ለአብርሃም እግዚአብሔር ቃል ኪዳን ገባለት
 ዘርህን አበዛለሁ እንደሰማይ ከዋክብት
 አብርሃምም አምኖ አምላኩን ጠበቀው
 እንደ ቃል ኪዳኑ ይስሐቅን ሰጠው

ሩት ስትወጣ ብላ ኑአሚን
 አምላክሽ አምላኬ ሕዝብሽ ሕዝቤ ይሁን
 ያመለክሺው አምላክ መቼ አሳፈራት
 የንጉሱ ዳዊት አረጋት ቅድም አያት

ሐማ በክፋቱ አይሁድን ለማጥፋት
አዋጅ ቢያሳትምም በንጉሥ ቀለበት
የአስቴር ልመናዋ ወደ እግዚአብሔር ሲደርስ
ሐማ ተዋረደ ሲከብር መርዶክዮስ

በእውነት ለሚጠሩት ኢየሱስ ቅርብ ነው
ምህረቱ የበዛ ቸር የሆነ አምላክ ነው
አምነው ለጠየቁት ለቀረቡትማ
ተአምራቱን ሰርቶ ያስደስታል ጌታ
',0),(NULL,'ምን ልስጥህ','bebereya','በሞትህ ሞቴን ሻርክ በከፈልከው ዋጋ
 በፈሰሰው ደምህ ለእኔ ስትወጋ
  እመላለሳለሁ ያለ ሥጋት ዛሬ
 በስምህ ጥላ ሥር በዕረፍት አድሬ

ምን ልስጥህ ምኔን ላቅርብልህ
  ኢየሱሴ በምን ላስደስትህ
 ይህ ነው ምስጋናዬ
 ይህ ነው አምልኮዬ
 ይህ ነው ዝማሬዬ
  ሌላማ ምን አለኝ ጌታዬ /2/

በተዋረደ ልብ ከእግሮችህ ሥር
 ዛሬም ዝቅ ልበል ልንበረከክልህ
 ለእኔ እንደዋልክልኝ እንደውለታህ
 ይገባኛል እኔም ላመሰግንህ

ምን ይዤ ልምጣና ኢየሱስ ላስደስትህ
 ምንድነው ሚያስነሳህ አንተን ከዙፋንህ
 ምስጋናዬ አርጎ ከአርያም ይድረስ
 ኢየሱስ ሆይ በፊትህ ዛሬም ነፍሴን ላፍስስ

ቃሌ አንተን ይጣፍጥህ ልዘምርልህ
 ለስምህ የሚገባ ክብር ላመጣልህ
 አንተን ካስደሰተህ ምስጋና አምልኮዬ
 ክብር እሰጥሃለሁ እኔ ክብሬን ጥዬ

',0),(NULL,'ጻድቃን ሰማዕታት የሚዘምሩባት','bebereya','
ጻድቃን ሰማዕታት የሚዘምሩባት/2/
 የመላዕክት ዜማ ሁሌ የሚሰማባት/2/
 የተስፋ አገሬ ኢየሩሳሌም ናት/2/
 ቀን ሌሊት በሐሳቤ ዘውትር የምመኛት/2/

ታላቅና ረጅም ሰፊ ቅጥር ያላት
 ብርሃኗም በጉ ነው ሁሌ የሚያብራላት
 የቤቱ መሰረት ሐዋርያት ናቸው
 በመሰረቷ ላይ ተጽፏል ስማቸው

አስራ ሁለት ደጆቿ በእንቁ ተሰርተዋል
 ክርስቶስ ኢየሱስ መቅደሷ ሆኗታል
 ፀሐይም ጨረቃም አያስፈልጓትም
 የእግዚአብሔር ክብር ነው ብርሃን መብራቷ

አህዛብ በውስጧ ይመላለሳሉ
 የምድር ነገስታት ክብርን ያመጣሉ
 ውሸትና እርኩሰት ፍጹም የለባትም
 አመፃና ትዕቢት ከቶ አይገባባትም

እኔም እነ አብርሃምን ከሩቅ ተመልክቼ
 ለመድረስ ወሰንኩኝ ከልቤ ጓጉቼ
  ይህቺ አለም ከንቱ መሆኗን ስላወኩ
 በአምላኬ እርዳታ እደርሳለሁ ካመንኩ

መራብ መጠማትም መታመም መታረዝ
 መድከም መሰልቸትም በሐሳብ መናወጥ
  በኢየሩሳሌም ውስጥ ይሄ ሁሉ የለም
 ምስጋና ብቻ ነው እስከ ዘለዓለም
',0),(NULL,'መልካም ጋብቻ','wedding1','መልካም ጋብቻ ትዳር ኑሮ ይሁንልህ/2*
 ኢየሱስ ለዘላለም የሚከብርበት
 ተድላና ሰላም ፍቅር በረከት የሞላበት

ዕድሜዋን ሁሉ መልካም የምታደርግ
 ቢኖራት ባይኖራት ሁሌ የምትደሰት
 በኑሮዋ ዘወትር ሰላም የምታወራ
 ትሁንልህ እህት ኢየሱስ የባረካት/2*

ሚስቱን የሚወድ እንደራሱ አድርጎ
 በአንድ ልብ በአንድ ሐሳብ የሚኖር ተስማምቶ
 ፍቅርን ዘወትር ላንቺ የማይነፍግሽ
 ኢየሱስ የባረከው ወንድም ይሁንልሽ/2*

በአገልግሎታችሁ ዘወትር የምትተጉ
 በሕይወት በኑሮአችሁ ጌታን የምታከብሩ
 በመልካም ምሳሌነት ሁሌ የምትጠሩ
 ኢየሱስ የከበረበት ይሁን ትዳራችሁ/2*

የሰላም ትዳር እንዲሆንላችሁ
 የኢየሱስ ፍቅር ዘውትር ይቅረባችሁ
 በአንድ ልብ በአንድ ሐሳብ ሁሌ እንድናያችሁ
 መልካም ጋብቻ ኢየሱስ ያድርግላችሁ
 መልካም ትዳር ኑሮ ኢየሱስ ያደርግላችሁ
',0),(NULL,'እግዚአብሔር ብቸኝነትን ስላልወደደ','wedding1','እግዚአብሔር ብቸኝነትን ስላልወደደ
 ከሠራው ሰው አጥንትን ወሰደ
 በጥበቡ ሴት አድርጎ ሠራት/2*
 እንድትሆነው ለአዳም ለሕይወቱ ረዳት/2*

አዳምም አይቶ ወደዳት
 አብራው እንድትሆን ወሰዳት
 እግዚአብሔርም ባረካቸው/2*
 በፍጥረት ሁሉ ላይ ሾማቸው/2*

በችግርም አብረው ጸኑ
 በደስታም አንድ ሆኑ
 አዳምም አብሯት ጸና/2*
 የእግዚአብሔር ስጦታ ናትና/2*

ዛሬም ይህ ትውልድ ቢታዘዝ
 ጌታን ቢጠይቅ ቢታገስ
 የእርሱ ምርጫ በረከት ነው/2*
 ለሕይወት ዘመን ሚበጀው/2*

በሚገጥመው ረዳት ሆናው
 በፈተናው ምታግዘው
 በሰው ምርጫ አትገኝም/2*
 በኢየሱስ ፈቃድ ግን አትጠፋም/2*
',0),(NULL,'ክቡር ነው ጋብቻ','wedding1','
ክቡር ነው ጋብቻ/3*
 ጋብቻ ክቡር ነው /2*
 እግዚአብሔር የሚገኝበት በረከቱን የሚያዝበት
 ክቡር ነው ጋብቻ ክቡር ነው
 መፋታት የሌለበት አንድ ሥጋ የሚሆንበት

የጋብቻ ምስጢር በደንብ የገባችሁ
  በቃሉ መሰረት ለመሄድ የወሰናችሁ
 ሐሴት አድርጉ ደስ ይበላችሁ
 ጌታ ኢየሱስ ይገኛል በመካከላችሁ

የኢየሱስን ፈቃድ ለይቶ ለማወቅ
 ከርኩሰት ድርጊት ራስን ለመጠበቅ
 በትዕግሥት ጉዞ እዚህ ደረሳችሁ
 በጋብቻችሁ ላይ ይክበር አምላካችሁ

በፍቅር ተሞልቶ ቤታችሁ እንዲሰራ
 ጸንታችሁ በመቆም በሕብረት በጋራ
 በቅዱስ ኑሮአችሁ ምሳሌ እንድትሆኑ
 በምስጋና ሕይወት ዘውትር እንድትጸኑ

የከበረው አምላክ ጋብቻ ያከብራል
 ጉድለቱን ለመሙላት ጌታችን ይገኛል
 ደስ ይበላችሁ ሐሴት አድርጉ
 በረከት ለመውሰድ እጃችሁን ዘርጉ

',0),(NULL,'ታላቅ ቤተሰብ ጌታን የሚያስከብር','wedding1','ታላቅ ቤተሰብ ጌታን የሚያስከብር
 ከርኩሰት የነፃ ተባርኮ የሚኖር
 በጎ አገልጋዮች አድርጎ ያጽናችሁ
 የመስቀሉ ፍቅር ይኑር በልባችሁ

ዛሬ በኢየሱስ ቤት በእግዚአብሔር ሕዝብ ፊት
 የተሳሰራችሁ በፍቅር በአንድነት
 መርጦ በመንፈሱ አንድ ያደረጋችሁ
 እንደ ቃሉ ትዕዛዝ ኑሩ ተባብራችሁ

በእግዚአብሔር ቤት በአደባባዩ ላይ
 በጻድቃን ጉባኤ ከፍ ብሎ
 ታላቅ አደራ ነው ዛሬ ጋብቻችሁ
 እስከ መጨረሻው ፍቅሩን ያብዛላችሁ

ከሁለት ጀምሮ ነው ኢየሱስ የሚገኘው
 ሊባርክህ ሊቀድስህ ቃል ኪዳን የገባው
 በመንፈስ አብሮአችሁ እርሱ ስለሚገኝ
 ፍቅራችሁ አይላላ በእናንተ ደስ ይሰኝ

እንዲበዛላችሁ የእግዚአብሔር ሥራ
 ጥሪያችሁንም ተወጡ በጋራ
 የሥጋን ጥያቄ በመንፈስ ክዳችሁ
 ጌታን አገልግሉት ስለመረጣችሁ
',0),(NULL,'ጋብቻ ክቡር ቅዱስ ነው','wedding1','አንቺ እህታችን እልፍ አእላፍ ሁኚ/አሜን ሁኚ
 ዘርሽ የጣላቶችሽን ደጅ ይውረስ/አሜን ይውረስ
 አንተ ወንድማችን እልፍ አእላፍ ሁን/አሜን ሁን
 ዘርህ የጠላቶችህን ደጅ ይውረስ/ አሜን ይውረስ
 አሜን ይውረስ/4*2

ጋብቻ ክቡር ቅዱስ ነው/4*
 የእግዚአብሔር ልጆች በረከት የአምላክ ሰጦታ ነው

በእግዚአብሔር ቤት እርሱን ለማገልገል
 በሕይወት ጎዳና ኢየሱስን ለማክበር
 መተሳሰር መርጧል ከአንድ ይልቅ ሁለትን
 በመሃከል ሊገኝ ቃልኪዳን ሰጠን

በጽዮን ከፍታ እንደ እግዚአብሔር ፈቃድ
 መኖር እንድትችሉ በእግዚአብሔር ፍቅር
 ዘወትር ታደሱ በወንጌሉ ቃል
 ለአህዛብ በረከት ያደርጋችኋል

ከዚህ ቀን ጀምሮ ኢየሱስ ሚከብርበት
 ይሁን ትዳራችሁ ፍቅርን የሞላበት
 ለፈቃዱ አሜን የምትሉ ያድርጋችሁ
 በእሽታ መንፈስ እርሱ ይደግፋችሁ
',0),(NULL,'የቤቴ መሰረት ኢየሱስ ነው','wedding1','የቤቴ መሰረት ኢየሱስ ነው
 የኑሮ መካሪ ጥበብ ያለው
 በውሳኔዬ ሁሉ እርሱ ይቀድማል
 ኢየሱስ(ጌታ) የገባበት ይባረካል

ለራሴ እንዳላስብ ብላቴና ነኝ
 ለብቻዬ እንዳልሄድ አቅም አላገኝ
 ለትንሽ ለትልቅ ኢየሱስ ሆይ እላለሁ
 የቤቴን ጠበቃ እርሱን ወክያለሁ

ጠባቂ እረኛ ሐኪም ቀላቢዬ
 በክፉም በደጉም አለሁ ባይ አባዬ
 በማዕድ በሥራዬም በልቤ ዙፋን ላይ
 እርሱን አስቀምጬ አለኝ ግሩም ሲሳይ

አልቅደምህ ጌታ ታግሼ ልጠብቅ
 እንዲያው አልሯሯጥ ፈቃድህን ልወቅ
 አንተ ይሁን ያልከው ጌታ የወደድከው
 በቤቴ ይፈጸም ሥልጣኑ ያንተ ነው

የነገን አላውቅም ምን እንደሚያገኘኝ
 ዓላማው የእሱ ነው እኔ ተቀባይ ነኝ
 የመጣውን ሁሉ በእምነት አየዋለሁ
 እኔ የማልችለውን ለእሱ እለቃለሁ
',0),(NULL,'በእግዚአብሔር ቤት ጸንቶ ለመኖር','wedding1','በእግዚአብሔር ቤት ጸንቶ ለመኖር
 በፊቱ ቆሞ ለማገልገል
 ለእግዚአብሔር ልጆች ትዳር
  ሞገስ ይሰጣል

በብቸኝነት ኑሮ እንዳይከፋው
 በሕይወት ዘመኑ እንድትረዳው
 ጌታ አስቦለት ለፈጠረው ሰው
 ክቡር የሆነ ትዳርን ሰጠው

ለአዳም ብዙ መብል ቢኖረው
 ሀብቱ ቢበዛም አምላክ የሰጠው
 ሕይወት ልታርፍ አልተቻላትም
 ትዳር ከሌለ ኑሮ አይባረክም

አብርሃም ለይስሐቅ ያለውን ሰጠው
 ገንዘብ ጥሪቱን ሁሉ አስረከበው
 ርብቃ ለይስሐቅ እስክምትመጣለት
 አልቻለም ሊያገኝ የልብ መጽናናት

በጉብዝናችን ለእግዚአብሔር ቤት
 በለመለመ በቅዱስ ሕይወት
  መኖር እንድንችል እያገለገልን
 ለቅዱስ ትዳር ጌታን እንለምን
',0),(NULL,'የተቀደሰ ትዳር','wedding1','የተቀደሰ ትዳር ሰላም በረከት ያለው
 ከየትም አይገኝም የአምላክ ስጦታ ነው/2*

ቤት ክብር ባለጠግነት ከአባት ይወረሳሉ
 ብርና ወርቅ ግን ቢሆን ከምድር ይገኛሉ
 አስተዋይ ሚስት ግን ከቶ ማን ያገኛታል
 የእግዚአብሔር ሰው ከእግዚአብሔር እጅ ይቀበላታል

ቤቱን በመልካም ሚይዝ እግዚአብሔርን የሚፈራ
 የማይጨቃጨቅ ቅዱስ ሰው የማይኮራ
 የዚህ ዓይነት አስተዋይ ጓደኛ ማን ያገኛል?
 እግዚአብሔርን ለሚወድ እርሱ ያዘጋጅለታል

ዋጋዋ እጅግ ውድ ነው ከቀይ እንቁ ይበልጣል
 ልባም ሴት ለባልዋ ዘውድ ናት የኑሮ አክሊል
 ክብር ያለው ከእርሷ ነው ከወዴት ትገኛለች?
 ለእግዚአብሔር ሰው ከእግዚአብሔር እጅ ተዘጋጅታለች

ግብዝነት በሌለው መልኮታዊ ፍቅር
 ሚስቱን ልጆቹን ሚወድ ትዳሩን የሚያከብር
 እንደ አብርሃም የሆነ ማግኘት ይችላል
 እግዚአብሔርን ለምትወድ እርሱ ያዘጋጅላታል
',0),(NULL,'ትዳር የጌታ አምላክ ሥራ ነው','wedding1','አብርሃም ለይስሐቅ ከልቡ ተጨንቆ
 እናቱ ሞታለች እኔም መሄዴ ነው
 ልጄ ምን ይሆናል ማነው የሚያጽናናው?  አለ

ትዳር የጌታ አምላክ ሥራ ነው
 ትዳር የዕድሜ ልክ ቃልኪዳን ነው
 ትዳር የብቸኝነት መድህን ነው
 ትዳር የሚመች ጓደኝነት ነው/2*

አብርሃም ሎሌውን ጠርቶ ቃል አስገባው
 ለልጄ እጮኛ ረዳት የምትሆነው
 ከሀገሬ ከወንዜ ፈልገህ አምጣለት
 ከከንዓን ሴቶች ሚስት እንዳትወስድለት አለ

ትዳር ከገዛ አገሬ ፈልገህ
 ትዳር ከወንዜ አንዲቷን መርጠህ
 ትዳር አለች የተዘጋጀች
 ትዳር ለይስሐቅ የታሰበች/2*

ሎሌው ተነሳና ጉዞውን ቀጠለ
 ግመሎቹን ሁሉ አስሮ እያስከተለ
 ጸለየ ተጨንቆ መሃላው ታሰበው
 ጌታን በምልክት መርጠህ ስጠኝ አለው

ትዳር ከገዛ አገሬ ፈልገህ
 ትዳር ከወንዜ አንዲቷን መርጠህ
 ትዳር አለች የተዘጋጀች
 ትዳር ለይስሐቅ የታሰበች/2*
ከታላቁ ውሃ ከታጠረው ሀገር
 ሎሌው ልክ ሲደርስ ልቡን ልታረካው
 አንዲት ልጅ ቀረበች ውሃ ይዛለት
 ግመሎቹን ሁሉ ልታጠጣለት አሜን

ትዳር አስደሳች መተባበር ነው
 ትዳር መቻቻል መተዛዘን ነው
 ትዳር እርስ በርስ መከባበር ነው
 ትዳር የሚመች ጓደኝነት ነው/2*

ርብቃ መረጠች የእምነትን ጉዞ
 ለይስሐቅ ልትሆን በዚች ዓለም ኑሮ
 ገና ከሩቅ ስታይ ብዙ ሳትቀርበው
 ከግመል ወረደች ይስሐቅን አክብራው  አሜን

ትዳር አስደሳች መተባበር ነው
  ትዳር መቻቻል መተዛዘን ነው
  ትዳር እርስ በርስ መከባበር ነው
 ትዳር የሚመች ጓደኝነት ነው/2*

ይስሐቅም ከብቸኝነቱ ተጽናና
 እናቱ ሣራ ሞታበት ነበርና
 ርብቃን ወሰደ እህቱ እንድትሆነው
 ችግሩን ደስታውን እንድትካፈለው  አሜን

ትዳር የጌታ አምላክ ሥራ ነው
 ትዳር የዕድሜ ልክ ቃል ኪዳን ነው
 ትዳር የብቸኝነት መድህን ነው
 ትዳር የሚመች ጓደኝነት ነው/2*
',0),(NULL,'እንኳን ለዚህ ክብር አደረሳችሁ','wedding1','እንኳን ለዚህ ክብር አደረሳችሁ
 በኢየሱስ ቤት ውስጥ ለመዳር አበቃችሁ
 እንኳን ደስ አላችሁ
  ኢየሱስ ይባርካችሁ

እግዚአብሔር ለአዳም ላደረገው
 ረዳት የምትሆነው እንደሰጠው
 ሁሉቱንም ጌታ እንዳጽናና
 ለእናንተም ዛሬ ይኸው አድርጓልና

በሕይወታቸው ለጌታ ሚታዘዙ
 ሥጋቸውን በጥርሳቸው ሚይዙ
 ጌታ ቆጥሮ ቆጥሮ ይከፍላቸዋል
 በረከት ያትረፈርፍላቸዋል

እግዚአብሔር ለአዳም እንዳረገው
 ረዳት የምትሆነው እንደሰጠው
 ሁሉቱንም ጌታ እንዳጽናና
 ለእናንተም ዛሬ እንዲሁ አድርጓልና

ከዓለም እርኩሰት አምልጣችሁ
 የዲያቢሎስን ወጥመድ አልፋችሁ
 ከሰዶም ሰዎች ልማድ ርቃችሁ
 እንኳን ኢየሱስ ለዚህ አበቃችሁ

በኃጥያት የሚገኝ አያዛልቅም
 ሚስትም ባልም ቢባል አይጠቅምም
 ኢየሱስ ጋር ያለው ግን ልዩ ነው
 ኑሮውና ሰላም በረከት ነው
',0),(NULL,'ከሁሉ በላይ የተነገረልህ','kehulu1','ገዢ ነህ በስልጣን የእጅ ስራህን
የዘመናት ቁጥር አይገልጽህ አንተን
አይሻር/አያልቅም ንግስናህ ዛሬም ትገዛለህ
እኛም እንላለን ከሁሉ በላይ ነህ /2/
ከሁሉ በላይ የተነገረልህ 
ከሁሉ በላይ የተተረከልህ /2/
ከቃላት ሁሉ በላይ
ከምስጋና ሁሉ በላይ
ከአምልኮ ሁሉ በላይ
ከሁሉ በላይ /3/
ከሁሉ በላይ ኢየሱስ ከሁሉ በላይ
ከሁሉ በላይ ነህ
እያልን እናምልክህ ከሁሉ በላይ
እያልን እናንግስህ ኢየሱስ ኤልሻዳይ /2/
በምስጋና የምትኖር አንተ ተፈርተህ
በቅድስናህም የተከበርክ ነህ
በክብር ከፍ ከፍ ከፍ ብለሃልና 
እንዘምራለን ለአንተ በምስጋና/እንደገና /2/
ከሁሉ በላይ ከፍ ከፍ ብለህ 
ኢየሱስ ብቻ ትመለካለህ /2/
ከቃላት ሁሉ በላይ ...
ሞገስ ያለህ አምላክ በፍቅር ታጋሽ
ለፍጥረት ተስፋው ነህ ከፊትህ እንዳይሸሽ
ለትውልድ ሁሉ ቸርነት የምታደርግ 
ተመለሱ ስትል በማንም የማትፈርድ /2/
ከሁሉ በላይ ሞገስ ያለህ ነህ 
የምትገዛ ከፍ ከፍ ብለህ /2/
ከቃላት ሁሉ በላይ ...

ገና ያከብርሃል የሚመጣ ትውልድ
ስለአንተ የተረዳ እንዴት እንደነበርክ
የማይለዋወጥ ታላቅ ክብርህን 
ይዘህ እንደምትኖር ለዘለአለም /2/
ከሁሉ በላይ ጸንተህ ትኖራለህ 
ለዘለአለም ሁሉን ትገዛለህ /2/
ከቃላት ሁሉ በላይ ...


',0),(NULL,'ኢየሱስ የረድኤቴ ጋሻ ነህ','kehulu1','ኢየሱስ የረድኤቴ ጋሻ ነህ
የከፍተኛነቴ ሰይፍ
አልወድቅም በስምህ ጥላ ውስጥ ባድር
አምላኬ በቃልህ ብደገፍ      /2/

ልዑል ማደሪያዬ መኖርያዬ ነህ
ፍጹም የማትጥለኝ የምደገፍብህ
በአንተ ኢየሱስ ቅጥሩን እዘላለሁ
የጠላቶቼን ከፍታ እረግጣለሁ

የዘላለም ክንድህ ሆኖ ከበታቼ
ደግፎ ያጸናኛል እቆማለሁ በርትቼ
መራራ ቢገጥመኝ በአንተ ይጣፍጣል
በጥላህ አድራለሁ ሁሉ ይቻልሃል

መሸሸጊያዬ ነህ እመካብሃለሁ
ከክንፎችህ በታች እተማመናለሁ
በፍጹም አልፈራም የሱስ አምላኬ ነህ
በላባዎችህም ትጋርደኛለህ

ምህረትህና እውነትህ ከእኔ ጋር ይሆናል
በስምህም ቀንዴ ከፍ ከፍ ይላል
እጅህ ይረዳኛል በፍጹም አልወድቅም
        ጠላት በእኔ ላይ ከቶ አይጠቀምም
',0),(NULL,'ብርቱ ነው ኢየሱሴ','kehulu1','አለም ሞቷል ያለውን በቅቶታል ያልኩትን /2/
ድንጋይም ጭኘበት እኔ የዘጋሁትን /2/
ሲገለባብጠው ማህተሙን ሲፈታ /2/
ሌቱን ንጋት ሲያደርግ የታመንኩበት ጌታ /2/

ብርቱ ነው ጌታዬ ብርቱ ነው
እኔ የተማመንኩት እህህህ
እጅግ የሚያኮራ የሚያስፈራ
አለው ጽኑ ጉልበት
ብርቱ ነው ኢየሱሴ ብርቱ ነው
እኔ የተማመንኩት እህህ እጅግ የሚያኮራ የሚያስፈራ
አለው ጽኑ ጉልበት

ተመለስኩ በደስታ ኤልሮኢ ብዬ የሚያየኝን ጌታ
በአይኖቼ አይቼ ተመለስኩ በደስታ
ኤልሮኢ አልኩ የሚያየኝን የሱስ
ባይኖቼ አየሁት

ጣልከው አሳዳጄን መች ቆመ በፊቴ /2/
ተነሳሁ ልዘምር በገናዬን ይዤ /2/
ደስታ መጽናናቴ በራማ ተስማ /2/
ባለቀስኩበትም በእንባዬ ከተማ /2/

ደስታዬ በዛልኝ በዛልኝ እንደመከራዬ
ለእኔም ቀን ወጣልኝ ወጥቶልኝ ቆምኩኝ በተራዬ
ደስታዬ በዛልኝ በዛልኝ እንደመከራዬ
እኔም ቀን ወጣልኝ ወጣልኝ ቆምኩኝ በተራዬ

ጌታ ነው የእኔ ጌታ
ብርቱ ነው የማይረታ
አይቼ ማዳኑን ተጠጋሁ ጉልበቱን
ሌሊቱን ሲያነጋልኝ ጨለማው ሲበራልኝ
ሲረታ ሁሉ በርሱ ተጓዳድኩ በብርታቱ

ብርሃን ይሁን ሲል ጨለማዬ በራ /2/
በኢየሱስ በአምላኬ በጌቶቹ ጌታ /2/
የነሃሱም መዝጊያ አውቆ ተከፈተ /2/
የጌታዬን ኮቴ ሰምቶ መች ዝም አለ /2/

እንደዚያው አልቀረም አልቀረም
ቀድሞ እንደተዘጋ ሃሃሃ
ወድቆ ሰንሰለቴ ወድቆልኝ
ቆምኩኝ በተራራ /2/

ተመለስኩ....

ጠላቴን አውጥቶ አጥፋው አለኝ ጌታ /2/
ዘንጉ የሥልጣኑን አስጨበጠኝና /2/
ከእሱ የተነሳ ባለድል ሆኛለሁ /2/
እየሰባበርኩኝ እረማመዳለሁ /2/

ሰባሪው በፊቴ በፊቴ
ሰባብሮልኝ አልፏል
የትኛው ተራራ የትኛው
በፊቴ ይቆማል /2/

ጌታ ነው የእኔ ጌታ
ብርቱ ነው የማይረታ
አይቼ ማዳኑን ተጠጋሁ ግልበቱን
ሌሊቱን ሲያነጋልኝ ጨለማው ሲያበራልኝ
ሲረታ ሁሉ በእርሱ ተጓደድኩ በችሎቱ /3/
',0),(NULL,'ሰው እንደሚያይ','kehulu1','ሰው እንደሚያይ እግዚአብሔር አያይም 
ሰው እንደሚፈርድ አምላኬ አይፈርድም /2/
ፊትን አይቶ እርሱ አያዳላ
በሰው ሐሳብ ጨርሶ አይመራ
ልብን ግን አይቶ እርሱ ይመዝናል
የተናቀውን ከፍ ከፍ ያደርጋል
ልብን ግን አይቶ እርሱ ይመዝናል
የተዋረደውን ከትቢያ ያነሳል

ዘለግላጋ መሆን በቁመት መርዘም
ትከሻ ቢሰፋ መልክም እጅግ ቢያምር
ይህ አይደለም የሱስ ልቡን የማረከው
በግ ጠባቂውን ነው እርሱ የፈለገው
ይህ አይደለም የሱስ ልቡን የማረከው
በግ ጠባቂውን ነው ኢየሱስ የመረጠው

እኔም ውበት ሳይኖረኝ
አንዳች ሀብት ሳይኖረኝ
ምንም እውቀት ሳይኖረኝ ኢየሱስ ወደደኝ
ይኸው ዛሬ ለክብሩ አቆመኝ /2/
ይኸው ዛሬ በቤቱ አኖረኝ /2/

አመስግኑልኝ መድኃኒቴን አመስግኑልኝ
እልል በሉልኝ ለኢየሱሴ እልል በሉልኝ
ሥራህ ግሩም ድንቅ በሉልኝ
እንዳንተ ያለ የለም በሉልኝ /2/ 2

እጅግ ሀብታም መሆን ምንም አይደል ለእርሱ
ባለ ዝና መባል አይደንቀውም እሱ
ሁሉን ግን እያየ በእውነት ይፈርዳል
ሚዛኑ ትክክል መቼ ይዛነፋል
ሁሉን ግን እያየ በእውነት ይፈርዳል
ሚዛኑ ትክክል መቼ ይሳሳታል

አመስግኑልኝ....

ሌሎች ከሀብታቸው ተርፏቸው ሲሰጡ
መቼ ተደሰተ ኢየሱስ በእነሱ
ያቺ ምስኪን ድሃ መቀነቷን ፈታ
ትዳሯን በሙሉ ጥኣለችው/
ያላትን በምሉ ሰጠችው ላምላኳ /2/

እኔም ውበት....

ሰው እንደሚያይማ እግዚአብሔር ቢያይ ከቶ
ኧረ ማን ይቆማል በሕይወቱ ጸንቶ
እስከ ዛሬ ድረስ በቤቱ መቆሜ
በመሐሪው አምላክ በእሱ መታወቄ
እስከ ዛሬም ድረስ በቤቱ መኖሬ
በመሐሪው አምላክ በእሱ መታየቴ

ሰው እንደሚያይ ...
',0),(NULL,'ፋሲካችን ክርስቶስ ታርዶልናል','kehulu1','በመስቀል ላይ እራሱ የሰዋ ነፍሱን ስለእኛ አሳልፎ የሰጠ
ፋሲካችን ፋሲካችን ፋሲካንችን ክርስቶስ ታርዶልናል /2/

ክብሩን ጥሎ ራሱን አዋርዶ
ፋሲካችን ክርስቶስ ታርዶልናል
ለእኛ ሲል አምላካችን ወደ ምድር ወርዶ
ፋሲካችን ክርስቶስ ታርዶልናል
ከፍቅሩ የተነሳ ነፍሱንም ሰጥቶ
ፋሲካችን ክርስቶስ ታርዶልናል
ስለእኛ ማለደ ስቃያችን አይቶ
ፋሲካችን ክርስቶስ ታርዶልናል

ተራራው ኮረብታውን ሜዳ አድርጎ
ፋሲካችን ክርስቶስ ታርዶልናል
ለምጻውን አነጻ ዲዳውንም አናግሮ
ፋሲካችን ክርስቶስ ታርዶልናል
የእውሩን አይን ከፍቶ ማየትንም ሰጥቷል
ፋሲካችን ክርስቶስ ታርዶልናል
በጽዮን ምስጋና ዝማሬ ተሞልቷል
ፋሲካችን ክርስቶስ ታርዶልናል

የዲያብሎስን ስራ ኢየሱስ አፍርሶ
ፋሲካችን ክርስቶስ ታርዶልናል
ከእስራት አወጣን ቀንበሩን ሰብሮ
ፋሲካችን ክርስቶስ ታርዶልናል
ሰላም ለናንት ይሆን ያለን የእኛ ጌታ
ፋሲካችን ክርስቶስ ታርዶልናል
አየነው ባይናችን ሁሉንም ሲረታ
ፋሲካችን ክርስቶስ ታርዶልናል
',0),(NULL,'የተፈጥሮ ሕግ አያግድህም','kehulu1','
የተፈጥሮ ሕግ አያግድህም
ድንቅንም መስራት አያቅትህም
የእኔ ጌታ የእኔ መድኃኒት 
ትሰራለህ ታላቅ ታምራት /2/

ታላቁንም ባህር በክንድህ
ከፍለህ እንደ ግድግዳ አቁመህ
ሕዝብህን በደረቅ አሻግረሃል 
ጠላቶቹን በጥልቅ አስጥመሃል /2/

ዛሬም የሱስ በዚህም ዘመን
በሰዎች ልብ ያልታሰበውን
እጅግ ብዙ ታላላቅ ታምራት 
ስትሰራ አያለሁኝ በእምነት /2/

ተፈጥሮን መቀየር አያቅትህ
በበረሃ ወንዞች ታደርጋለህ
በበረከት የተጠማችን ነፍስ 
ልትሞላ ትችላለህ ኢየሱስ /2/

ምድረበዳን የምታለመልም
ድንቅን የምታደርግ የማትደክም
ስትሰራ በግርማ ተነስተህ 
ማን መቆም ይችላል በፊትህ /2/
',0),(NULL,'እግዚአብሔር ኢየሩሳሌምን','kehulu1','እግዚአብሔር ኢየሩሳሌምን
ይጋርዳታል ይከልላታል ይታደጋታል
አልፎም ያድናታል
ለጠላቶቿ መች ይተዋታል /2/

ንጽህት ሙሽራ ለራሱ የያዛት
በገዛ ደሙ አጥቦ ያነጻት
እንዳይኑ ብሌን የሚጠብቃት
ኢየሩሳሌምን እግዚአብሔር አላት ሚንከባከባት

የድል አድራጊ ድምጽ ሚሰማባት
የጨለማ ኃይል ማይቋቋማት
ብርሃኗ ሁሌ ፍጹም ማይጠፋ
ታማኝ አምላክ ነው ያለው ከእሷ ጋራ - የማያሰጋ

ጠላቶቿንም ሚበቀልበት
ልጆቿን ደግሞ የሚቤዢበት
ቀናት ወራቱ ዘመኑ ደርሷል
መድኃኒቷ ክንዱን ያሳያል በቅን ይፈርዳል

የሠራዊት ብዛት አያስፈራውም
ቃላቸውም ደግሞ አያሰጋውም
ሁሉን በአንድነት ያደቃቸዋል
እግዚአብሔር አምላክ ምን ይሳነዋል ምን ያቅተዋል
',0),(NULL,'ኧረ እንዴት ዝም ልበል','kehulu1','ማንም ዝም በዪ እንዲለኝ አልሻም
ውስጤ ተፍለቅልቀዋል በጌታዬ/በኢየሱሴ ሰላም /2/

ኧረ እንዴት ዝም ልበል
ደስታዬ ወደር/ወሰን አጣ
የዋለልኝ ውለታ ከቁጥር እጅግ በዛ /2/

ልዝለል እንጂ ጨርቄ እሲከወድቅ - እየዘመርኩ
ልበልለት ጎንበስ ቀና ሰው ያረገኝ ኢየሱስ ነውና
ልበልለት ሃሌሉያ የደገፈኝ ኢየሱስ ነውና

እኔስ አገኘሁ የነፍሴን ጌታ
ወደር የለውም የልቤ ደስታ
ስገጂ ነፍሴ ለንጉስሽ
ታላቅ/ድንቅ/ ነገር ነው የሆነልሽ /2/
እሱ ነው የረዳኝ እሱ/ ኢየሱስ/ ነው /2/
ዙፋኑ ምስጋና/እልልታ/ ይክበበው ይክበበው/2/

ሳቂ እንጂ ሜልኮል አንቺም እንዳሻሽ
አፌን አልዘጋም እኔስ በጭስሽ
ተደርጎልኛል ትልቅ ታምራት
ከሞት እኮ ነው ነፍሴን ያዳናት
ተደርጎልኛል ትልቅ ታምራት
ከሲኦል አፍ ነው ነፍሴን ያዳናት
እሱ ነው....
ማንም ....
የሐዘን ማቄን አወለቀና
ደራረበልኝ የጽድቅ ሸማ
ጌጠኛው ልብሴን ይኸው ለበስኩኝ 
ሞቴን በሕይወት ቀይሮ/ለውጦ/ አየሁኝ /2/ 
',0),