INSERT INTO `lyric` (`_id`, `lyric_title`, `lyric_album_id`, `lyric_actual_lyric`, `lyric_is_fav`) VALUES  (NULL,'ስለ ጌታዬ','Gedion1','ስለጌታዬ ብዙ አለኝ
ስለወዳጄ ብዙ አለኝ/2/

ዝም በል ቢሉኝም ዝም የማያሰኘኝ
ሁሌ ዘምርለት አመስግን የሚለኝ
ችዬ እንዳልቀመጥ የሚጎተጉተኝ
አለ ብዙ ነገርዛሬም ትዝ የሚለኝ /2/

ብዙ ብዙ - ብዙ አለኝ
እጅግ ብዙ - ብዙ አለኝ
ስላንተ የማወራው
አለኝ ብዙ አለኝ  3/ 2

ሲርበኝ በልቼ ሲጠማኝ ጠጥቼ
ጉልበቴ ጠንክሮ ቆሜያለሁ በርትቼ
የሰው ልጅ አይደለም አንተ ነህ ያገዝክኝ
ያልኩህን አስታውሰህ ያከናወንክልኝ /2/

ብዙ ብዙ ….

አፌ አይሰለቸውም ስላንተ ሊያወራ
ታሪክ አለህና የሚያስደንቅ ስራ
ድምጼን ከፍ አድርጌ ከቅዱሳን ጋራ
ተባረክ ልበልህ ጠላቴን ሳልፈራ  /2/

ተባረክ ንገስልኝ ውዴ ውዴ
ከፍበል ንገስልኝ ውዴ /2/

ብዙ ብዙ ….
ስለጌታዬ  ….
',0),(NULL,'ማሴአሜ','Gedion1','ሜሱዋ ሂጉሞ ኬስ በኬስቴ
ሜሱዋ ካኦሞ ኬስ አመዳቴ
ቢጃል ኢየሱሳ አት ማሴአሜ  /2/

ዋኣ ኢ ዋኣያመቴ
ኪ ኢለጌኔ አንዲዳ ድናቴ
አን ቱሩማዪ ሎጳሞ
ቢኡሞዪ ከበለም ዩሞ

ሂጊሣቶ ማሴእሜ
ሂጊሣቶ  ገለጠሜ/2/
ሣኢሲቶኤ ማሳሜ
ሣኢሲቶኤ  ገለተሚ/2/

ፒንተዳሣ  ገቦንቼታ
ፒንተዳሣ  ገለቴታ/2/

ሁንዳንካ ሂጉምቤ ጡሚኒ
አፋስሊ ኪ ጌነኖኒ
ኡቦ የነንያን ኡሬሚ
ከ ሀሮ ጫካ ጡጆሚ

ማሌአሜ /4/
ገለጠሜ /4/
ኤቢራሚ /4/
ገለቶሚ /4/
ማሳሚ /4/
ገለተሚ /4/
',0),(NULL,'እንመለሳለን','Gedion1','ማረን - እንመለሳለን/4/
ማረን - እንመለሳለን/2/

ድምጽህ ሲጠፋብን - መቼ ደነገጥን
ይባስ ብለን ደግሞ - በኛው መንገድ ሄድን
ከአሳብህ ጋር - ስንጣላ ኖርን
አሁን ግን ይበቃናል - ወዳንተ መልሰን
ወዳንተ መልሰን  /2/

ሰዎች ሲመለከቱን - ልዩ ፍጥረት መስለን
አደባባይ ስንወጣ - አቤት እናምራለን
እባክህ ጌታችን ሆይ - ጓዳችንን አሳየን
በደምህ እንታጠብ - ይሄ ነው የሚሻለን
ይሄ ነው የሚሻለን /2/
ማረን - እንመለሳለን/4/
ማረን - እንመለሳለን/2/

ለወንድማችን ጥፋት - ምክንያት እኛው ሆነን
ገርሞን እንጠይቃለን - ምንነካው እያለን
ለማዳን ተሰይመን - ሌላ ሰፈር ተገኘን
በሐሜትና ወሬ - ጊዚያችንን ጨረስን
ጊዜያችን አለቀብን
እድሜያችን አለቀብን

ጌታ ሆይ በድለናል
አንተን መፍራት ትተናል
ክብራችንን ፍለጋ
ያንተን ክብር ጥለናል
የፀሎትህን መቅደስ
ና እንደገና አድስ/2/
',0),(NULL,'ብዙ ክብር','Gedion1','ተባረክ - በብዙ እልልታ
ተባረክ -   በብዙ ጭብጨባ
ተባረክ  -  በብዙ ሽብሸባ
ተባረክ  -  በብዙ ሙገሣ

በብዙ - እልልታ /3/ በብዙ ሙገሣ    /2/

እንደኃይልህ ብዛት - እንደፍቅርህ ስፋት
ተመስገን ልንልህ መጣን - ወደአንተ ቤት
አለህ ልዪ ሞገስ - ሁሌም ገናና ነህ
በቀረቡህ መጠን -እጅግ ታስፈራለህ/5/

ተባረክ ….

ከደመናት በላይ - አልፈህ ትሄዳለህ
ስትፈልግ ንፋስን - ክንፍህ ታደርጋለህ
የተቆለፈ ቤት - ገብተህ አይተንሃል
ምንም በሌለበት -ባንተ ተፅናንተናል    /5/

ተባረክ ….

ብዙዎች ተደንቀው - ተባረክ ብለዋል
እያሸበሸቡ - በፊትህ ዘለዋል
እኛም ምናደርገው - ሌላ ስለጠፋን
ጥንት የለመድከውን -ያንን አምጥተናል/5/

ብዙ ክብር ይሁን ላንተ ጌታ
ብዙ ክብር ይሁን ላንተ የሱስ/…/
',0),(NULL,'አመልካለሁ','Gedion2','እልልታ አመጣለሁ ለጌታዬ /2/
ለታላቅነቱ ክብር ብዬ /2/ 2
አመልካለሁ እፈር ጠላቴ
ድሉ የኔ ነው እፈር ጠላቴ /4/

እኔስ የሚገርመኝ /2/ ከሁሉ ከሁሉ
እኔስ የሚደንቀኝ ከሁሉ ከሁሉ
በጠላት ፊት ለፊት ራሴ መቀባቱ/
በአንዲት ጠጠር ብቻ ከእግሬ ስር መጣሉ /2/
አቤት ችሎታው /4/
አቤት ችሎታው
ኢየሱስ ጌታ ነው /2/
ገናና ገናና ኢየሱስ ገናና
ምስጋና ምስጋና ለስሙ ምስጋና /2/

ነፍሴ የምትወድህ ጌታ
አንተ የምወድህ /2/
ክበር ... ክበር
ንገስ ... ንገስ /2/

ገለታ የሱስ ኪና ገላታ 
ገለታ ኤምቡም ሀሬች ገለታ /2/
ኦኮኦ አዕሌ ሀሬች ገለታ
ሉምብ ኪሀኔ ሀሬች ገለታ /2/

ገለታ ኪሀኔ አት ኡዊተኔ
መዝሙርም ኪሀኔ አት ኡዊተኔ
እልላት ኪሀኔ አት ኡዊተኔ
ሽምሽማት ኪሀኔ አት ኡዊተኔ /2/

ኤሞሄ ገለታ ኤሞሄ እልልታ /4/
',0),(NULL,'መንገዴን ልቀቅ','Gedion2','ዞር በል ጠላቴ ፈቀቅ
ልራመድ መንገዴን ልቀቅ
የሐሰት ካባህን ወለቅ
ልቤ መጨከኑን እወቅ
ላልሰማ አትድከም ይቅርብህ
ስራ አለብኝ እኔ ልንገርህ

አግበስብሶ ይህን ያንንም
የእኔ ጆሮ እንዲህ አይሰማም- እንዲህ አይሰማም
ለሐሜት ወሬ ጊዜ የለኝም
መዳኔ እንጂ ሌላው አይገርመኝም-አይገርመኝም

ያልቻልኩትን ኢየሱስ ችሎ
ስራዬን ሁሉ እርሱ ሰርቶ
ባዶ ማድጋዬን ዘይት ሞልቶ
አይቻለሁኝ ተዓምር ሰርቶ /2/

ኃይልን በሚሰጠኝ በኢየሱስ
ሁሉን እችላለሁ

ስትነካካኝ ይብስብኛል
አምልኮህን ጨምር ይለኛል
መንፈስ ቅዱስ ያነቃቃኛል
ታድያ ልቤ እንዴት ይከፋዋል
ዞር በል ...

ካንተ ጋራ እየተጋፋሁ
እንዳላረፍድ ተመክሬአለሁ-ተመክሬአለሁ
ኢየሱሴ ከተዋጋልኝ
በቃ እኔ ማረፍ አለብኝ-ማረፍ አለብኝ

ያልቻልኩትን ...

ተስፋ ቁረጥ ጠላቴ ሆይ
እኔ የእግዚአብሔር ነኝ

እግዚአብሔር ሁሉን ቻይ ነው
ኢየሱስ ኤልሻዳይ ነው
ሰው ማይችለውን ይችለዋል
ተራራውን ሜዳ ያደርገዋል /2/

እግዚአብሔር ሁሉን ቻይ ነው
ኢየሱስ ኤልሻዳይ ነው
',0),(NULL,'ደሙን አይቶ','Gedion2','ሞት አለፈኝ አለፈኝ - አለፈኝ
ሐዘን አለፈኝ አለፈኝ - አለፈኝ
ችግር አለፈኝ አለፈኝ - አለፈኝ
ጥፋት አለፈኝ አለፈኝ - አለፈኝ /2/
ደሙን አይቶ - ደሙን አይቶ /4/

አጥፊው ተልኮ ሲመጣ
ወደ መንደሬ ሲገባ
በጉ በኔ የተቀባው
መታመኛዬ የሆነው
ደሙ ተናገረ እስኪ ንካው አለ
የኔ ሰፈር ብቻ በሰላም አደረ

ሞት አለፈኝ ...

ያስመለጠኝ ያተረፈኝ
ከገባሁበት ያወጣኝ
ብርታት ጉልበቴ አይደለም
ጠላት እኔን አይፈራኝም
የማስፈራራበት ማስደነግጥበት
ጎልጎታ አናት ላይ የፈሰሰልኝ ደም
ደሙ ምልክቴ /3/ 2

በሚያስጨንቅ ዘመን በሚያሳስብ /2/
እኔ ግን በሰላም እወጣለሁ - በሰላም
እኔ ግን በሰላም እገባለሁ - በሰላም /2/
በሰላም /4/
',0),(NULL,'የፀሎት ቤት','Gedion2','የፀሎት ቤት  /2/
የውዴን ፊት የማይበት
የፀሎት ቤት - የጸሎት /2/
ሰላሜን የማገኝበት
ዕንባዬን ሚታበስበት /4/

ቤቱ የፀሎት ቤት
ምህረቱ ያለበት /2/
ገዢና ሳጭ ይውጣ
ቤተ መቅደሱ ይጥራ /2/

እጠብቀዋለሁ
ውዴን አየዋለሁ /2/
ዘርቼ በዕንባ
አጭዳለሁ በደስታ /2/
ዕንባዬን የሚታበስበት /4/

ገና በርከክ ስል
ሰላሜ መጣልኝ /2/
ሄደ የረበሸኝ
ቅባቱ ሲነካኝ /2/

ሳልጠይቀው ገና ሳስብ
መልስ መጣ /2/
አቤት /2/ የኔ ጌታ /4/
',0),(NULL,'የደስታ እንባ','Gedion2','የምስጋና የደስታ ዕንባ እንጂ /4/
ከፋኝ ብዬ አላለቅስ
ልቤ አያዝን አላኮርፍ
ይልቅ ልዘምር እንጂ /4/

ኢየሱስ - ለኔ እኮ ልዩ ነህ
ኢየሱስ - መልካም ሽታ አለህ
ኢየሱስ - የማትሰለች ነህ
ኢየሱስ - ዛሬም አባቴ ነህ

እወድሃለሁ /3/ 2
ኢየሱስ እወድሃለሁ - ከልቤ /4/
ኢየሱስ እወድሃለሁ

ኢየሱስ የሕይወት ቃል አለህ
ኢየሱስ ከሞት ታድናለህ
ኢየሱስ ታሪኬን ለውጠህ
ኢየሱስ አዲስ ታደርጋለህ
እወድሃለሁ /3/ ...

ኢየሱስ ከሁሉ በላይ ነህ
ኢየሱስ ብርቱ ምርኩዜ ነህ
ኢየሱስ ከማንም መረጥኩህ
ኢየሱስ ልቤ አረፈብህ

ወደድኩህ ስለወደድከኝ
ቀረብኩህ ስለአቀረብከኝ /2/
ከኔ የሆነ ምን አለ/2/ ሁሉ ባንተ ሆነ /2/
',0),(NULL,'ዘማሪ ነኝ','Gedion2','ከሆንኩት በላይ ብሆን
መቼ ሊበዛብህ /4/

ገና ገና
ሙሉ ቀን እስኪ ሆን /3/ 3

ሚልኮል ብታኮርፈኝ ምን ቸገረኝ
ተዋረድክ ብትለኝ አይሰማኝ
ከአባትዋ ቤት ይልቅ ለመረጠኝ
እያየችኝ ፊትዋ እዘላለሁኝ
እዘላለሁኝ /4/

አምልኮዬ ይጨምራል ገና /2/
ዝማሬዬ ይጨምራል ገና /2/
ከዚህ በላይ ይጨምራል ገና /2/
እንደ ዳዊት ይጨምራል ገና /2/
ይጨምራል /4/

ገና ሳልጀምረው በዛ ሲሉኝ
አረ እነዚህ ሰዎች አስገረሙኝ
ጠላቴ እርሙን ያውጣ ንገሩልኝ
ቢሞላ ባይሞላ ዘማሪ ነኝ
ዘማሪ ነኝ /4/ 2

አሁንም ከፍ በል የኔ ጌታ /2/
ከፍ በል
በማይነቃነቀው ዙፋንህ ላይ
ጸንተህ በምትኖረው መንግስትህ ላይ
ከፍ በል
አሁንም ከፍ በል /3/
ከፍ በል /2/
ከፍ በል /.../
',0),(NULL,'የታረድከው በግ','Gedion2','የታረድከው በግ
ምስጋና እና ክብር
በረከት እና ኃይል
ልትቀበል ይገበሃል /2/

በላይ በዙፋንህ በግርማ ተቀምጠህ
እልፍ አእላፍ መላእከት ቅዱስ ቅዱስ የሚሉህ
የተፈራህና ሁሉን የምትገዛ
ኢየሱስ ወደድኩህ የሕይወቴን ቤዛ

አምልኮ ውዳሴ
ታቀርብልህ ነፍሴ
ይገበሃል ኢየሱስ
የነገስታት ንጉስ /2/

ተወደስ ዘላለም ሃያል ነህ ገናና
የመስቀል ላይ ወዳጅ ይብዛልህ ምስጋና
እስትንፋስ ያላቸው አንተ የፈጠርካቸው
ምድርና ሞላዋ የእጅህ ስራ ናቸው 
አምልኮ ውዳሴ ...

መላእክት ሌተቀን ቅዱስ ቅዱስ ሚሉህ
በረከት ምስጋና ክብር የተገባህ
እኔም ልገዛልህ አንተ አምላኬ ነህ
እኔም ልስገድልህ የሚስኪኖች ወዳጅ ነህ
የታረድከው በግ ...
',0),(NULL,'በጊዜው ሲደርስ','Gedion2','ኢየሱስ ባንተ
አረ ስንቱን አለፍን በአንተ
ስንቱን አለፍነው
ዳገት ቁልቁለቱን ሸንተረሩን
በድል ተሻገርነው /2/

ጠላት ሊውጠን በተነሳ ጊዜ
ጭንቀት ሲከበን ሐዘን ትካዜ
አንተ ከኛ ጋር ባትሆን ኖሮ
በጠፋን ነበር ገና ያኔ ድሮ

ተራራ ወጣን ቁልቁለት ወረድን
ኢየሱስ ግን አንተ መች ተለየኸን
ሁሉን በጊዜው ውብ አረክልን
ልባችንንም አሳረፍክልን
ኢየሱስ ባንተ ....

ባንተ ይታለፋል አባጣው
ባንተ ይታለፋል ጎርባጣው
ካንተ ጋር ይገፋል ተራራው
ካንተ ጋር ይመቻል ሸሎቆው
ተመስገን /2/

በጊዜው ሲደርስ ኢየሱስ
በጊዜው እንባዬን ሲያብስ
ደስ ያሰኛል በጊዜው ሲደርስ
ውብ ያደርጋል በጊዜው ሲደርስ /4/
',0),(NULL,'አቤት ደስታዬ','Gedion2','አቤት ደስታዬ - አቤት ደስታዬ
እኔስ ደስታዬ - እኔስ ደስታዬ
በጌታዬ /4/

መዘመር ማሸብሸቤ በጌታዬ ደስ ብሎኝ /2/
በፊቱ መጫወቴ በጌታዬ ደስ ብሎኝ /2/
ሃሌሉያ ማለቴ በጌታዬ ደስ ብሎኝ /2/
እጆቼን መዘርጋቴ በጌታዬ ደስ ብሎኝ /2/

ደስ ብሎኝ... /2/ በጌታዬ /2/

እንደነ ጳውሎስ ተቀኙሁለት
ክብሩን እያየሁ ከእስራት በላይ
እስኪናወጡ መሰረቶቹ
እስኪበጠሱ ሰንስለቶቹ

ቃሉ መከረኝ ልቦና ሰጠኝ
ደስታህ ከምድር አይደለም አለኝ
የምን ጭንቀት የምን ሃዘን
እርሱ እያለ እግዚአብሔር

የእግዚአብሔር ደስታ ሆነና ሃይሌ
አመልከዋለሁ ባይሞላም ሁሌ
መንፈሱ መጣ በል ተነስ አለኝ
በከፍታ ላይ ሊያረማምደኝ

አቤት ደስታ - አቤት ደስታዬ /..../
',0),(NULL,'ክፉ አይንካብኝ','Gedion2','ወንድሜ እወድሃለሁ/2/ ወንድሜ
እህቴ እወድሻለሁ /2/ እህቴ /2/
በደሙ አስተሳስሮናል
በመስቀል ፍቅሩ ገዝቶናል
የአንድ አባት ልጆች ሆነናል

የወንድሜ ችግር የራሴ ችግር ነው
ሐዘን መከራውን እካፈለዋለሁ
ምን አገባኝ ብዬ
አላየውም ቆሜ

በልቤ ቂም ይዤ ክፉ አልመኝም
እግዚአብሔር ፍቅር ነው
በቀልን አይወድም
እኔን ስለማረኝ
በቃ ይቅር አልኩኝ

ዘምሬ ዘምሬ ሰብኬ ሰብኬ
ስለምን ይቅርብኝ በከንቱ ዋጋዬ
የሞተልኝን ሳይ
ያለፈው ይረሳል
ወንድሜ ....

ምንም ቢያሳዝነኝ ቢበድለኝ
ወንድሜን ክፉ አይንካብኝ
ምንም ብታሳዝነኝ ብትበድለኝ
እህቴን ክፉ አይንካብኝ /2/

ክፉ አይንካብኝ /4/
',0),(NULL,'ጎንደሊያ','Gedion2','ጋሻዬ ነው /4/ 2
እንዴት ይለፈው ችሎ ጠላቴ
አጥር ሰራልኝ ኢየሱስ አባቴ
ኢየሱስ አባቴ

ታዎ ጎንደሊያ /4/ 2
ዋ ንዲ ከንተኔ ተሞርኬ
የሱስ ድሪሲ ተይሽዋ /2/

ፋሮኒ አፈርይ ታና ያሼና
ታና ጤሳ ጦሰይ ኦጊያን ኦሌና /2/
ተሞርኬ ጉዬፔ ስንተው አሌና
ታብዮ ኦጊያ ታና አበይ ተቄና/2/

ጦላ ታ ጋ ታኒ ገለታይዳ
አማሮ ታ ኬና አ አንጆይ ዳ /2/
አዱንካንያ ጊዶን እልልለይ ዳ
ታ ጦሰው ሰሉዋን ሳ አን ከውታ ገይዳ
ደጋና ኦ ቦነችዋ ዘመረይ ዳ

ተደግፌ በብርቱ ጌታ /2/
ተማምኜ እዩኝ ስወጣ
ተደግፌ በብርቱ ጌታ /2/
ተማምኜ እዩኝ ስገባ

ሂዶ ታቀንጣ  ጠለዮ /4/
,,,,,,,,
',0),(NULL,'እሳት ይውረድ','Gedion2','እሳት ይውረድ እላለሁ
እሳት ይንደድ እላለሁ /2/
አለዚያማ እንዴት እችላለሁ
ይህን ዘመን እንዴት አልፋለሁ/
ፊትህንስ እንዴት አያለሁ

አስፈላጊ ነገር በጣም አስፈላጊ /2/
መንፈስ ቅዱስ በጣም አስፈላጊ
ቅዱስ መንፈስ እጅግ አስፈላጊ
ገንዘብ ያስፈልገኝ ይሆናል
እውቀት ያስፈልገኝ ይሆናል
ወዳጅ ያስፈልገኝ ይሆናል
ዘመድ ያስፈልገኝ ይሆናል
መንፈስ ቅዱስ 
ከዚህ ሁሉ ይበልጣል
እሳት ይውረድ እላለሁ ...

አስፈላጊ ነው በጣም አስፈላጊ /2/
ኢየሱስ በጣም አስፈላጊ
ለሕይወት በጣም አስፈላጊ

ይመጣል ይሄዳል ቁሳቁስ
እዚህ እስቲ ምን አለ አዲስ
ዘመን የማይለውጠው ንጉስ
ዛሬም አስፈላጊ ነው ኢየሱስ
አዳኙ አስፈላጊ ነው 

ና! ኢየሱስ ይሻለሃል ና!
ኢየሱስ ይሻልሃል ተው! ይሻልሃል
ነይ! ኢየሱስ ይሻልሻል ነይ!
ኢየሱስ ይሻልሻል ተይ! ይሻልሻል
',0),(NULL,'እኔ በእኔነቴ ','Habtamu1','እኔ በእኔነቴ ፍጹም አልመካም
ስጋ ለባሹንም ክንዴን አላረግም
አለኝ ምኮራበት ፍጹም የማይተወኝ
ደገፋና ጋሻ ሃይልም የሚሆነኝ
መመኪያዬ ኢየሱስ የኔ መመኪያዬ
መደገፊያዬ ጥላ ከለላዬ

ካባትም ከናትም ከዘመድ የሚሻል
አምላክዬ ልዩ ነው ለሕይወቴ ይበልጣል
ወረት አይለውጠው ዘለአለማዊ ነው
የምስኪኖች ወዳጅ ኢየሱስ ብቻ ነው

የወለደችእናትእርሷእንኳን እንድትረሳ
ቃሉን አስተማረኝ ኢየሱስ ላይተወኝ
እኔ አልጥልህም ከቶም አልተውህም
ያለኝ ውዴ የሱስ ይበልጣል ከሁሉም

ስጨነቅ ስጠበብ ሸክሜን የጣለለኝ
ጸሎቴን የሰማኝ ከአርያም አለኝ
ለእኔ ከእኔ በላይ የሚቸገርልኝ
ኢየሱስ ብቻ ነው ረዳት የሆነልኝ

በኢየሱስ ስም ምክንያት ጉልበት የሆነኝ
ለእኔ ብቸኝነት ከቶ አይሰማኝም
በእግዚአብሔር ቤት አሉኝ ቤተሰቦች
ፍቅርን የተሞሉ እኅቶች ወንድሞች
',0),(NULL,'ከሰለሞን የሚበልጥ','Habtamu1','ከሰለሞን የሚበልጥ ታምር የሚሰራ
እንቁቅልሽ ፈቺ አለ በዚህ ስፍራ
የልቤ ምስጥሬ ለእሱ እነግረዋለሁ
እኔ ኃይል የለኝም ትምክህቴ የሱስ ነው /2/

አለኝ የምመካበት ተስፋ የሆነልኝ
ከኃይል ሁሉ በላይ ኃይልን የተሞላ
ኢየሱስ ይሰራል ይሰራል አምናለሁ
እሱ ሁሉን ቻይ ነው ሁሉ በሁሉ ነው

ክንደ ብርቱ አምላክ ገናና እና ሃያል
ማን ነው እንደ የሱስ ሃይል የሚስተካከል
ዘመናትም አልፈው ዘመንም ይተካል
ዛሬም ለዘለአለም ኢየሱስ ይሰራል

ቸርነት በጎነት ፍቅርን የተሞላ
ለልጆቹ ድጋፍ የሚሆን ከለላ
ታላቅ ነው ድንቅ ነው የጌቶች ጌታ
ሁሉም የሚገዛለት ሁሉን የሚረታ

ኢየሱስ ይሰራል ማን ይከለክላል
በሰማይ በምድር ፈቃዱ ያደርጋል
ቸልተኛ አይደለም ልጆቹን ይሰማል
እሱ ዝም አይልም ጸሎት ይመልሳል
',0),(NULL,'አውቀኸዋል ወይ ','Habtamu1','አውቀኸዋል ወይ ወንድሜ እንደሚገባ?
አውቀሸዋል ወይ እኅቴ እንደሚገባ ?
በበርህ ቆሞ የሚያንኳኳ
የክብር ንጉስ ነው ይግባ
በበርህ ቆሞ የሚያንኳኳ
ክቡር ድንጋይ ነው ይግባ

አብረሃም በእምነት ተስፋ ያደረገው
ለሙሴ በእሳት ጣር ላይ የተገለጠው
በዘመናት ሁሉ ከፍ ብሎ ያለው
እርሱ የሚያንኳኳው የጥንቱ አምላክ ነው

ከሃይል ሁሉ በላይ ሃይልን የተሞላ
ከክብር ሁሉ በላይ ክብር የለበሰ
በሰማይ በምድር ግርማው የሚያስፈራ
የተገለጠልህ ኢየሱስ ድንቅ ነው

ከጭንቀት ከደዌ ነጻ የሚያወጣው
አጋንንት በስሙ የሚያንቀጠቅጠው
ከአጽናፍ እስከ አጽናፍ ስሙ የገነነው
እርሱ የሚናገርህ እግዚአብሔር ክቡር ነው

የምድር ነገስታት ወድቀው ሚሰግዱለት
ተራሮች ኮረብቶች የሚታዘዙለት
ለኛም የሚያወርሰን የዘላለም ሕይወት
ልባችን ይታዘዝ ለእሱ ይከፈትለት
',0),(NULL,'ፍጹም ከሰማይ ነው','Habtamu1','ፍጹም ከሰማይ ነው እኔ የማመልከው
ታላቅነትና ግርማ የተሞላው
ቅዱስ ስለሆነ እኔን ቀድሶኛል
ንጹህ ስለሆነ እኔን አንጽቶኛል /2/

እንደ ከንቱ ነገር አምላኬን ቆጥሬ
አላቃልለውም ከአፈር ነው ብዬ
ከአፈር ቢሆን ኖሮ አፈር ሆኖ ይቀራል
እሱ ግን ድል ነስቶ ሞትን አሸንፏል /2/

ቅዱስ ስጋ ነው ክርስቶስ ኢየሱስ
ከሰማይ የመጣው እኔን ለመቀደስ /2/
ንጹህ ነው ኢየሱስ ፍጹም ሰማያዊ
የአዳም ስጋ የሌለው ያለምድራዊ /2/

ከዘር ያመጣሁት አዳማዊ ሃጥያቴ
በሰማያዊ ስጋ ተተካች ሕይወቴ /2/
እንደ ሰው ያይደለ አምላክ አግኝቻለሁ
በወንጌል አላፍርም እሱን ለብሻለሁ /2/

እርሱ ከሰማይ ነው የአዳም ዘር የሌለው
የአምላክን ስጋ ቆጠሩት እንደ ሰው /2/
ባለማምለካቸው እንደ አምላክነቱ
እነሱ እየሳቱ ሌላውን የሚያስቱ /2/

የእግዚአብሔርን ምስል በአፈር አልመስልም
ከሰማይ የሆነውን ምድራዊ ሃረግ /2/
በቅዱስ ደም ስጋ እኔን አድኖኛል
የአዳም ዘር ሃጥያቴን በእርሱ ወስዶልኛል /2/
',0),(NULL,'የከንቱ ከንቱ ነው','Habtamu1','ሃብት ክብር ዝና ባለጠግነትም
ያልፋል ሁሉም ያልፋል አይኖርም ዘላለም
ሕይወት ከማይሰጠው ከዚህች አለም ክብር
አብልጦ ይሻላል ጉዞ ከኢየሱስ ጋር

የምድሩ ነገር ጠፊ ነው
የከንቱ ከንቱ ከንቱ ነው
የሱስ ከሁሉ ይበልጣል
የዘለአለም ሕይወት ይሰጣል /2/

ጀንበር ጧት ወጥታ ማታ ትጠልቃለች
ምድርና ሞላዋ እንዲህ ታልፋለች
ዘመናችን ፈጥኖ እንደጥላ ያልፋል
ለዘለአለም ሕይወት ማሰቡ ይሻላል

በምድር ላይ ብሄድ ቢረዝም ቢቆይም
በድሎች መድረክ ስጋህ ቢለመልም
ዝናህ በምድር ገኖ ስምህ ቢታወቅም
የሱስ የሌለበት ከንቱ ነው አይጠቅምም

ታይቶ ለሚጠፋ እንደ ጧት ጤዛ
ያልፋል ሁሉም ያልፋል ያልፋል እንደዋዛ
በጊዚያዊ ነገር ሁሉ አትገዛ
ኢየሱስ ተገዝተህ ይሁንልህ ቤዛ
አዝ...
ሃብት ...
አዝ.....
ጀንበር ....
አዝ..
',0),(NULL,'የእሾህ አክሊል','Habtamu1','ከዚህ አክሊል በፊት የእሾህ አክሊል ይቀድማል
ብናስብበት ማድረግ መንግስትህን ያወርሳል /2/

በሰውና በእግዚአብሔር ------ ሕሊና
መታዘዝ ይበጃል በንጹህ ልቦና
አገልግሎት በዝቶ ሩጫና ትጋት
መታዘዝ ከሌለ ከንቱ ነው በእውነት /2/

አስተዋይ ልቦና ስንኖር በእግዚአብሔር ቤት
ከመታዘዝ ጋራ አለው መልካም ትጋት
በስጋ መጎሸም መቼ ይገባው እሱ
የእሱ አላማው ብቻ ማዳኑን ቅመሱ /2/

ጌታ ጌታ የሚሉት የሚዘሙሩለት
እግዚአብሔር መቼ አጣ የሚያገለግሉት
በፍጹም ነፍሳቸው ግን የሚታዘዙት
እነሱ ይውርሳሉ የእግዚአብሔርን መንግስት /2/

ታላላቅ መስዋእት ለእግዚአብሔር ቢቀርብም
መታዘዝ ከሌለ ብዙም አያሸትም
አለመታዘዝን በመታዘዝ ሽረን
ከመስዋእት በፊት እንቀድስ ራሳችን /2/
',0),(NULL,'በሰማይ ላለው','Habtamu1','አሃሃ በገናው ይደርደር
አሃሃ ከበሮው ይመታ
አሃሃ ኑዛዜ ይሂድለት
አሃሃ እኔም ልቀኝለት/ላዜምለት 
በሰማይ ላለው ታላቅ ካህን
ክብር ይድረሰው ለኢየሱስ /2/

ቢዳሰስ ቢፈለግ በምድር ዙሪያ ሁሉ
ማነው እንደ የሱስ ክብርና ሃይሉ?
ብቃቱ ሳይኖረው ብላቴናዊ ዳዊት
እግዚአብሔር ሃይል ሆኖት ተዋግቶ ጣለለት

በሃይል በብርታቱ ስሙ የገነነ
እንደ እሱ ማን አለ በጽድቅ የታመነ?
ባለ ብዙ ምህረት በምክሩ ግሩም ነው
ክንደ ብርቱ አምላክ ስሙ እግዚአብሔር ነው

ግርማው ገናና ነው ክብሩም እጅግ ታላቅ
ሃይሉም አስፈሪ ጠላቱን የሚያደቅ
ማህቱሙን የፈታው የይሁዳ አንበሳ
ያንስበታል ለእርሱ ብቀመጥ ብነሳ

በእርሱ የሆነውን ለእሱ እንሰዋለት
ዝማሬ ጭብጨባ እኔ ባቀርብለት
ብዘል ባሸበሽብ ደግሞስ ብሰግድለት
ለጌታ ኢየሱሴ ይህም ሲበዛበት
',0),(NULL,'ክቡር ነው መሰዊያው','Habtamu1','ክቡር ነው መሰዊያ ክቡር ነው /2/
ከእግዚአብሔር የሆነ የማይጠፋ እሳት አለው /2/
ምንም ቢሆን ምንም ጣቴን አልቀስርም
በእግዚአብሔር ስራ እጄን አላነሳም /2/*

ሳዝንም ሳጣ የምመከርበት
ሳጠፋም እንድታረም የምገሰጽበት
ስተክዝ እንድታነጽ አይዞህ የምባልበት
ክቡር ነው መሰዊያው ቃሉ የሚፈልቅበት

ያለ መንፈስ ቅዱስ በክንቱ ባልሆነ
መቆም አይቻልም ፍጹም በእግዚአብሔር ፊት
የበከነ ነገር የሚነገርበት
አይደለም መሰዊያ አልከበርበት

በመሰዊያው ዙሪያ ቆሜ ሳገለግል
ካልፈራሁ ቅባቱን በመንፈሱ ሃይል
በችሎታ ብቻ እንዳይሆን በእውቀት
ላክብር መሰዊያውን እንዳልወድቅ ከድንገት

በአንተ መሰዊያ ፊት የሚቆሙ ሁሉ
በዝግታ መንፈስ እንዲሆን በቃሉ
ልዩነትን ጥለው ካላገለገሉ
በልኡል ጣጣ ፋታ ፈጥኖ ያገኛሉ
',0),(NULL,'አንተ ብቻ ','Habtamu1','አንተ ብቻ ኢየሱስ አንተ ብቻ
በሰማይ በምድር የለህ አቻ
የሚወዳደርህ ከቶ ማንም የለም
የአማልክት አምላክ ክበር ለዘለአለም /2/

ከጥንትም ጀምሮ ታምራትን ሰሪ
አምላክና ጌታ የፍጥረታት መሪ
ታጋሽና ርሁሩህ ቸር እና መሃሪ

የአማልክት አምላክ የዘላለም ንጉስ
እንዳንተ ያለ የለም ጻድቅና ቅዱስ
ከፍ በል ጌታችን ክበር ጌታ የሱስ

አማልክትን ሁሉ ያሳፈርከው ጌታ
በማንም በምንም ከቶ ማትረታ
እርዳን ጌታ የሱስ እንድልህ 

ክብርህንም ትተህ የወረድከው ከላይ
ዘለአለም የምትኖር ብቻህን ዙፋን ላይ
ንገስ ጌታ የሱስ በምድርም በሰማይ
',0),(NULL,'የታመነ ቤት ','Habtamu1','በጥቂት ዘመኑ አምላኩን ያከብራል
የየሱስን ሃሳብ ብቻ ያገለግላል
ከንትነቱን ትቶ ፍጻሜውን ያስባል
የከበረውን ተስፋ አሻግሮ ዛሬም ያየዋል

የአምላኩን ጦርነት ሚዋጋ
በጎነቱን ለመንገር የሚተጋ
የምድርን በረከት ይበላል
የታመነ ቤት ይሰራለታል /2/*

ምንም ታናሽ ቢሆን ዛሬ ጅማሬው
ፍጻሜው ያማረ እጅግ የበዛም ነው
የናቁት በሙሉ እፍረት ይለብሳሉ
ቤቱን ሲሰራለት አይቀርም አንድ ቀን ያያሉ

የየሱስ ቸርነት በሕይወቱ ዘመን
ይከተለዋል እስኪ ገባ ወደ ጽዮን
ከክብር ወደ ክብር ይሸጋገራል
በጸጋ ላይ ጸጋን ደርቦ ይጎናጸፋል

የከንፈሩ ፍሬ ይባረክለታል
ብዙዎችን ወደ ጽድቅ መልሶ ያስታርቃል
በሰማይ ዘላለም ሲያበራ ይኖራል
ማለቂያ የሌለው ሕይወት የሱስ ይሰጠዋል
',0),(NULL,'መቅደሱን ይሙላው','Hana1','ተቀምጦ ላለው - በኪሩቤል ላይ
ተቀምጦ ላለው - በዙፋኑ ላይ
ይድረሰው - በላይ  በማደሪያው
ምስጋና - መቅደሱን ይሙላው
ይድረሰው - በላይ በማደሪያው
እልልታ - መቅደሱን ይሙላው


ማደሪያው ይሞላ - በአዳዲስ ምስጋና
በክብር ከፍ ከፍ - ከፍ ብሎልና
ገናና ነውና
የተፈራ ጌታ - በብዙ አምልኮ
እኔም ባመጣለት - ይገባዋል እኮ /2/
ተቀምጦ....

እልፍ አእላፍ መላእክት - ቅዱስ ነህ እያሉት
የተዋበ ዜማ - እያቀረቡለት /2/
ይሔ ትልቅ ንጉስ - ዙፋኑ የጸና
ፈለገ ከምድር - ስሙ እንዲጠራ
ዝናው እንዲወራ
ይድረሰው.....

በችግሬ ሰአት - ሰማና መጣልኝ
መቃብሬን ከፍቶት - አዲስ ሕይወት ሰጠኝ /2/
ይድረሰው እልልታ - የልቤ ስጦታ
ኢየሱስ እረፍቴ - የሰላሜ ጌታ /2/
ተቀምጦ....

ይድረሰው ምስጋና
  ይድረሰው እልልታ /…/
',0),(NULL,'አንተን ብዬ','Hana1','አንተን አንተን አንተን ብዬ
ሁሉን ትቼ ተከትዬ /2/
መቼ አፈርኩኝ
መቼ ወደቁኩኝ
ተመስገንልኝ /2/   2

ብርና ወርቅ - ባይኖረኝ - አምላክ አለኝ
ጋሻና ጦር - ባይኖረኝ - ጌታ አለኝ /2/
አምላክ አለኝ /3/
ጌታ አለኝ /3/

ታድያ ምን አለ - ብኮራበት
ታድያ ምን አለ - ብመካበት /4/

ተመስገን - በአንተ አማረብኝ
ተመስገን - ማድጋዬ ሞላልኝ
ተመስገን - ጠላቴን ጣልክልኝ
ተመስገን - ቀንዴ ከፍ አለልኝ /.../
',0),(NULL,'እኔ ላንስ','Hana1','እኔ ላንስ አንተ ልትልቅ /2/
ይገባሃል ከፍ ከፍ ልትል /2/

አንተ ትልቅ ነህ - ካልኩሁም በላይ
ዝቅ ልበልና - የሱስ ልቀህ ታይ
ይኸ ነው ምኞቴ - የአንተ ክብር ክብሬ
ከፍ ከፍ ላድርግህ - ለዚህ ነው መኖሬ

ከፍታውን ሁሉ - የክብርህን ቦታ
ውሰድ እሰጥህአለሁ - ስለሆንክ ገናና
በእውነት በመንፈስ - እሰግድልሃለሁ
ይገባሃልና - አዜምልሃለሁ

የሰማይ የምድር - ፈጣሪ ጌታ ነህ
እስትንፋስ ያላቸው - የሚያመሰግኑህ
እኔም ልተባበር - ከፍጥረታት ጋራ
እጆቼን ዘርግቼ - ልበል ባለ ዝና

አንተ ልቀህ ታይ - በሁሉ ላይ
    ኢየሱስ ልቀህ ታይ - በሁሉ ላይ /2/
',0),(NULL,'ማለዳ','Hana1','ማለዳ ማለዳ ምህረቱ አዲስ ነው
ዛሬም ለዘላለም ጌታዬ ይቅር ባይ ነው
ኦሆሆ ማለዳ
ኦሆሆ ማለዳ
      አዲስ ነው /2/     2

እንደ እግዚአብሔር
ማን አለ የሚምር?
በደልን አይቆጥር
መልሶም አያስብ
ኦሆሆ .....

መሃሪ ነው ጌታ
ያልፋል በይቅርታ
እንደሰው አይደለም
ለፍርድ አይቸኩልም
ማለዳ....


ዛሬም ያልጠፋነው
በቤቱ ያለነው
የማያልቅ ጸጋው
ስለደገፈን ነው
ኦሆሆ .....

ምህረቱ ለዘላለም ነው /.../
ቸርነቱ ለዘላለም ነው /.../
',0),(NULL,'እሄዳለሁ','Hana1','በዚያች ሀገር - ጭንቀት የለም
ሐዘን የለም - ረሐብ የለም
መዘመር ነው - ለዘላለም /2/
ጸሐይና ጨረቃ አያስፈልጓትም
በጉ ብርሃኗ ይሆንላታል /2/

ዓለም ሳይፈጠር - የተሰራች
ቅዱሳን ብቻ - ሚገቡባት
የእኔ መኖሪያ - የሩሳሌም ናት
ብዙ ዝማሬ - ሚሰማባት

የጌታዬን ፊት - የማይባት
ከመከራዬ - ምጽናናባት
ሐዘን ጭንቀቴን - የምረሳባት
ያቺ ውብ ሀገር - የማርፍባት
ምድር ያንቺ አይደለሁም - እሄዳለሁ /4/
በጊዜው - እነጠቃለሁ
አልቀርም - እነጠቃለሁ /4/

ዛሬ በድንግዝግዝ - ይታየኛል
የጽዮን ሽታ - ነፍሶብኛል
እናፍቃለሁ - እዛ ልሄድ
እነጠቃለሁ - በቅርብ ቀን

ምድር የአንቺ አይደለሁም ....
',0),(NULL,'ወንጌሉን ስበኩ','Hana1','ወደ ዓለም ሁሉ ሂዱ
ወንጌሉን ለፍጥረቱ ሁሉ ስበኩ /2/
ሳይለዋወጥ - ይሄ ወንጌል
ሳይቀያየር - ይሄ ወንጌል
ከትውልድ - ወደ ትውልድ /2/
እንዲሸጋገር

ይሄ ወንጌል - እንዲጸና
ሰማእታት - ተወገሩና
መዘበቻ በመሆን - በመገረፍ በእስራት
መከራ እየተቀበሉ - እውነቱን ለእኛ አጸኑት
ወደ ዓለም ሁሉ ሂዱ .....

ኧረ እስቲ ዛሬስ ማን ይሆን
እንደቀደሙት ሐዋርያት
አደራውን የሚጠብቅ ሚያስረክብ በታማኝነት?
ሳይጨምር ፍጹም ሳይቀንስ የሚሰጥ ለመጪው ትውልድ
ከትውልድ ወደ ትውልድ /2/ እንዲሸጋገር

እኛ ከሰበክንላችሁ
የተለየ ሚነግራችሁ
እርሱ የተረገመ ይሁን ብሏል አባቶቻችን
እኛም ቃሉን ተቀብለን ላልዳኑት እናወራለን
ወደ ዓለም ሁሉ ሂዱ .....
',0),(NULL,'ኢየሱስ ገናና','Hana1','አንተ ግን ያው አንተ ነህ
ማን አለ የሚመስልህ
አንተ ግን ያው አንተ ነህ
የሁሉ የበላይ ነህ /2/
ኢየሱስ ዛሬም ገናና
ኢየሱስ ነገም ገናና
ሁሌም ገናና
ገናና የሱስ ገናና
ገናና ዛሬም ገናና /2/

የዘመናት ብዛት ከቶ አያስረጅህ
ሁሌ ትኖራለህ ጸንተህ በዙፋንህ
ማንም አልተገኘም የሚስተካከልህ
ልክ እንደ ትናንቱ ዛሬም ኃያል ነህ /2/

ማለዳ ማለዳ ሁሌ ጊዜ አዲስ ነህ
ተዓምር ታደርጋለህ ማን ሊወዳደርህ
ማስተዋልህ ደግሞ አይመረመርም
ጉልበትህ ብርቱ ነው መቼም አይደክምህም /2/
ኢየሱስ ዛሬም ገናና ....

አማልክት የሚባሉ ቢኖሩም በምድር
አይቻላቸውም ለመቆም በአንተ ፊት
ኩራት ኩራት አለኝ አንተን በማምለኬ
ላሸብሽብልህ ተነሳሁ ከልቤ /2/
አንተ....
',0),(NULL,'ቀን ቆጥሮ','Hana1','አዋቂ ነው እግዚአብሔር /2/
ዝም በሉ 
አትናገሩ
እግዚአብሔር አዋቂ ነው /2/

ከፍ ሲያደርግም - አዋቂ ነው
ዝቅ ሲያደርግም - አዋቂ ነው
ወዶ ቢገድልም - አዋቂ ነው
ከሞት ሲያወጣም - አዋቂ ነው

ያሰብነው ባይሆን - አዋቂ ነው
ልመና ቢቆይ - አዋቂ ነው
እስቲ ዝም በሉ - አዋቂ ነው
ስራውን እዩ - አዋቂ ነው
ቀን ቆጥሮ ቆጥሮ ይደርስለታል
የተረሳውን ያስታውሰዋል /2/
የምንም ስም እንዳይጠራ
ሥጋ ለባሹ እንዳይፈራ
ብቻውን ችሎ ታሪክ የሰራ
ይባረክ እርሱ የሁሉ ጌታ /2/
ይባረክ የሁሉ ጌታ /4/

ጌታ ታላቅ ነው - ኧረ ዝም በሉ
እርሱ ጻድቅ ነው - ኧረ ዝም በሉ
ፍርዱም ንጹህ ነው - ኧረ ዝም በሉ
በቀኑ ያምጣው - ኧረ ዝም በሉ
ቀን ቆጥሮ ቆጥሮ ....
',0),(NULL,'አልሞትም','Hana1','ገና - ገና ነው /4/
ኧረ እኔ መቼ ዘመርኩና ገና ገና ነው /2/
ኧረ እኔ መቼ አመለኩና ገና ገና ነው /2/
ኧረ እኔ መቼ ጀመርኩና ገና ገና ነው /2/
ብዬ እነግረዋለሁ - ለዚያ ለጠላቴ /4/

አንተ ጠላት ስማኝ - ይኸው ልንገርህ
ብዙ ስራ አለኝ - ተው አታድክመኝ
እቅዴ ብዙ ነው - ራእዬም ሰፊ ነው
ቃል ተገብቶልኛል - ምድርን እንድወርሰው
አልሞትም - በሕይወት እኖራለሁ
ወጥመዱ ተሰብሮ አምልጫለሁ /4/

ገና ሌሎች መጥተው ጌታን ያከብራሉ
የእርሱን ታላቅነት ይመሰክራሉ
አምልኮዬ አለው አስገራሚ ጉልበት
ኢየሱስ ሲጠራ ይሰበራል ምሽግ
አልሞትም በሕይወት እኖራለሁ
ወጥመዱ ተሰብሮ አምልጫለሁ /4/

አይሰማም ጆሮዬ ተረትና ወሬ
ምስጋና ብቻ ነው ያለው በከንፈሬ
እሮጣለሁ እንጂ ጉልበቴ አይዝልም
እገሰግሳለሁ እስትንፋሴ እሲኪቆም
አልሞትም በሕይወት እኖራለሁ
ወጥመዱ ተሰብሮ አምልጫለሁ /4/
ገና ገና ...
',0),(NULL,'ይብዛለት','Hana1','ይብዛለት ለውዴ ምስጋና ምስጋና /3/
ምስጋና
ትናንት ያመለኩት አይበቃውምና
ዛሬም ይገባዋል አዳዲስ ምስጋና
አሁንም ይገባዋል አዳዲስ ምስጋና
ምስጋና

በበገና በማሲንቆ
አዜማለሁ በከበሮ
ቢከፋውም ያ ጠላቴ
አዳዲሱን ለመድኃኒቴ /2/

በሁሉ ላይ ስልጣን አለው
ሸክሜን ለእርሱ ሰጥቼዋለሁ
አሳምሮት ይሰራዋል
ለምስጋና ያደርገዋል /2/

ውዴ ኢየሱስ ደስ የሚለው
ብዙ ክብር ሲሰጠው ነው
ያንስበታል ጨምሩለት
ከእኔ ጋራ ከፍ አድርጉት /2/

ጨምሩለት እልልታ ጨምሩለት
ጨምሩለት ምስጋና ጨምሩለት /4/
',0),(NULL,'አላስቻለኝም','Hana1','አላስቻለኝም ዝም ማለት እያየሁኝ በጎነቱ
አላስቻለኝም ዝም ማለት እያየሁኝ ቸርነቱን
አላስቻለኝም ዝም ማለት /4/

ሐጥያተኛ ሳለሁ በምህረት ቀርቦ
ይጠይቀኝ ጀመር ውሃ አጠጢኝ ብሎ
ለካስ ጌታ ኖሯል የአለም መድሀኒት
ጉድሌቴም ሊሞላው መጣ ወደ እኔም ቤት

መልካም በምትባል በመቅደስ ደጃፍ
ተቀምጬ ሳለሁ ስለምን ምጽዋት
ጌታዬ በድንገት ባልጠበቁት ሰአት
መጣና ፈወሰኝ በእግሮቼ አቆመኝ

እንደ ኢየሱስ ያለ ፈቃር የትም የለም
በዘመናት መሃል አልተለዋወጠም
የትናንቱ ጌታ ዛሬም ተአምረኛ
ያላሰብኩት ሁሉ በእርሱ ሆነልኛ

አላስችል ብሎኛል በቃ ልናገረው
ከየት እንዳነሳኝ ዛሬ የት እንዳለሁ
ነፍሴን ከአዳኝ ወጥመድ ኢየሱስ አድኗታል
በከበረ ሥፍራ ይኸው አስቀምጧታል
',0),(NULL,'አንተን ፈርቼ','Hana1','አንተን ፈርቼ ቃልህን አክብሬ
እንድኖረ ተመኘሁ የሱስ ጌታ ብዬ
የቀናውን መንፈስ አድሰው በውስጤ /2/

በቤትህ መኖር እንደሚገባኝ
መኖር እንድችል ጸጋህ ያግዘኝ
ኃያሉ ጌታ የምታስፈራ
እቆያለሁኝ ከአንተ ጋራ

ና ንገስብኝ አንተን ሾሜሀለሁ
ከማንም ቅድሚያ መርጬሀለሁ
ቀንና ሌሊት ተመስገን ስልህ
ዘመኔ ይለቅ ስዘምርልህ

ቀንበሬ ሰብረህ ቀና ብያለሁ
በስምህ ጉልበት ተፈትቻለሁ
ስለዚህ ውዴ ተገዛሁልህ
ትልቁን ቦታ ልቤን ሰጠሁህ
በልቤ ዙፋን ተቀመጥ ኢየሱሴ
ትወድሃለች የፈጠርካት ነፍሴ /2/
',0),(NULL,'ምንም ታናሽ ብሆን','Liya1','ምንም ታናሽ ብሆን የተናቅኩ የበግ እረኛ
ምንም ታናሽ ብሆን የተናቅኩ የበግ እረኛ
ጉድ ይበል አገር ጉድ ይበል እስራኤል
እኔ መሄዴ ነው ወደ ጎልያድ/2/

ጭንቅ ቢለው ግራ ቢገባው ንጉሱ
ጭንቅ ቢለው ግራ ቢገባው ንጉሱ
ልብሱን ልበስ አለኝ ለማስፈራራት
እኔ ቅባት አለኝ ድል ማረግበት /2/

ክብድ ብሎ ያስቸገረህን ነገር
ክብድ ብሎ ያስቸገረህን ነገር
ጉዳይህን/ነገርህን ንገረው ምንም ሳታስቀር
ያሸንፍልሃል አትጠራጠር /2/

አንድ ጎበዝ አንድ ጀግና ትግቶ
የጎልያድ ፉኮራው ጧት ማታ በዝቶ
እግዚአብሔር ከላይ አየና
መች እሱ እንደ ሰው ይቸኩልና
ዝም ዝም ዝም ዝም አለና
ብላቴናው ዳዊትን ቀባና
አወዳደቁን የከፋ አረገው
በፎኮረበት እዚያው ዘረረው
አወዳደቁን የከፋ አረገው
በፎኮረበት እዚያው ዘረረው /2/
',0),(NULL,'ዋና ነኝ ኃጢአተኛ','Liya1','ዋና ነኝ እኔስ ዋና
ዋና ነኝ እኔስ ዋና
የሆንኩኝ በደለኛ
ከኃጢአተኞች አንደኛ /2/ 2
በፍቅርህ ስበኸኝ በደምህ አጥበኸኝ - ስታነጻኝ
ደግሞ በዚህ በኩል ሌላ ኃጢያት ሰርቼ - አገኘኸኝ
ሌላማ አይደል ነው እራሴ ነኝ አንተን ያሳዘንኩ
ጽድቅህ ሲለውጠኝ ደግሜ በድዬ ልብህን አቆሰልኩ /2/

ስራዬን ሳታየው - ምህረትህን ላከው
ክፋቴን ሳትቆጥሮው - ይቅርታህን አበዛኸው
የማዳንህን ብርታት በኔ ላይ ገለጽከው /2/
መቼ ነው አንተን ከማሳዘን ልቤ ሚመለሰው?
መቼ ነው በመውጣቴመግባት ሁሌ ደስ የሚልህ?
መቼ ነው በእኔ ማዘንን ጌታ የምታቆመው?
መቼ ነው በነገሬ ሁሉ የሱሴ የምትኮራው?

ውዴ ይቅር ባይ ነህ
ዛሬ ትምራለህ
ኃጥያተኛን ወደህ ለማዳን ብለህ - ተሰዋህ
የማይገባኝን ከሞት ለመመለስ በመስቀል ላይ ዋልክህ /2/
ስራዬን ...

መሃሪ /3/
መሃሪ ይቅር ባይ ነህ የሱስ መሃሪ /2/
እስቲ ልጠጋ የምህረት በር ሳይዘጋ
ልቤን ልመልስ ለይቅርታ ጊዜው ሳያበቃ
አንድ ሁለት እያልኩኝ ወደ ክብርህ
ልቅረብ ወዳንተ ልከለል በጸጋህ በክንፍህ /2/
በደልን አትቆጥርም ቸሩ ጌታ
ምህረትህ አያልቅም ጧት ማታ /2/
',0),(NULL,'አረ ከዚህ በላይ ቢዘመር','Liya1','አረ ከዚህ በላይ ቢዘመር
አረ ከዚህ በላይ ቢከበር
አረ ከዚህ በላይ ቢሰገድ
ሲያንስበት ነው እንጂ መች ሲበዛበት /2/
ይደርደር በገና ይመታ ከበሮ
እስቲ ዘሙሩለት ሃያል ነው ክንደ ብርቱ
ይደርደር በገና ይመታ ከበሮ
እስቲ ዘሙሩለት ሃያል ነው ክንደ ብርቱ

ሃያልና ብርቱ - የኔ ጌታ
ክንዱ በምንም - ማይረታ
ገናና/ትልቅ ነህ በሉት - እሱን አክብሩታ /2/
እሱን አክብሩታ /4/

ዘመኔ በሙሉ ባወራው
አያልቅም እኮ ስራው ብዙ ነው
ባይመጥነውም ክበር ልበለው /2/
አረ ከዚህ ...

እኔ አላየሁም እንደዚህ ጌታ
ሁሉን የሚያደርግ በችሎታ
በጥረት ላክብረው የበላይ ነውና /2/
አረ ከዚህ .....

እናንተም ከኔ ጋር ተባብራችሁ - ተባብራችሁ
ክብር ይገበሃል በሉት እባካችሁ /2/

ይደርደር በገና ይመታ ክራሩ
እስቲ ዘሙሩለት ሃያል ነው ክንደ ብርቱ /4/
',0),(NULL,'አንተ አትለመድም','Liya1','አንተ አትለመድም ትልቅ ነህ
የሱስ/ንጉስ አትለመድም ትልቅ ነህ /2/
ሁኔታዎቹን አላይም አከብርሃለሁ/አመልክህሃለሁ
ከሁኔታም በላይ ነህ አውቄህአለሁ /2/

በማያልቀው ምህረት እየደገፍከኝ
የሱስ አንተ ነህ እዚህ ያደረስከኝ
እኔ የሚኮራው ባንተ ነው
እኔ የምመካው ባንተ ነው
ዘላለሜ ካንተ ጋር አርገው /2/ 4 /2/
አንተ ...

በክብርህ ውበት አሰብኩህ
ግርማህ የሚያስፈራ ገናና ነህ
ክብር ምስጋና ላንተ ነው
ዝማሬም ይኸው ላንተ ነው
ዘላለሜን ካንተ ጋር አርገው /2/ 4 2
አንተ ...

ከእስትንፋሴ ይልቅ ሚጠጋጋኝ ወዳጄ ቢሆንም
አለኝ ብዬ የምለው አንዱ የሱስ ጌታዬ ቢሆንም
ክብሩ እንደ ጸዳል የሚያበራ ነው
ባወቁት ቁጥር የሚያስፈራ ነው /2/
አንተ ...
',0),(NULL,'አላጉረመርምም ባንተ ላይ','Liya1','እንዴት ብዬ እንዴት አፌን ባንተ ላይ /2/
እግዚአብሔር ትልቅ ነህ የበላይ /2/
አላጉረመርምም ባንተ ላይ
አላጉረመርምም ባንተ ላይ
አላጉረመርምም ጌታ ባንተ ላይ
አርባ ቀን የነበረው የእስራኤል ጉዞ
አርባ አመት አደረገው ማጉረመረምን አይቶ /2/

ባለማጉረምረም ህይወት
ይገኛልና በረከት
ካሌብ እና ኢያሱ መንገዱን ቀናላቸው
በጽድቅ እየመራህ ከነአን አገባሃቸው /2/
አላጉረመርምም ባንተ ላይ ...

አላምህን ፈጽም በህይወቴ
አንተ ብቻ ነህ መድሃኒቴ
እንዲህ ነህ እንደዚያ ከቶ አንተ አትባልም
ምታደርገውን ታውቃለህ ፈጽሞ ስህተት የለህም /2/
አላጉረመርምም ...

እራሴ ማልረባ ደካም ነኝ
ጌታ ሆይ ባሰራርህ እንዳሻህ አድርገኝ
ከእንግዲህ ራሴን ላንተ ሰጥቼሃለሁ
ምህረትህ አይለየኝ ጥበቃህ እሻለሁኝ /2/
እንዴት ....
',0),(NULL,'የማትረሳ','Liya1','እናትም አባትም ይረሱ ይሆናል
ወዳጅም ዘመድም መቼ እንዳንተ ይሆናል? /2/
የማትጥል ነህ የማትረሳ
የወደቁትን አቤት ስታነሳ /2/

አስተዋሽ አንተ ብቻ ነህ ጌታዬ /4/
ከበላሷ በታች ተቀምቼ ሳለሁ
እጁን የዘረጋ የረዳኝስ ማን ነው? /2/

ማትሰለች ማትዘንጋ ነህ የቅርብ ወዳጅ /4/
በባእድ አገር ውስጥ ዮሴፍን አሰብከው
በግብጽ ነገስታት ፊት ሞገስ  ሰጠኸው /2/

እናትም አባትም ይረሱ ይሆናል ...

በችግር ፈጥኖ ደራሽ ነህ ተጠሪ /4/
ባዶ ማደጋዬን በዘይት ሞላኸው
በሰላም ሂጂ አልከኝ እዳዬን ከፈልከው /2/
አሰራሩ ነው አደራረጉ
የወደቁትን ማንሳት ነው ልማዱ
አሰራሩ ነው አደራረጉ
የተጣሉትን ማሰብ ነው ልማዱ /2/
',0),(NULL,'እምቢ ብዬ አለሁ','Liya1','እምቢ /3/ ብዬ አለሁ
ከነአንን/የሱስን መርጫለሁ /2/
ሞቅ ደመቅ ካለው የፈረኦን ቤት
ለኔስ ይሻለኛል ጉዞ ወደ ከነአን /2/

በዚህ ነው በዚያ ነው ብዙ ነው ምክንያቱ
አለም ትስባለች ዋጋ የለው ሁሉ ከንቱ
ለኔ ግን በቤትህ መኖር ይሻለኛል
የአለም ዝና ክብር ምን ያደርግልኛል?

አሳየው አስገረመው ፈረኦንን አስደነቀው
ባህሩን ለሁለት ከፍሉ እሱን በዚያ ጣለው
ይሄ ነው የኔ ጌታ ታምር የሚሰራ
እሺ ብዬ የምታዘዘው ራሴን የምሰጠው

የኔ ጉዳይ በሲና ተራራ ነው
የፈረኦን ቤት ለኔ እንደ ምናምን ነው
አይሆንም አይሆንም እምቢ ብዬ ያለሁ
ግብጻዊ አይደለሁም እምቢ ብዬ ያለሁ
እስራኤላዊ ነኝ እምቢ ብዬ ያለሁ
እምቢ ብዬ አለሁ አሁንም እምቢ
ከዘለአለም ከኢየሩሳሌም
አትበልጥም አለም/2/

የሱስን መርጫለሁ
የሱስን መርጫለሁ
ከነአንን መርጫለሁ
ከነአንን መርጫለሁ /6/
',0),(NULL,'የምህረቱ ነገር','Liya1','ለእኔ ከሆነለኝ የሚገርመኝ
ሁሌም ባወራው ማይሰለቸኝ /2/

የምህረቱ ነገር
አያልቅም ሁሌ ቢነገር
የርህራሄው ነገር
ያደረገልኝ ቢቆጠር /2/

ስራዬ በደል ነው እሱን ማስከፋት
ፍጥረቴ ከጥንቱ ሃጥያት መሰረት /2/
ምህረቱ ከቁጣው ገኖልኝ
ዛሬ እኔን በህይወት አኖረኝ /2/

እንደ ሰው ስላይደል - አልበየነብኝም
ይቅርታ እንጂ ለኔ - ቁጣ አልላከብኝም /2/
የተለየ ቸር ነው ወዳጄ
አልፈረደብኝም አጥፍቼ /2/
ለኔ ከሆነልኝ የሚገርመኝ
ሁሌም ባወራው ማይሰለቸኝ /2/

ፈልጎ ነበረ የራሱ ሊያደርገኝ
አስጨንቆኝ ሊኖር ሁሌ እያስለቀሰኝ /2/
አቤት ለጠላቴ
ለተመኘው ሞቴን/ ለአየልኝ ውድቀቴን /2/
ንገሩት በህይወት መቆየቴን
ቀይሮት የሱስ ማንነቴን/ታሪኬን/4/
',0),(NULL,'ዘመን መጥቶልኛል','Liya1','የጥንት አባቶቼ ያለፉት/የቀደሙት
መቼ እንደኔ ተደላድለው/ተመቻችተው 
ክርስትናን አሳለፉት /2/
ለኔ ግን ዘመን መጥቶልኛል
የዜማ የቅኔ ጊዜ ደርሶልኛል /2/ 2

ለእምነታቸው ብዙ ከፍለዋል
እነ እስቲፋኖስ በድንጋይ ተወግሯል
ይሄ ሁሉ አልፎ ቀን ወጥቶልኛል /2/

የቤቴክርስቲያን ከፍታ ደርሷል
የምስጋና እና የድል ጊዜ ሆኗል
ከልብ ልናመልከው በእውነት ይገባናል /2/

እንደ ሰው ማልታይበትን
ተንቄ የምታለፍበት ዘመን አብቅቶልኛል
አሁንም አየ ድል የዝማሬ ጊዜ ሆኗል /2/
ካለሁበት እወጣለሁ
በገናዬን አነሳለሁ
ዘመን መጥቶልኛል እዘምራለሁ /2/ 3
',0),(NULL,'አደራ የነፍሴን ጉዳይ','Liya1','ካንተ ጋር ጉዳይ አለኝ ካንተ ጋር
ካንተ ጋር ጉዳይ አለኝ ካንተ ጋር /2/
የምነግርህ ነገር አለኝ - የማወያይህ
የምነግርህ ጉዳይ አለኝ የምትፈጽምልኝ /2/

ለነፍሴ ያለሃት አንዱ ጠበቃዬ
ማመልጠው ጌታ ባንተ ከጠላቴ
ሳትከብርብኝ መኖር ትርጉሙ ምንድ ነው
በነፍሴ መሸነፍ ለኔ ጥቅም የለው
ከስጋዬ ይልቅ ነፍሴ አሸንፋ
ሳይ ነው የምረካው - ላንተ ተገዝታ
አንድ ነገር አለኝ - አደራ የምልህ
የሱስ ሆይ በፊትህ ሁሌ የምማጸንህ

አደራ የነፍሴን ጉዳይ
አደራ የህይወቴን ጉዳይ /4/
ካንተ ጋር ....

ለኔ - ለኔ እንዳንተ ሚሆን ማን አለ ጌታዬ
ለኔ - ለኔ እንዳንተ ሚሆን ማን አለ ኢየሱሴ
ስወድቅ የምታነሳኝ - ስዝል የምታበረታኝ
እጆቼን በእጅህ ይዘህ - የምታራምደኝ /2/

መምጫህ ደርሷል - ይህንን አውቃለሁ
ጌታ በፊትህ በጽድቅ ተግቼ
መኖር እሻለሁ ለአንተ ተለይቼ /2/
አደራ ....
',0),(NULL,'ካልባረከኝ አልለቅህም','Liya1','ታገልከኝ - እስኪ ነጋ ባርከኝ ብዬ ለመንኩህ
ታገልከኝ - እስኪ ነጋ ባርከኝ ብዬ ለመንኩህ
መባረክን ይችልበታልና
ስሜንም ቀይሮ እስራኤል አለና /2/
ሌሊቱ ቢነጋ እንደገና ቢመሽም
ዛሬ እኔ ብዬ አለሁ ካልባረከኝ አልለቅህም /2/
ካልባረከኝ - /እኔ/ አልለቅህም /4/

ባርኮትህን ጸጋህን ፈልገዋለሁ
ባርኮትህን ጸጋህን ፈልገዋለሁ
በጎ ስጦታ በረከት
ከላይ ነውና ከብርሃን አባት
እጅህን ዘርጋ ለበረከት /2/
ሌሊቱ ቢነጋ ....

የያቆብ አምላክ እኔም አምንህአለሁ
የምትሰራልኝ እጠባበቃለሁ
እስከ ልጅ ልጆችም አንተ ትታመናለህ
የበረከት አምላክ ሁሉም አንተ ጋር አለ /2/ 2
ሌሊቱ ቢነጋ ....
',0),(NULL,'ልገኝ በበጉ ሰርግ','Liya1','በምድር የማየው ከጽድቅህ ሊለየኝ
ፈተና ሆኖብኝ ከዚህ ሁሉ ሊያስቀረኝ
ወደ ምናፍቃት አገር እንዳልገባ
ሌተቀን ጠላቴ ወጥመድ ቢዘረጋ
አይችልም እኔን ለማስቀረት
ካሰብከው/ካየህልኝ በረከት /4/

ልገኝ በበጉ ሰርግ ላይ
ልገኝ እድምተኛ ልሁን
ልገኝ ካሰብክልኝ በረከት
እንዳልጎድል በራሴው ስህተት /2/

በክብር ልመልከትህ በትልቅነትህ
በክብር ልመልከትህ በትልቅነትህ
ሽማግሌዎቹ ቅዱስ ቅዱስ ሲሉ
መላእክት በሙሉ በፊትህ ሲያዜሙ
ደስታዬ ነው እርካታዬ
ክብረህ ሳይ ጌታዬ
ደስታዬ ነው አምላኬ
ልቀህ ሳይህ ጌታዬ /2/

የዘላለም ደስታ ወዳለበት - ወዳለበት
ወዳንተ እረፍት ወዳንተ እረፍት
ልቤ በመናፈቅ ዝሏል /3/
ክብርህ ለማየት ቸኩሏል

ልገኝ በበጉ ሰርግ ላይ .....

በማይቋረጥ ውዳሴ ስትመለክ
እስትንፋስ ያለው ሁሉ በፊትህ ሲዘምር
ነግሰህ እንዳይህ እኔም በዙፋንህ ላይ
የምድሩን ሳላስብ የስጋን ሳላይ
አጽናልኝ ልቤን ብቻ ለጽድቅ
እንድገኝ ባንተ ፊት /4/

ረሃብ የለም ጥማት - ጥማት
ረሃብ የለ እርዛት - እርዛት /2/
ሁሌ ባንተ ፊት - ሁሌ መደሰት ሁሌ መገኘት /4/
',0),(NULL,'ይሰራል የሱስ ኤልሻዳይ ነው','Menber1','ይሰራል የሱስ ኤልሻዳይ ነው
ቀድሞ የነበረው ዛሬም ያለው
ያ የጥንቱ አንድ አምላክ እራሱ ነው
አልተለወጠም ሁሉን ቻይ ነው /2/ 2

ሙሴ በፈርኦን ፊት አቅሞ ያናገረው
እስራኤልን ከግብጽ ባርነት ያወጣው
ሁሉን ቻይነቱን በስራው ያሳየው
ለሕዝቡ የተዋጋ ብርቱና ሃያል ነው

እጁን በባህር ላይ በስልጣን ያነሳል
ነፋሳን አጥርቶ ባህሩን ያደርቃል
ደረቁንም ምድር የውሃ ምንጭ ያደርጋል
ኤልሻዳይ እርሱ ነው ምንስ ይሳነዋል

መራራውን ሁሉ የሱስ ያጣፍጣል
ለሞተ የሆነውን በሕይወት ይለውጣል
የሚሳነው የለም ወይም ሚያዳግተው
ግርማን የተሞላ የአማልክት አምላክ ነው

የዘላለም አምላክ ጥንትም የነበረው
ጌታችን ኢየሱስ ዛሬም ኤልሻዳይ ነው
እሱ ብቻውን ነው ማንስ ይመስለዋል
የክብር ንጉስ ነው ክብር ይገባዋል
',0),(NULL,'ከማይቻል ቦታ ችሎ አውጥቶኛል','Menber1','ከማይቻል ቦታ ችሎ አውጥቶኛል
በፈተና ሁሉ መውጫ ሆኖልኛል
ከእስራቴ ፈቶ ያዳነኝ
አምላኬ የሱስ ይክበርልኝ /2/

ለኔስ እንደ የሱስ ያለ አላገኝም /2/
መመኪያ ጋሻዬ ነው
የረካሁት በእርሱ ብቻ ነው
አላማዬ ሆኖ ረድቶኛል
ሕይወት ከነትርፉ ሰጥቶኛል /2/

ከአለም ጠቢባን የተሰወረውን
እኔ ግን አገኘሁ የዘላለም መዳንን
እንደ እርሱ ያለ ማንም የለም
አከብረዋለሁ ለዘላለም /2/

የተዋረደውን በከፍታ ሚያወጣ
ተስፋ የሌለውን በተስፋ ሚሞላ
እንደ አይኑ ብሌን ተጠንቅቆ
ጠብቆኛል የሱስ ጋሻ ሆኖ /2/

በእልልታ በዜማ ስሙን ላመስግነው
የከንፈሬ ፍሬ ምስጋና ይድረሰው
ለውለታው ምን ይከፈላል?
አምልኮ ስግደት ይገባዋል /2/
',0),(NULL,'ጉልበት ሁሉ ይንበርከክለት','Menber1','ጉልበት ሁሉ ይንበርከክለት
ምላስ ሁሉ ያመስግኑት
ይክበር ይንገስ በምስጋና
ስሙ ከስሞች ሁሉ በላይ ነውና
ኢየሱስ ይክበር በምስጋና
ኢየሱስ ይንገስ በምስጋና /2/

ሁሉን ያደርግ ዘንድ ይችላል
ሃሳቡን መከልከል ማን ይደፍራል?
እሱ እግዚአብሔር ነውና
የወደደውን ያደርጋልና

በቅዱሳን መላእክት ታጅቦ
ይኖራል ዘለአለም ተከብሮ
ሌተቀን ይዘምሩለታል
ቅዱስ ቅዱስ ይሉለታል

በአማልክት መካከል የተፈራ
ስሙ የከበረ ገናና
ትናንት ዛሬም ለዘለአለም
ኢየሱስ ያው ነው አይለወጥም

የነበረ ያለ የሚመጣ
ኢየሱስ ብቻውን ቅዱስ ነው
ለስሙ ሃሴት እናድርግ
ክብርንም ለእርሱ እንስጥ
',0),(NULL,'ክበር የሱስ','Menber1','ክበር የሱስ /2/ እኔ ዝቅ ልበል
ከፍ በል የሱስ /2/ በፊትህ ልዋረድ
ብርሃንህ በሕይወቴ ይታይ
የክብርህ እቃ አርገኝ /2/

ካንተ በቀር የሱስ በጎነት የለኝም
በራሴ ጽድቅ ከቶ መቆምም አልችልም
በተሰበረ ልብ ልቅረብ በፊትህ
ዝቅ ልበል ዳስሰው ሕይወቴንም /2/

አንደበቴን ሁሉ ከክፉ ከልክዬ
በቅድስናና በፍቅር ተጉዤ
በመላ ሕይወቴ አምላኬ አንተን ላሳይ
የሱሴ ሆይ ነግሰህ ከብረህ ታዬ በኔ ላይ /2/

ዘወትር ምላሴ ጽድቅህን ይናገር
ታላቅነትህን ስራህን ይመስክር
ጉድለቴንም አይተህ ሙላኝ በመንፈስህ
ደግህን አስተካክለህ አቅሞኝ ለክብርህ /2/

ልቤን በመንገድህ በቃልህ አድርጌ
የሱስ ሆይ ላክብርህ ላንግስህ በሕይወቴ
ከክብርህ በኋላ አንተ የምትሰራው
ብዙ ነገር አለ በሕይወቴ የሚሆነው /2/
',0),(NULL,'ወንጌሉ አልተለወጠም','Menber1','ወንጌሉ አልተለወጠም
ዳር ከዳር ይሰበካል ዛሬም
ጥንትም የነበረውን አንዱን አምላክ ነው
ዛሬም በዚህ ዘመን የምንሰብከው /2/ 2

በሲና ተራራ በክብሩ ሲገለጥ
በሙሴ ስርአቱን ብዱሩን ሲናገር
ከኔ በቀር አምላክ የለም ብሎ ያለው
በስጋ የተገለጠው አንዱ እግዚአብሔር ነው

ጥንት በትንቢት የተናገሩለት
ቃሉን ብቻ አምነው በተስፋ የተጠበቁት
ዛሬ በአዲስ ኪዳን የሱስ ተገለጠ
እኔን ያየ አብን አይቷል ብሎ መሰከረ

ሕጻን ሆኖ ተወልዶ በበረት የተኛው
ስለእኛ ሃጥያት መከራውን ያየው
የዘላለም አባት የሰላም አለቃ ነው
ድንቅ መካር ሃያል አምላክ ኢየሱስ ብቻ ነው

እኛ የምንሰብከው የጥንቱን አምላክ ነው
ቃሉን ስጋ አድርጎ ወደ ምድር የመጣው
የመለኮት ሙላት በክርስቶስ ተገልጧል
እኔና አብን አንድ ነን ብሎ በቃሉ ተናግሯል
ወንጌሉ - አልተለወጠም /.../
',0),(NULL,'አፌንበምስጋናሙላ','Menber1','አፌንበምስጋናሙላ
አፌንበምስጋናሙላ
በጉዞዬሁሉላመስግንህ
በመንገዴሁሉላክብርህ /2/
በማጉረምረምሕይወትእንዳልሄድ
በሁሉማመስገንልውደድ
ውጣውረድበበዛበትሕይወት
አንተንእያከበርኩልኑርበእምነት
የጠላቴንውግያማሸነፍ
ስራውንምሁሉለማፍረስ
በሌላአይደለምምቋቋመው
ሁሉንበምስጋናሳልፈውነው
ምስጋናንየሚሰዋልኝሰው
ብለሃልየሚያከብረኝእሱነው
ማዳንንየምታሳይበት
በምስጋናውስጥአለህመንገድ
በጊዜውምአለጊዜውም
በደስታወይምበሃዘኑም
እንዳመሰግንየሱስእርዳኝ
በምስጋናመንፈስአንተውሙላኝ
',0),(NULL,'አከብረዋለሁ በምስጋና','Menber1','አከብረዋለሁ በምስጋና /2/
ኢየሱስ ሁሉ ቻይ ነውና
አከብረዋለሁ በዝማሬ /2/
ኢየሱስ ሞገሴ ነው ክብሬ
አከብረዋለሁ በእልልታ /2/
ኢየሱስ ነውና ኃያል ጌታ

በድል መርቶ ላሻገረኝ ቅጥሩን ላዘለለኝ
የጠላቴን እራስ ዛሬም በስሙ ላስረገጠኝ
ያስጨነቀልኝ ችሎልኝ መንገድዬን ላቀናው
ክብሬ ትዘምርለት ከፍ ከፍ ታርገው

ጉልበትና ሃይል ብርታት መታመኛ ሆኖኝ
አይቸለሁኝ ኢየሱስ ታምራት ሰርቶልኝ
በምህረቱ  ዛሬም አቁሞኝ በቤቱ
ምስጋናን እሰዋለታለሁ ስለቸርነቱ

መከራ ችግር ፈተና በህይወቴ ሲገጥመኝ
አለቀላት በቃ ብሎ ጠላት ሲያስፈራራኝ
የታመንኩት አምላኬ ሃይል የእሱ ነውና
ሁሉንም አሸንፎልኝ ቆምኩኝ ለምስጋና

በህይወቴ ሰልፍ ሲገጥመኝ የሱስ ተዋግቶልኝ
ድብቁን የጠላቴን ጦር ምሽጉን ሰብሮልኝ
ትግሉን ውጣ ውረዱን በስሙ አልፌ
የሱሴን ዛሬ አከብራለሁ በድል አሸንፌ
',0),(NULL,'የጽዮንን ጉዞ','Menber1','የጽዮንን ጉዞ በእምነት እንድጓዝ
በሚገጥመኝ ሁሉ አንተን እንዳስቀድም
የመንፈስህን ሃይል አምላኬ አፍስስልኝ
በመንገዴ ሁሉ የሱስ ቅደምልኝ /2/

ጉዞዬ አድካሚ ቢሆን የከበደ
ተስፋ የሚያስቆርጥ እጅግ የረዘመ
ሃይልን በምትሰጠኝ ሁሉን እችላለሁ
በድል አሸንፌ ጽዮንን እወርሳለሁ

መልካሙንም ገድል እኔም እንድጋደል
ሩጫዬ እንድጨርስ በምትሰጠኝ ሃይል
በጽናት መኖርን እንዳውቅ አስተውዬ
ልከተልህ እርዳኝ ሁሉን ነገር ጥዬ

የመላእክትን ዜማ እኔም እንድዘምር
በክብርህ ዙፋን ፊት መቆምም እንድችል
አሁን በሚገጥመኝ አንዳች ሳልሸነፍ
በእምነት ቆይቼ ሁሉን ባንተ ልለፍ

የዘለአለም ቤት ሰማይ ከፍቶልኛል
ጸንቼ ብጠብቅ የሱስ ያወርሰኛል
ከቁድሳን ጋራ እጣዬ እንዲያምር
ዘወትር የሱስን መመልከት እንድማር
',0),(NULL,'ቤተክርስቲያን','Menber1','የተናቅሽበትን ዘመን አሳልፏል
ኢየሱስ እየመራሽ ዛሬ እዚህ ደርሰሻል
በለቅሶ የዘራሽውን በደስታ አጭደሻል
ፍሬሽን በአይንሽ ለማየት በቅተሻል /2/

ቤተክርስቲያን /3/ 
አንቺ የእግዚአብሔር ማደሪያ
የምስጋና ድምጽሽ ከፍ ብሎ ተሰማ
የስደት ዘመንሽ ሁሉ አብቅቷል
በተራሮች ራስ ላይ ከፍ ከፍ ብለሻል
እግዚአብሔር ከጠላቶችሽ እጅ አሳርፎሻል
አምላኽሽን አመስግኚው 
ብርሃንሽ ለአለም ሁሉ ታይቷል /2/

ነፍሳት እንዲድኑ በመንፈሱ ማልደሽ
በጸሎት በእምባ ለአምላክሽ ነግረሽ
ልመናሽ ተሰምቶ ኢየሱስ አክብሮሽ
እውነትሽ ተገልጦ በምድር ዙርያ ወጣሽ /2/

የምስራች ወንጌል በውስጥሽ ሲቀጣጠል
ብርሃንሽ ጨለማን እየዋጠ ሲያስቀር
ጠላት ብዙ ጣረ እሳቱን ሊያጠፋ
ብርሃንሽ ግን ታዬ በራ በምድር ዙርያ /2/

ገና ትወርሺለሽ የረገጥሽውን ሁሉ
የሱስ ያደርገዋል እንደ ቃልኪዳኑ
ያስጨነቁሽ ሁሉ አንገታቸውን ደፍተው
ይመጣሉ አይርቀም እውነት ይህ ነው ብለው /2/
',0),(NULL,'አከብርህለሁ አነግስህለሁ','Menber1','አከብርህለሁ አነግስህአለሁ
ለዘለአለም ኢየሱስ እገዛልህአለሁ
በማለዳ ምህረትህን ማዳንህን አወራልህአለሁ
በማለዳ ድንቅ ስራህን ምስጋናህን አውጅልህአለሁ /2/

ወደር የለህም አምሳያም የለህም
በምክርህ ግሩም ድንቅ እንዳንተ የለም
እርስቴ ነህ ለኔ የነፍሴ እድል ፋንታ
የመኖርዬ ትርጉም የኑሮ አለኝታ

የስምህን ክብር ላቅርብ በፊትህ
የሰራኸውን ሁሉ ላውራልህ
ወደ መቅደስህ በደስታ እገባለሁ
የምስጋናን መስዋእት እሰዋልህአለሁ

የነፍሴ ጠበቃ ለሕይወቴ ዋስ ነህ
ስለኔ ተሟግተህ ጠላቴን የረታህ
ምስጋና ያንስሃል ምከፍልህ የለኝም
በእድሜዬ ሁሉ ላንግስህ ዘላለም

በታላቁ ስምህ ሁሉን አሸንፌ
አቀበት ቁልቁለት ዳገቱን አልፌ
ዛሬ በድል ዜማ ቆሜ አከብርህአለሁ
በምስጋናም የሱስ ከፍ አደርግህአለሁ
',0),(NULL,'ልዩ ነው ለኔ ፍቅርህ','Menber1','ልዩ ነው ለኔ ፍቅርህ
 በቀራዮ የዋልከው
የከበረው ደምህ ሃጥያቴን አጠበው 
ህይወቴን ለወጠው /2/

በሃዘን በስቃይ እንዲያ የማለድከው
የደም ላብ ያላበህ የተንገላታኸው
እኔን ከሃጥያቴ ለማንጻት ወደህ ነው
በመስቀል ነፍስህን የሱስ የሰጠኸው

እጆችህን እግሮችህን በሚስማር ተበስተህ
ጎንህንም በጦር ስለኔ ተወግተህ
በመስቀል ላይ የሱስ አንተ በሞመትህ
ነጻሁኝ ከሃጥያት በፈሰሰው ደምህ

መዘበቻ ሆነህ በሰዎች ተንቀህ
አቅም የሌለውን ደካማውን መስለህ
ግርፋትን ሁሉ ታግሰህ የቻልከው
ደምህን አፍስሰህ እኔን ለማዳን ነው

ፍቅርህ ለዘወትር ሁሌ ይታወሰኛል
የመስቀል ውለታህ እኔን ለውጦኛል
አልረሳም ሁልጉዜ አስታውሰዋለሁ
የከበረው ደምህን እመካበትአለሁ
',0),(NULL,'አሳየኝ የኢየሩሳሌምን ራዕይ','Menber2','አሳየኝ የኢየሩሳሌምን ራዕይ
አሳየኝ የጽዮንን ራዕይ
አለዚያማ ምንድነው ተስፋዬ?
ማመኔ አንተን መከተሌ
በእምነቴ ጸንቼ እንድኖር/2*
ልናፍቃት ያችን ውብ አገር/2*

አንድ ቀን እኖራለሁ በኢየሩሳሌም
ከአንተ ጋር አብሬ ለዘለዓለም
ዛሬ ግን በምድር ስኖር በዚች ድንኳን
ተስፋ ላርጋት ዘውትር ኢየሩሳሌምን

ቀናትና ወራት አመታትም ሲያልፍ
በቤትህ ውስጥ ስኖር የሱስ ባንተ እቅፍ
አላማዬን ስቼ ሌላ እንዳላይ
አምላኬ አሳየኝ የጽዮንን ራዕይ

ዛሬ ስለ ስምህ ቤት ንብረቴንብተው
በዚህች ምድር ሞቶእጥፍ እንዳገኘሁአውቃለሁ
ለእኔ ግን ከሁሉ ይበልጥ አዋጥቶኛል
ኢየሩሳሌምን መውረስ ይሻለኛል

አዕላፋት መላዕክት እየሰገዱልህ
በአዳዲስ ቅኔ እየዘመሩልህ
ከሚኖሩበት ሰፈር ከኢየሩሳሌም
እርዳኝ የእኔ ጌታ እንድገኝ እኔም
',0),(NULL,'የሚድኑትን በእኛ ላይ ጨምር','Menber2','የሚድኑትን /2/ በእኛ ላይ ጨምር
ጌታ ሆይ የሚድኑትን
ለመንግስተ ሰማይ የተመረጡትን
ለእውነተኛ ወንጌል የሚታዘዙትን

ብርሃንህ አብራ ለፍጥረታት ሁሉ
የምስራቹ ቃል ብዙዎችም ይስሙ
መንገድና እውነት ሕይወትም ነህና
በድንቅ በታምራት የሱስ ኃይልህን አጽና

የዲያቢሎስ ወጥመድ ይሰባበርና
ብዙዎች ይመለሱ ይውጡ ከጨለማ
የመከሩ ጌታ ዛሬም ተነሳና
አሳፍር ጠላትህ ምርኮን ስጠንና

ለሐዋርያት በእጃቸው የሰጠኸውን
በእነርሱ እንዲሰበክ ጌታ ያዘዝከውን
ለትውልድም ሁሉ ያስተላለፉትን
ይታውጅ የሱስ ሆይ የእውነት ወንጌልን

በስምህ ተጠምቀው አንተን እንዲለብሱ
በመንፈስ ቅዱስም በኃይል እንዲሞሉ
የእውነትን መንገድ ጌታ የሱስ ግለጥ
አንድ አምላክ መሆንክን ፍጥረት ሁሉ ይወቅ
',0),(NULL,'እስራኤል ሆይ ስማ','Menber2','እስራኤል ሆይ ስማ
ጌታ እግዚአብሔር አንድ ነው
አንተም አምላክህን በፍጹም ልብህ ውደደው
በፍጹም ነፍስህ ውደደው
በፍጹም ኃይልህ ውደደው
ደስ የሚያሰኘው ይሄ ነው/2*
ቅዱሱንም ማወቅ ማስተዋል ነው/2*

ከጥንትም ጀምሮ ትዕዛዙን የሰጠው
ከእኔ በቀር አምላክሌላ የለም ያለው
ሰማይና ምድርን ብቻውን የፈጠረው
በገናና ክብሩ ዛሬም የሚኖር ነው

በሥጋ ተገልጦ ወደ ምድር መጥቶ
በምስሉም እንደሰው ኢየሱስ ተገኝቶ
ደዌንም የሚያውቅ የሕማም ሰው ቢመስልም
እርሱ ግን አምላክ ነው የሚኖር በክብር

ደም ግባት ባይኖረው የተናቀ ቢሆን
መልኩም ከሰው ልጆች ይልቅ ቢጎሳቆል
ብዙዎች ባያምኑበት ቢዘብቱበትም
እርሱ ግን አምላክ ነው የነበረ ጥንትም

በክብር በግርማ ሲመጣ አምላካችን
አቤት እንዴት ይሆን ስናየው ባይናችን
በመላዕክት ታጅቦ የሱስ ይገለጣል
በዚያን ቀን እግዚአብሔር አንድ 
ስሙም አንድ ይሆናል
',0),(NULL,'ቀንበሬን ከሰባበርከው','Menber2','ቀንበሬን ከሰባበርከው
እስራቴን ከቆራረጥከው
ይኸው ልከተልህ ኢየሱሴ/2*
ሁሉን ጥዬ ሁሉን ትቼ/2* /2/

እንዳገለግልህ ቀንበሬን ሰብረሃል
ቀና ብዬ እንድሄድ ከእስር ፈተኸኛል
እኔም ከእንግዲህ ሁሉን ነገር ጥዬ
እከተልሃለሁ ዘውትር ዝቅ ብዬ

የአዋጅ ነጋሪ አድርገህ እኔን ሾመኸኛል
ወንጌልን ላውራ ቃልህን ሰጥተኸኛል
ከክፉ አለም ጠርተህ ለይተህ የቀደስከኝ
በእኔ ልትሰራ ነው ለራስህ ያደረከኝ

ዳግመኛ ወደ ኋላ ባርነት አልሻም
በኃጥያት ተይዤ አልጠላለፍም
አንተን እየመሰልኩ ልኖር እወዳለሁ
ጌታዬ ኢየሱስ እገዛልሃለሁ

አቤት ጌታ ኢየሱስ መውደድህ ድንቅ ነው
በእኔ ልትከብር እንዲህ የፈቀድከው
ከዚህ ሁሉ ታአምራት ከተደረገልኝ
ጥቂት እንኳን እኔ የማይገባኝ ነኝ
',0),(NULL,'ከታናሽነቴ ጀምረህ አስተማርከኝ','Menber2','ከታናሽነቴ ጀምረህ አስተማርከኝ
በሕይወት ጎዳና የመራኸኝ
በክንፎችህ ጥላ ሸሽገኸኝ
እስከ አሁን በቤትህ የጠበከኝ
ኢየሱስ ሆይ ተመስገን ተመስገንልኝ/2*

የአለማወቅን ወራት በአንተ ድጋፍ አለፍኩ
ምህረትህ እየረዳኝ እስከዚህ ቀን ደረስኩ
ደምህ አጥር ሆኖኝ ስምህ እያጸናኝ
ተመስገን አምላኬ በቤትህ አለሁኝ

አንዳንዴ በድካም አንተን ባሳዝንህም
ከቶ መቼ ጠፋኝ በዝቶልኛል ያንፍቅር
መንፈስህ ዘወትር በውስጤ እያፈሰስክ
አረካሃት ነፍሴን የሱሴ ተወደስ

ከስውር የጠላት ፍላፃ አምልጫለሁ
ኢየሱስ ጋርደኸኝ እስከ አሁን ቆሜአለሁ
ይህን ሁሉ እንዴት አለፍኩህ እያልኩኝ ስደነቅ
ምህረትህ ነው እንጂ አይደለም በእኔ ጽድቅ

ሕግህ ለእግሬ መብራት ለመንገዴ ብርሃን
ሆነልኝ የሱሴ እንድከተል አንተን
በቤትህ መኖሬ ለእኔ እጅግ ጠቀመኝ
አተረፍኩኝ እንጂ ምንም አልጎደለኝ
',0),(NULL,'ለእኔ ያረከው ድንቅ ታምራትህን','Menber2','
ለእኔ ያረከው ድንቅ ታምራትህን
አየሁ አምላኬ ግሩም ክንድህን
አይቼሃለሁ ኤልሻዳይ ነህ/2*
አይቼሃለሁ ሁሉን ቻይ ነህ/2*
ብርታትህ ልዩ ነው /2*
ምንም አይሳንህ/2*   /2/

የሙሴ አምላክ ስትባል ሰማሁ
የኤልያስ አምላክ ስትባል ሰማሁ
የዳንኤል አምላክ ስትባል ሰማሁ
እኔም በአይኔ ዛሬ ሥራህን አየሁ

ነፍሴን በሕይወት አኑረሃታል
እግሬን ለመናወጥ ከቶ አልሰጠህም
ከአሰብኩት በላይ አርገህልኛል
ሥራህ ኢየሱሴ አስደንቆኛል

በጠላቴ ፊት ጽኑ ግንብ ሆንከኝ
በአለትም ላይ ከፍ ከፍ አረከኝ
ታምራትህን አምላኬ አየሁኝ
ከሞት መውጣትን ባንተ መሆኑን አወኩኝ

ተስፋ እንደሌለው ከእንግዲህ አላዝንም
አይቻለሁና ታላቅ ማዳንህን

አምላኬ ስልህ ደርሰህልኛል
በድል በምርኮም አሜን መልሰኸኛል
',0),(NULL,'ምስጋና አዲስ ምስጋና','Menber2','ምስጋና አዲስ ምስጋና/2*
ይገባሃል
ምህረትህን በእኔ ላይ አብዝተሃል
ኢየሱስ ዛሬም አዲስ ምስጋና ይገባሃል
ፍቅርህን በእኔ ላይ አብዝተሃል
ኢየሱስ ዛሬም አዲስ ምስጋና ይገባሃል

ጊዜና ዘመናት አንተን አይለውጡህ
ዛሬም አልተለየኝ ኢየሱስ ሆይ ምህረትህ
ለፍቅርህ መለኪያ መመዘኛ የለው
እንድያው በምስጋና ስምህን ልባርከው

ጨለማ ኑሮዬ በብርሃንህ ተገፏል
መራራ ሕይወቴ በደስታህ ተሞልቷል
ትላንት ላደረከው ዛሬም ለምትሰራው
ኢየሱሴ ምስጋና እሰዋልህአለሁ

ኃይሌን እንደ ንስር አድሰህልኛል
እጆቼን በአለት ላይ አጽንተህ አቁመሃል
ታምራት ኃይልህን ሥራህን አወራለሁ
አፌን በምስጋና ዛሬም እከፍታለሁ

አቤቱ በጋሻህ በሞገስህ ከልለህ
ዛሬም አለሁ ይኸው ኢየሱስ ሆይ በፊትህ
በአደባባይህ ላይ በምህረትህ ቆሜ
ከፍ ከፍ ላድርግህ ዛሬም ደጋግሜ
',0),(NULL,'ምስጋናን ልሰዋ','Menber2','ምስጋናን ልሰዋ ቆሜአለሁ በፊትህ
ውለታህን ልነግር በአደባባዮችህ
እኔ ዝቅ ብዬ ክብርን ለአንተ ልስጥህ
የለምና ኢየሱስ ለአንተ የሚከፍልህ

በምስጋና ልቅረብ ወደ ፊትህ ጌታ
ተነግሮ አያልቅም ኢየሱስ ሆይ ውለታህ
ክብሬን አዋርጄ እኔ አንተን ላክብርህ
የለምና ኢየሱስ ለአንተ የሚከፈልህ


አቤቱ ጉልበቴ ኃይልም ሆነኸኛል
ክንድህ ድጋፍ ሆኖኝ እስከ አሁን አቁሞኛል
ኃይልን አስታጠከኝ ወገቤ ቀናልኝ
እኔም ለውለታህ ኢየሱስ ምስጋና አለኝ

ክብሬና አለኝታዬ አንተ ነህ ኢየሱሴ
ዋስ ጠበቃ ሆነህ ቆምክላት ለነፍሴ
ዝም ልል አልችልም ውለታህ አለብኝ
ዘውትር አወራለሁ ስላደረክልኝ

አፌ ምስጋናህን ዘውትር ይናገራል
ለእኔ የሠራኸው መች ተወርቶ ያልቃል
የሕይወቴ ጌታ ነህ ምንስ እልሃለሁ
የልቤን መስዋዕት ምስጋናን ሰዋለሁ
',0),(NULL,'ኢየሱስ','Menber2','ኢየሱስ/2* ስምህን ስጠራው
ደስ ይለኛል
ከማር ወለላ ይልቅ ይጣፍጣል
መልካም መአዛ እንዳለሁ ሽቱ ነው
ጌታ ኢየሱስ ስምህ ለእኔ እጅ ድንቅ ነው

ስምህ ለእኔ ኢየሱስ የጸና ግንብ ነው
ወደ አንተ ቀርቤ ፈውስን አግኝቻለሁ
በስምህ ታምኜ ኢየሱስ ስጠራህ
አላሳፈርከኝም ጸሎቴን ሰምተሃል

ጋሻና ጦሬ ነው ስምህ መዋጊያዬ
ከከበበኝ ጠላት ያዳነኝ ጌታዬ
በስምህ ልጓደድ ክንድህን አይቻለሁ
ኢየሱስ ሆይ ጠርቼህ መች ተሸንፌአለሁ

እባብና ጊንጡን የምረግጥበት
የአስጨናቂውን እራስ የምቆርጥበት
ስምህ ነው ኢየሱስ በድል ዛሬ ያቆመኝ
ከአሸናፊዎች በላይ እኔን ያደረገኝ

መዳን በሌላ ፈጽሞ አይገኝም
ከስምህ በስተቀር አዳኝ ስም የለም
ጉልበትን በሙሉ የሚያንበረክክ ነው
ስምህን ዘወትር እኔም ላመስግነው
',0),(NULL,'ሥራህ ግሩምና ድንቅ ነው','Menber2','ሥራህ ግሩምና ድንቅ ነው
ታውቀዋለች ነፍሴ
አለም ባትገነዘብህ
ለእኔ ግን ልዩ ነህ ኢየሱሴ
ለእኔ ግን ውድ ነህ ኢየሱሴ
ታውቅሃለች ነፍሴ

በብርሃንህ ብርሃንን አይቻለሁ
ጨለማዬን ገፈህ ነፃ ወጥቻለሁ
አለም አንተን ባታውቅ ባታከብርህም
ለእኔ ድንቅ አምላክ ነህ 
ኢየሱስ/ጌታ/ አንተ አንተ ሁን/2*

አይኔ አየች ታምራትህን ድንቅ ሥራህን
ማንም ያላየውን የሰማይ በረከትን
ነፍሴ በጥም ዝላ ወድቃ ስታገኛት
መንፈስህን አፍስሰህ ኢየሱስ አረካሃት/2*

ለብዙዎች መንፈሰ ደካማ እጅግ ምስኪን
ኢየሱስ ግን ሆነሃል ለአለም ሁሉ መድህን
ግንበኞች ቢንቁህ ክብር ባይሰጡህም
ለእኔ ግን ለነፍሴ ኢየሱስ እንዳንተ የለም/2*

ፍቅርህ ኢየሱስ እኔን ሳበኝ ውለታህ በቃኝ
ከገመትኩት በላይ ምህረትህበዛልኝ
ለውለታህ ዋጋ የለም የምከፍልህ
በልቤ ዙፋን ላይ ኢየሱሴ/አምላኬ/ ላንግስህ/2*
',0),(NULL,'ጽዮን ሆይ ተነሺ','Menber2','ጽዮን ሆይ ተነሺ/2*
ኃይልሺን ልበሺ ተነሺ
ጌጠኛ ልብስሺን ልበሺ
ትቢያ ከላይሽ ላይ አራግፊ
እልል እልል በይ ዘምሪ ላምላክሽ
ማቅሺን ቀዳዶ ደስታን ላስታጠቀሽ

አታፍሪምና አደንግጪ አትፍሪ
ብርሃንሽን አብሪ የምስራች ተናገሪ
በክንፉ ጥላ ነው ጌታ ኢየሱስ የጋረደሽ
በጸና ቃል ኪዳን የወደደሽ ያከበረሽ

በእጁ መዳፍ ነው ጌታ ኢየሱስ የቀረጸሽ
በማይሻረው ሕያው ቃሉ የማለልሽ
በእግዚአብሔር እጅግ ብርሃን ትኖሪያለሽ
ለአህዛብ ጽድቅሽ ለነገስታትም ይታያል ክብርሽ

ብርሃንሽ ወጥቷል የእግዚአብሔር ክብር ወጥቶልሻል
ተነሺ አብሪ ጌታ ኢየሱስ በአንቺ ላይ ከብሯል
በቀኝ በግራሽ አስፍቶሻል አብዝቶሻል
እልል በይ ጌታ አምላክሽ በአንቺ ነግሦአል

እግዚአብሔር ክብርሽ የዘለዓለም ብርሃንሽ
ቀንና ሌሊት ይኖራል በአንቺ እያበራልሽ
የሐዘን የለቅሶ ዘመኖችሽን አስወግዶ
በዘይቱ ቀባሽ ማቅሽን ሁሉ ከአንቺ ቀዶ
',0),(NULL,'የክብር ንጉስ','Menber2','ይህ የክብር ንጉስ ማን ነው ብርቱና ኃያል
ይህ የክብር ንጉስ ማን ነው በሰልፍም ኃያል
ብርቱና ኃያል ኢየሱስ በሰልፍም ኃያል ነው /2*
የጭፍሮች አምላክ ኢየሱስ እርሱ አሸናፊ ነው/2*

የእስራኤል አምላክ ነው ክንደ ብርቱ
ዛሬም አሸናፊ እንደ ጥንቱ
በምድር ዙሪያ ሁሉ የተፈራ ነው
የሚመስለው የለም የሚወዳደረው

በጸናች እጅ በተዘረጋ ክንድ
የከፈለው የኤርትራን ባህር
የፈርዖን ሠራዊት ያሰጠመው
ሕዝቡንም በድል የመራ አምላክ ነው

የሥራው ብርታት ያሳየው
ስሙ የተፈራ የገነነው
በዙሪያው ባሉት ላይ ታላቅ ግሩም ነው
የኃያላን ኃያል አሸናፊ አምላክ ነው

እርሱን የሚስተካከል የትኛው ነው?
ከአማልክትስ የሚመስለው ማን ነው?
ሥልጣንና ኃይልን ብቻውን ይዟል
ብርቱና ኃያል ነው ክብር ይገባዋል
',0),(NULL,'ዛሬም አለኝ ምስጋና','MesertB1','ዛሬም አለኝ አለኝ ምስጋና/2*
በሸለቆም ቢሆን በተራራ
ኢየሱስ ስላለህ ከእኔ ጋራ

ክብር ክብር ክብር
ክብር በሰማይ በምድር
ክብር ከፀሐይ መውጫ
ክብር እስከ መጥለቂያዋ
ክብር ለአንተ ይሁን ኢየሱስ
ክብር በምድር ሞላዋ

የአንደበቴን እልልታ የልቤን ምስጋና
አቀርባለሁ ላንተ ኤልሻዳይ ነህና
የሰማይ የምድር የሁሉ ፈጣሪ/2*
ኢየሱስ አንተው ነህ እሩሩህ መሃሪ/2*

በለምለም መስክ ላይ በምድረ በዳ ውስጥ
ፈቅጃለሁ ኢየሱስ ክብርን ላንተ ልሰጥ
አይጓደልብህ ውዳሴ ምስጋና /2*
በእሳት በባህር ውስጥ መንገድ አለህና/2*

አሁንስ ለየልኝ ጠፋው ባልኩኝ ጊዜ
ምህረትህ ረዳኝ ቆምኩኝ ቃልክን ይዤ
አየሁኝ ማዳንክን ተረዳው ምረትክን/2*
ለእኔ ያረከውን ቸርነት ፍቅርህን/2*


ተስፋ ቁረጥ ሰይጣን እፈር ጠላቴ
ልትለየኝ አትችልም ከመድኃኒቴ
ሸለቆ ውስጥ ብወርድ ብወጣም ተራራ/2*
አጠናጥናለሁ የቀድሞውን ሥራ/2*
',0),(NULL,'ዝም ልል አልችልም','MesertB1','ዝም ልል አልችልም/4*
ዝም ልል /4*
ፍቅሩ ግድብሎኛል ውለታው ማርኮኛል
ተመስገን ኢየሱስ ክበር ያሰኘኛል
  /2/

አዋቂ ነን ባዮች አጥብቀው ቢያዙኝም
ደግመሽ የኢየሱስን ስም አትጥሪ ቢሉኝም
ያዳነኝ የሱስ ነው እኔ እናገራለሁ/2*
ዝም በይ ቢሉኝስ መቼ እሺ እላለሁ/2*

አስራ ሁለት አመት ሙሉ ስሰቃይ ኖሬአለሁ
አሁን ግን በእምነት ልብሱን ነክቻለሁ
ስነካው ነክቶኛል ኃይል ከእርሱ ወጥቶ/2*
ያዳነኝ የሱስ ነው ልቤን እምነት አይቶ/2*

ጻፎችና ፈሪሳውያን ከሰው አቀረቡኝ
እንደ ሙሴ ዘመን በድንጋይ ሊወግሩኝ
ደግመሽ ኃጥያት አትስሪ ምሬሻለሁ ብሎ/2*
ኢየሱስ ነፃ አወጣኝ ከሳሾቼን ጥሎ/2*

እባካችሁ ሰዎች ምን ነካት አትበሉ
ስዘል ሳሸበሽብ ስዘምር ስታዩ
ውለታው ልቤ ገብቶ በደስታ ሞልቶኛል/2*
አመስግኚው አመስግኚው ዝለይ ያሰኘኛል/2*
',0),(NULL,'ጉልበቴን ለአንተ ','MesertB1','አብርሃም ሳይወለድ ጥንትም አንተ ነበርህ
ታላላቅ ታምራት ድንቅን እየሰራህ ድንቅ ሥራ እየሰራህ
ሰማይና ምድርን በቃል የፈጠርከው
ኢየሱስ አንተ ነህ ሰውን ከምድር አፈር በአምሳል ያበጀኸው/2*

ጉልበቴን ለአንተ አሜን አሜን አስገዛለሁ
ነፍሴን በፊትህ አሜን አሜን አፈሳለሁ
አውቄሃለሁ ኢየሱስ አምኜሃለሁ
አንተ የጥንቱ አምላክ መሆንህን ተረድቻለሁ
አውቄሃለሁ ኢየሱስ አምኜሃለሁ
ልቤን በአንተ ላይ አንተ ላይ አሳርፌአለሁ

ያገለግለኝ ዘንድ ሕዝቤን ልቀቅ ያልከው
በሙሴ አንደበት ለፈርኦን የነገርከው/2*
ኃይልህን ደጋግመህ ገልጸህ ያሳየኸው
ኢየሱስ አንተነህ በድንቅ በታምራት ሕዝብህን የመራኸው/2*

ዘመንህ ሲደርስ አማኑኤል የሆንከው
ቃልን ሥጋ አድርገህ ወደ ምድር የመጣኸው/2*
የዘላለም አባት ኃያል አምላክ የሆንከው
ኢየሱስ አንተ ነህ በክብርከፍብለህነግሰህየምትኖረው/2*

በሥጋ ተገልጠህ በምድር ስትመላለስ
ታይታል ተዳሰሃል ስትሰራ ስትፈውስ/2*
አለምን ከራስህ ጋር በደምህ ያስታረከው
ኢየሱስ አንተ ነህ የጥሉን ግድግዳ በሥጋህ ያፈረስከው/2*
',0),(NULL,'ወደ አንተ ልቅረብ','MesertB1','አቤቱ ልቤ እንዳይታበይብኝ
አይኖቼም ኢየሱስ ከፍ ከፍ እንዳይሉብኝ
ሁልጊዜ በተሰበር ልብ /2*
ወደ አንተ ልቅረብ በምስጋና/2*  /2/

ቀና ቀና ማለት ያጠፋኛልና
ልቤን ስበርልኝ ኢየሱስ የእኔ ጌታ
በማስተዋል ልጓዝ አንተን አስቀድሜ
በቀናው መንገድህ ልሂድ ተከትዬ

ከላይ ሲፈስልኝ የፀጋ ስጦታ
በምህረትህብዛትበረከትሲመጣ
ልቤ እንዳይታበይ ሥጋዬ እንዳይኮራ
ከአንተ ነው ማለትን ልወቅ የእኔ ጌታ

ለነፍሴ እንቅፋት እንዳይሆን ሥጋዬ
በመንፈስህ ግዛው ኢየሱስ ጌታዬ
የተዋረደውን ከፍ ከፍ ታደርጋለህ
በከበረ ስፍራ ታስቀምጠዋለህ

ላክብርህ ኢየሱስ በሰራኸው ሥራ
በድንቅ በታምራት ከእኔ ጋር ነህና
የምህረት አይኖችህ ይከተሉኝ እኔ
ዘውትር ልስገድልህ ልቀኝልህ ቅኔ
',0),(NULL,'ዘመን አልፎ','MesertB1','ማለዳ ማለዳ አዲስ ነው
ታማኝነቱ የኢየሱስ ብዙ ነው/2*
ዘመን አልፎ ዘመን ቢተካ/2*2
ፍቅሩ ያው ነው አሁንም ቢለካ*2 /2

ኃይሉን እያሳየ ታምር እየሰራ
ከሙሴ ጋር ሆኖ እስራኤልን የመራ/*2
እስከ አለም ፍፃሜ ከእናንተ ጋር ነኝ ያለው
ለዘንድሮ አበቃን አምናን አሳለፈው/*2

አቤት የአምላክ ፍቅር ምንኛ ጥልቅ ነው
ለውለታው መጠን መለኪያ የሌለው/2*
በትውልዶች መሃል በየዘመናቱ
አያልቅም የኢየሱስ ምህረት ቸርነቱ/2*

ሰው አስቦ ከሰራው ኃጥያት ቢመለስ
በንስሃ ቀርቦ በፊቱ ልቡን ቢያፈስ/ 2*
ቀድሞ ሰለወደደን ክቡር ደሙን እስከማፍሰስ
የፍቅር አምላክ ነው ይምራል ኢየሱስ/2*

በሕይወት የዛለውን ፈጥኖ እየደገፈ
በተዘረጋ ክንድ በፍቅር እያቀፈ/2*
ለደካማው ብርታት ጉልበት ይጨምራል
የሟቹን ሞት ሳይፈቅድ በሕይወት ያኖራል/2*
',0),(NULL,'ኢየሱስ ሆይ','MesertB1','ኢየሱስ ሆይ ሁሉን ማድረግ ትችላለህ
በአራተኛው ክፍል በሌሊት ውስጥ ትመጣለህ
ለደረቀ አጥንት የሕይወት ሽታ ትሰጣለህ
ምድረ በዳውንም እንደኤደን ገነት ታለመልማለህ

በምድረ በዳ ውስጥ ምንም በሌለበት
ከደረቅ ዛፍ በቀር በማይታይበት
ታላቅ ማዳንህን በዚያ አሳይተሃል
ለእስራኤልያውያኖች ምግባቸውን ሰተሃል
የሰማይ ደጅ ከፍተህ መናን አዝንበሃል/2*
ስንቅ እስኪተርፋቸው አጥግበህ መግበሃል

በጭራሽ በፍፁም ማይታሰበውን
ከሰው ልጅ አእምሮ በላይ የሆነውን
ግሩም ድንቅ ስራህን ሰርተህ አሳይተሃል
አራት ቀን የሆነውን ሙት አስነስተሃል
አስገራሚ ነው ኃይልህ አስደናቂ ነው/2*
ጠቢብ ነኝ ለሚለው አፍ የሚያዘጋ ነው

እንዲያው ምን ይባላል ምንስ ይነገራል?
ኢየሱስ የሠራኸው መች ተነግሮ ያልቃል
ማዳንህን ያየ የቀመሰ ያውቀዋል
እኔስ ለመዘርዘር ቃላት ያጥርብኛል
ምስጋናህ ከጽዮን ከአደባባዮችህ/2*
እንደ ብዙ ውሆች ከሩቅ ያስተጋባልህ
',0),(NULL,'በሰው ከመታመን ይልቅ','MesertB1','በሰው ከመታመን ይልቅ
በኢየሱስ መታመን ይበልጣል
በሰው ከመደገፍ ይልቅ
በእግዚአብሔር መደገፍ ይሻላል  /2/

ከኃይል ሁሉ በላይ ግሩም ኃይል የያዘው
ቸር ወዳጅ እያለ ሁሉ የሚቻለው
እንደጠዋት ጤዛ የሚረግፈውን ሰው
ከንቱ ሥጋ ለባሽ ተስፋ እንዳታደርገው

የምድር ሥልጣኑን እውቀቱንም አይተህ
ሥጋ ለባሹን ሰው አታድርገው ክንድህ
የሰውን ሁሉ ነፍስ ኢየሱስ ይዞታል
ድንገት ሳያስበው ሊነጥቀው ይችላል

የልብህን ሸክም ችግርክን ያውቀዋል
የራስህን ጸጉር በቁጥር ይዞታል
ብቻውን ታምራት የሚያደርገው ኢየሱስ
ከጭንቀት ከደዌ ይችላል መፈወስ

በሰማያት ሰማያት በዙፋን ላይ ያለው
አምላክህ ኢየሱስ ሁሉን ቻይ ጌታ ነው

ከሰው ልጆች ይልቅ በምክሩ ግሩም ነው
',0),(NULL,'በሰው ከመታመን ይልቅ','MesertB1','በሰው ከመታመን ይልቅ
በኢየሱስ መታመን ይበልጣል
በሰው ከመደገፍ ይልቅ
በእግዚአብሔር መደገፍ ይሻላል  /2/

ከኃይል ሁሉ በላይ ግሩም ኃይል የያዘው
ቸር ወዳጅ እያለ ሁሉ የሚቻለው
እንደጠዋት ጤዛ የሚረግፈውን ሰው
ከንቱ ሥጋ ለባሽ ተስፋ እንዳታደርገው

የምድር ሥልጣኑን እውቀቱንም አይተህ
ሥጋ ለባሹን ሰው አታድርገው ክንድህ
የሰውን ሁሉ ነፍስ ኢየሱስ ይዞታል
ድንገት ሳያስበው ሊነጥቀው ይችላል

የልብህን ሸክም ችግርክን ያውቀዋል
የራስህን ጸጉር በቁጥር ይዞታል
ብቻውን ታምራት የሚያደርገው ኢየሱስ
ከጭንቀት ከደዌ ይችላል መፈወስ

በሰማያት ሰማያት በዙፋን ላይ ያለው
አምላክህ ኢየሱስ ሁሉን ቻይ ጌታ ነው

ከሰው ልጆች ይልቅ በምክሩ ግሩም ነው
በዘመንህ ሁሉ እርሱን ተማመነው
',0),(NULL,'መንፈሴ ታደሰ','MesertB1','አወኩት ለየሁት የእውነትን አምላክ አገኘሁት
እውነትና መንገድ ሕይወት የሆነውን/2*
የሱስን አውኩት ለእኔ የሞተውን/2*

መንፈሴ ታደሰ ጉልበቴም ደግሞ ጸናልኝ
ለእኔስ የኢየሱስ ስም ኃይሌ ሞገሴ ሆነለኝ
አይኔ በጠላቶቼ ላይ ተገልጦ አየልኝ
ቀንዴ በአምላኬ ከፍ ከፍ ከፍ ከፍ ከፍ አለልኝ

ቃሉን ልኮ ፈወሰኝ ስሙ መድሃኒት ሆነልኝ
ስባዝን ስናውዝ ስንከራተት አይቶኝ/2*
በእውነት አምድ ላይ በድል መንገድ መራኝ/2*
ተጋፍቼ/2* ነክቼዋለሁ እጄን ዘርግቼ
የሕይወት እራስን ኢየሱስን ይዣለሁ/2*
አልቀውም ከእንግዲህ በስሙ ድኛለሁ/2*

በረታሁ/2* ኃይልን ከሰማይ አገኘሁ
ከውሃና ከመንፈስ ዳግም ተወልጃለሁ/2*
ኢየሱስን በጥምቀት በእምነት ለብሼዋለው/2*

',0),(NULL,'ሊያበዛህ ሊባርክህ','MesertB1','የቃል ኪዳን አምላክ በቃሉ ታማኝ ነው
ከአፉ ለወጣው ቃል የሚተጋ አምላክ ነው
የገባልህን ተስፋ የሱስ ይፈጽማል
እንደምድር አሸዋ ገና ያበዛሃል/3*
እንደተስፋ ቃሉ አብዝቶ ይባርክሃል

ሊያበዛህ ሊባርክህ ቃል ገብቶልሃል አምላክህ
የረገጥከውን ሥፍራ ሁሉ ኢየሱስ ሊያወርስህ
አመስግነው/3*
ምታመልከው አምላክ ኢየሱስ ሁሉን ቻይ ነው

ተራራ ኮረብታን ኢየሱስ ያፈርሰዋል
ጠማማውን ሁሉ እርሱ ያቃናዋል
የአብርሃም አምላክ ከአንተ ጋር መሆኑን ስያዩ
አህዛብ በሙሉ ወደአንተ ይጎርፋሉ/3*
በመንፈስ በእውነት ለኢየሱስ ይሰግዳሉ

የዕውሮችን አይን ኢየሱስ ይከፍታል
ለደንቆሮ ጆሮ ምስራችን ያሰማል
አህዛብ በአምላክህ እሱን ይታመናሉ
እውነተኛውን አምላክ ኢየሱስን ያውቃሉ/3*
እውነትንየሳቱማስተዋልያገኛሉ

በእሳት ውስጥ ስታልፍ ነበልባል አይፈጅህም
በወንዞች ውስጥ ስትሄድ ከቶ አያሰጥምህም
ተቤዥቼሃሁ አንተ የእኔ ነህ ብሎሃል
በጽድቁ ደግፎ ኢየሱስ ይይዝሃል/3*
የሰላሙን ቃልኪዳን ለዘርህም ይሰጣል
',0),(NULL,'ልሰዋ ምስጋና','MesertB1','እስቲ ልነሳና ልሰዋ ምስጋና ምስጋና
ለሠራልኝ ሁሉ ባይሆንም ዋጋ ባይበቃም
እኔ ግን ማልጄ ልነሳ ልሰዋ ለኢየሱስ ምስጋና/2*

ማህተሙን ለፈታው አንበሳ
ሞትና ሲኦልን ድል ለነሳ
ማለዳ በፊቱ ቆማለሁ
ፈቅጄ ምስጋናን ሰዋለው

መሰንቆ ሆይ ተነስ በገና
ክብርን ልስጥ ለሆነው ገናና
ልዘምር ከክብሬ ልነሳ
ላንግሰው ባማር አዲስ ዜማ

ከአመድ ከትቢያ ላይ አነሳኝ
ኢየሱስ አምላኬ ወደደኝ
አላማው በእኔ ላይ ፍቅር ነው
ፍቅሩም የበረታ ጠሊቅ ነው

ክብር ለአማልክቶች አልሰጥም
አምላክ ናቸው ብዬም አልሰግድም
እግዚአብሔር ዙፋኑ በሰማይ ነው
ክብሩምከሰማያትበላይነው

አለም ሳይፈጠር ያወቀኝ
ከእናቴ ማህፀን የለየኝ
ሕያው ቃሉን ልኮ ያዳነኝ
በደሙ የገዛኝ ልጁ ነኝ
',0),(NULL,'ይውረድ መሰንቆዬ ','MesertB2','ላመስግነው እንጂ ደግሜ ደግሜ
ትካዜዬን ሁሉ በአምላኬ ላይ ጥዬ
ሥራዬ እርሱን ማምለክ መዘመር ነውና
ከተሰቀለብት ይውረድ መስንቆዬ እንደገና /2/
እግዚአብሔር ዓላማዬ ነው/2
ያህዌህንሲ/4  እግዚአብሔር አላማዬ ነው /4x

እኔ ሳመሰግን ስዘምር እዚጋ/2
ታላቅ ቅጥር ይፈርሳል ይናዳል እዛጋ/2 ሆሆ
አውቅበታልሁ በገናን መደርደር
በእውነት በመንፈስ ለእርሱ መዘመር ሆ
ድንገት በሚሆን እንግዳ አሰራሩ
ታምር ይሰራል ጉልበታምስሙ/3 ሆ
ታምር ይሰራል የኢየሱስ ስሙ/2
ወደር የለውም ድንቅ ነው ኃይሉ/2

ሆ ልበል ልዘምር የድል ድምጽ ላሰማ/2
ደስ በሚሰኝበት በቅኔ ቃል ዜማ/2 ሆሆ
በውጊያው መሃል በጦርነቱ
እኔ ስዘምር ስለምህረቱ ሆሆ
በጠላቴ ላይ ድብቅ ጦር ልኮ
ጌታ ያወርሰኛል ያን ታላቅ ምርኮ/3 ሆ…
በእጄ ጦር ሳልይዝ ጋሻና ጭሬ/2
አሸንፋለሁ በአምልኮ መንፈስ በዝማሬ

ባህር የሚከፍል አለት የሚሰነጥቅ/2
በእጄ አስዞኛል ያን የሙሴን በትር 2ሆሆ
እጓደዳለሁ በኃያል ስሙ
ትምክህቴ እኮ ነው ያ ክቡር ደሙ ሆሆ
እሻገራልሁ እወዲያ ማዶ
አሁን ልዘምር ላንሳ ከበሮ /3 ሆ
የፀሎቴ መልስ ይመጣል ማልዶ/ፈጥኖ/2
ለእኔ ይሰማኛል የአምላኬ ድምፅ/2
ልቤን በደስታ ቃሉሲሞላ2
ለእንቆቅልሼ ሲነግረኝ መላ/2
',0),(NULL,'እንግዲህ ምን እላለሁ ','MesertB2','እንግዲህ ምን እላለሁ/2*
እጄን በአፌ ጭኜ በልቤ ምስጋና/2*
በደስታ አነባለሁ/2*
አነባለሁ በምስጋና
አነባለሁ የደስታ እንባ
አነባለሁ እያሰብኩኝ
አነባለሁ የአምላኬን ሥራ

ፀሐይዋ ጠልቃለች ቀኑም አመሻሽቷል
እያልኩኝ ረዳቴ ከወዴት ይመጣል
ረዳቴ ከሰማይ ድንገት ከተፍ አለ
ያስፈራኝ ጨለማም ደማቅ ብርሃን ሆነ /2/
አፍታም አልቆየበት ሲሰራ ኢየሱስ
አላሳልፍ ያለኝ ያሪኮዬን ሲያፈርስ /2/

እኔ ግን ይሄንን ይህን ብቻ አውቃለሁ
ውሃውን እየቀዳሁ ጋኑን ሞልቻለሁ
እንጃ ምን አውቃለሁ እንዴት እንዳደረገው
ውሃውን ወይን ጠጅ አድርጎት አይቻለሁ
ምን ልበለው ጌታዬን ምን ልበለው
ምን ልበለው ኢየሱስን ምን ልበለው /2/

በምን አንደበቴ ኧረ በምን ቋንቋ
እንዴት ላመስግነው ልቤ እንዲረካ
ውብ አደራረጉን ታምሩን ለመግለጽ
ሺህ ቃል ቢደረደር መቼም የልቤ አይደርስ /2/
አልወጣልሽ ቢለኝ አመስግኜ አመስግኜ
በደስታ አለቅሳለሁ እጄን ባፌ ጭኜ /2/

የእምነት ባለፀጋ ጽኑ ሰው ሊያደርገኝ
በምድረበረሃ አርባ አመት ሲያስጉዘኝ
አንድ እንኳን ሳይጎለኝ አንድ እንኳን ሳላጣ
ከጭንጫ አለት ውስጥ ውሃን እያጠጣ
ምን ልበለው….
',0),(NULL,'የሚሳነው የለም','MesertB2','የሚሳነው የለም የሚሳነው/2*
የሚያቅተው የለም የሚያቅተው/2*
የአምላኬን ግሩም ኃይል አይቻለሁ
ለእኔ ሲመስለኝ ሲመስለኝ/2*
ማዕበል ወጀቡ ሚያሰጥመኝ
ልቤም በፍርሃት ሲርድ
ደርሶ አዳነኝ በጸናች ክንድ

ፈረሱንና ፈረሰኛውን
በባሕር ጥሎ የሚያሳድደኝን
የስሙ ሥልጣን ኃይሉን ሊያሳየኝ
ባህሩን ከፍሎ በየብስ አሳለፈኝ
አሳለፈኝ ጠሊቁን ባህር ደረቅ አርጎልኝ /2/

ተወኝ ኢየሱሴ ብዬ ነበረ
ሸክሜ በላዬ ስለ ከበደ
አለማመኔ ይህ ድካሜ ነው
ዛሬም ኢየሱስ ክንደ ብርቱ ነው
ዛሬም ኢየሱስ ጸሎት ሰሚ ነው
መልስን በእሳት የሚመልስ ነው/2/
ከሁሉ በላይ የሚያስገርመኝ
ኃጥያቴን ከድኖ ምስጉን ነሽ ሲለኝ
መች በእኔ ብቻ በእኔ ያበቃል
ዘሬ ትውልዴ ይገዛለታል
ዘሬ ትውልዴ ቤቴ በደስታ ይገዛለታል /2/

ለሰሚው ግራ ለሚያየው ትንግርት
ባዶ ማሰሮዬ ሲሞላው ዘይት
እንኳንስ ለሰው ለእኔው ገርሞኛል
አደራረጉ አስደንቆኛል
አስደንቆኛል እዳዬን ከፍሎ ነፃ አውጥቶኛል /2/
',0),(NULL,'አቤት ፍቅርህ','MesertB2','ምድርን ስታይ ስትመለከታት
በኃጥያቷ እጅግ ረክሳ ስለአየሃት
ያለ እኔ ለዚህ ሕዝብ ማን አለ ብለህ
ወደ ምድር ወረድክ ቃልህን ሥጋ አድርገህ

አቤት ፍቅርህ /2/
ስቦ አወረደህ ፍቅር አቤት ፍቅርህ
ዙፋን አስጣለህ ፍቅርህ አቤት ፍቅርህ /2/*

አቤት ፍቅርህ ኢየሱስ/አምላኬ አቤት ፍቅርህ/2*
ወደርና አቻ የሌለው ፍቅርህን
የሱስ እኔስ ያንተን ብቻ አየሁ /2/

በእኔ ርኃብ ጥማት እናንተ እርኩልኝ
በግርፋቴም ቁስል ተፈወሱልኝ
ብለህ መጥተሃል ኃጥያተኛን ወደህ
ዓለምን ከራስህ ጋር ልታስታርቅ ፈቅደህ

እንወድህ ዘንድ ደም ግባት የሌለህ
በሰው የተጠላህ የተናቀም ሆነህ
እኛን አከበርክ አንተ ተዋርደህ
ግን የመልክ የውበት ፈጣሪ አንተ ነህ
ሁሉን ቻይ አምላክ የፍጥረት ንጉስ
ሆነህ እያለህ የእስራኤል ቅዱስ
ጋኔን አለበት አብዷልም ተባልክ
ሕመምተኞችን ሽባን በፈወስክ

መስቀል ሲሰቅሉህ በጭራሽ አልዛትክም
የዋህነህ ኢየሱስ በቀል አላሰብክም
አደንቃለሁ ፍቅርህን አደንቃለሁ /4/
ምናልባት ስለ ቸር ሰው የሚሞት ይገኛል
ኢየሱስ ግን ስለ እኔ ስለ ኃጥያቴ ሞተሃል
አደንቃለሁ ፍቅርህን አደንቃለሁ/4/ 2
',0),(NULL,'አወራለሁ በአደባባይ ላይ ቆሜ','MesertB2','አወራለሁ በአደባባይ ላይ ቆሜ
እናገራለሁ ድምጼን ከፍ አድርጌ
አንድ ጌታ አንድ ሃይማኖት አንዲት ጥምቀት
የምትል ነች እውነተኛይቱ መንገድ /2/

በሲና ተራራ በክብሩ የታየው
ከእኔ በቀር አምላክ አይሁንልህ ያለው
የህይወት ቃል ሆኖ ጨለማን የሚያበራ
እርሱ ነው ኢየሱስ አንዱ አምላክ ጌታ
ወንድሜየቀደመችውንመንገድጠይቅ
መልካሚቱንምያዝ
እውነትን /3/ ግዛትአትሽጣት /2/

ከሰማይ ሰማያት ከዙፋኑ ወርዶ
የመለኮት ሙላት ክርስቶስ ውስጥ ሆኖ
ታየ ተዳሰሰ ተገልጦ በስጋ
ፊተኛው ኋለኛው አልፋና ኦሜጋ
አንድ 5* /2/
አንድ ጌታ አንድ ሃይማኖት …

ሰው ከውሃ ከመንፈስ ካልተወለደ በቀር
ወደ እግዚአብሔር መንግስት አይችልም ለመድረስ
የመዳን ቀን ዛሬ አሁን መሆኑን እወቅ
ስሙን እየጠራህ ተነሳ ተጠመቅ
ወንድሜ የቀደመችውን መንገድ ጠይቅ
መልካሚቱንም ያዝ
እውነትን 3* ግዛት አትሽጣት /2/
አንድ ጌታ አንድ ሃይማኖት…
',0),(NULL,'ይዤ መጣሁ ምስጋና','MesertB2','ከምድር ዳርቻ ከሩቅ መጥቻለሁ
በፊቱ የሚያቀርበኝ እጅ መንሻን ይዣለሁ/ 2
ዕጣን ከርቤ አይደለም ይዤ የመጣሁት
በልቤ ቋጥሬ ምስጋናውን የያዝኩት
አምልኮውን የያዝኩት
እልልታውን የያዝኩት
ዝማሬውን የያዝኩት

ይዤ መጣሁ ምስጋና ይዤ መጣሁ አሜን
ይዤ ልግባ እልልታን ይዤ ልግባ አሜን
ወደ ያዕቆብ አምላክ ወደ እግዚአብሔር ተራራ
ይዤ መጣሁ ምስጋና
ኢየሱስ የሠራውን ታምራቱን ላወራ
ይዤ መጣሁ እልልታ
ብዙ አለኝ/ 2  አለ በልቤ/2*
ምስጋና ለአምላኬ/2*
እልልታ ለአምላኬ/2

ስማኝ ልመስክርልህ አድምጠኝ ወገኔ
የእግዚአብሔርን ማዳን አይቻለሁ ባይኔ
ለነፍሴ በመከራዋ በጭንቀቷ ብዛት
ማጽናናቱ ነፍሴን እጅግ ደስ አስኛት/ 2
ይፈልቃል /3/ ምስጋናውከልቤ
ይፈልቃል /3/ እልልታውከውስጤ
ኢየሱስየሰራልኝሁሌእየታወሰኝእየመጣፊቴ /4/2
ስፈልግህ ኖሬአለሁ የጽድቅን ጎዳና
ለአስሩ ስገብር አጎበጠኝ ዕዳ/ 2
ዛሬ ግን በኢየሱስ እንደው ያለዋጋ
በነጻ አጠጣኝ ሠጠኝ የሕይወት ውሃ/ 4
ይዤ መጣሁ…

ያዳናችሁ ሁሉ እስቲ ተናገሩ
በምስጋና ዜማ እልል በሉ ዘምሩ
ጌታዬ አድኖኛልና እኔም እናገራለሁ
መስዕዋቴን ይዤ ወደፊቱ እቀርባለሁ/ 2
ይፈልቃል/3*
ምስጋናው ከልቤ/2*
ይፈልቃል/3*
እልልታው ከውስጤ/2*

ኢየሱስ የሰራልኝ ሁሌ እየታሰበኝ
እየመጣ ፊቴ/4*5
',0),(NULL,'እዚህ ደረስኩ','MesertB2','እዚህ ደረስኩ አንተ እየመራኸኝ ስምህ ኢየሱስ
ብርታት ጉልበት ሆኖኝ ስምህ አምላኬ
ከዚህ ወዲያ ደግሞ እንደ ፈቃድህ ልታደርገው
ያለውን አንተው ታውቀዋለህ

ከናቴ ማህጸን እስከ ዛሬም ድረስ
ይኸው ተሸከምከኝ ሳትሰለችህ ኢየሱስ
ሁሌ እያስተማርከኝ በፈቀድከው መንገድ
ረዳቴ ሆንክልኝ በሕይወት ውጣ ውረድ
ገና ስጀምር ጉዞዬን አንድ ብዬ
እርሻና በሬዬን ተከተልኩህ ጥዬ
ለእግሬ ጫማም የለኝ በእጄ አልያዝኩ ኮሮጆ
ግን እንዴት ድንቅ ነህ ሞላህ የእኔን ጎጆ
ሞላህየኔንጎጆኢየሱስሞላህየኔንጎጆአምላኬ /3/

ገና ሳይበቅል እያሳየኸኝ
የሩቁን ዘመን እየነገርከኝ
ከቀስተኞች ጦር እያስመለጥከኝ
በመንፈስ ምሪት በድል አስጓዝከኝ

ብዙ ተጉዣለሁ ጌታ እየመራኸኝ
ሕግህ ለእግሬ መብራት የእሳት አምድ ሆኖልኝ
ውዴ የአፍህ ቃል ሁለት አፍ ያለው ሰይፍ
እስከ ዛሬ አቆመኝ ረዳኝ ክፉውን እንዳልፍ
እመላለሳለሁ በደጄ ሰላምህ
የዘለአለም ክንድህ አጥብቆ ይዞኝ እጅህ /2/

ሞላህ ...
ገና……


ያም ቢሆን ይሄኛው በአንተ ሆኖልኛል
ጌታ በአንተ ፈቃድ መች ነገር ይሳካል
እንደ ደመና ነው እንደ ጉም እንደ ጭስ
ኢየሱስ ያልፈቀድከው አይቻል በእጅ ሊያዝ
ሐሳብህ ከሃሳቤ ፍጹም ይለያያል
ሰማይና ምድር ነው በምን ይገናኛል
ያም ቢሆን ግን ታድያ ሁሉም ለበጎ ነው
ውዴ የእኔ ጌታ አላማህ ፍቅር ነው
አላማህ ፍቅር ነው ኢየሱስ
አላማህ ፍቅር ነው ጌታዬ /3/

ገና……
',0),(NULL,'ምርኮኛው ነኝ','MesertB2','ምርኮኛው ነኝ የእግዚአብሔር
ባሪያው ልሁን ለዘለዓለም
ልስገድለት ወድጄዋለው
ልሰዋለት ደስ ይበለው
ልገዛለት ላገልግለው  /2/

እያየው በደሌን ያለብኝን ሃጢያት
ሊያድነኝ ወደደ ከዘላለም ጥፋት
አሳዳጅዋ እኔን ጠራኝ በምህረት
ሊሰጠኝ ወስኖ የዘለዓለምን ህይወት 2*
አይቶኝ የሱስ ኃጢያት ሰፈር
ሞት ካለበት ከዚያ ሃገር
እጁ ይዞ ሳበኝ ፍቅሩ
ልጁ አረገኝ አጥቦኝ ደሙ
ምርኮኛ ነኝ…

ፈታችሁ አምጡልኝ ያቺን ውርንጭላ
ታስፈልገኛለች እንዳትሏትችላ
ብሎ አስጠርቶኝ ነው አስፈትቶኝ ከስራት
የመዳን እውቀትን ወንጌል እንድሸከም 2*
ዞሬ ላላይ ወደሗላ
ላልመለስ ላልል ችላ
የፈታኝን ተፈትቼ
አመልከዋለሁ ሁሉን ትቼ
ምርኮኛ ነኝ…
',0),(NULL,'አይዞህ','MesertB2','አይዞህ በመከራ ቀን ወገብህ አይፈታ
አይዞህ በችግርህ ቀን እምነትህ አይጥፋ
በእሳት በባሕር ውስጥ መንገድ አለው ጌታ
አይከለክለውም ከፍታ ዝቅታ /2/  2

በመከራህም ቀን አይዞህ ኢየሱስ ይረዳሃል
ከሰማይ መቅደሱ ሆኖ ይመለከትሃል
ከመቅደሱ ረድኤት ጌታ ይልክልሃል
የልብህን መሻት ይፈጽምልሃል /2/
ያልፋል ዛሬ በመንደርህ እግዚአብሔር ያልፋል
ያልፋል ቁጥቋጦ ቋጥኙ በፊቱ ይነዳል
ያልፋል የናዝሬቱ ኢየሱስ በአጠገብህ ያልፋል
አልጋህ አሰናዳ ይለሃል

አንተ ባልጠበከው አዎ ባልገመትከው ሁኔታ
ታምራት ይሰራል አይዞህ ኢየሱስ ያንተ ጌታ
ደመናና ንፋስ ከሌለበት ሰማይ
የበረከት ዝናብ ይሰጥሃል ከላይ
ያልፋል ዛሬ ......

ለርስቱ የተለየህ አዎ ቅዱስ ሕዝብ አንተ ነህ
አልተውህም ብሎ አምላክ በራሱ የማለልህ
ስትወጣ ስትገባም አይኑ ከአንተ ጋር ነው
ስሙ ተሟጋችህ ደሙ የእሳት ቅጥርህ ነው
ያልፋል ዛሬ ......

ተው/3* አንተ ሰው ተው
አልለቅህም ብሎ እያለህ
አምላክ በራሱ ምሎልሃል
አምላኬ እኔን ረስቶኛል
ለምንስ ትላለህ ትቶኛል/3*
አይዞህ በመከራ ቀን ወገብህ አይፈታ
አይዞህ በችግርህ ቀን እምነትህ አይጥፋ
በእሳት በባሕር ውስጥ መንገድ አለው ጌታ
አይከለክለውም ከፍታ ዝቅታ /2/  2

በመከራህም ቀን አይዞህ ኢየሱስ ይረዳሃል
ከሰማይ መቅደሱ ሆኖ ይመለከትሃል
ከመቅደሱ ረድኤት ጌታ ይልክልሃል
የልብህን መሻት ይፈጽምልሃል /2/
ያልፋል ዛሬ በመንደርህ እግዚአብሔር ያልፋል
ያልፋል ቁጥቋጦ ቋጥኙ በፊቱ ይነዳል
ያልፋል የናዝሬቱ ኢየሱስ በአጠገብህ ያልፋል
አልጋህ አሰናዳ ይለሃል

አንተ ባልጠበከው አዎ ባልገመትከው ሁኔታ
ታምራት ይሰራል አይዞህ ኢየሱስ ያንተ ጌታ
ደመናና ንፋስ ከሌለበት ሰማይ
የበረከት ዝናብ ይሰጥሃል ከላይ
ያልፋል ዛሬ ......

ለርስቱ የተለየህ አዎ ቅዱስ ሕዝብ አንተ ነህ
አልተውህም ብሎ አምላክ በራሱ የማለልህ
ስትወጣ ስትገባም አይኑ ከአንተ ጋር ነው
ስሙ ተሟጋችህ ደሙ የእሳት ቅጥርህ ነው
ያልፋል ዛሬ ......

ተው/3* አንተ ሰው ተው
አልለቅህም ብሎ እያለህ
አምላክ በራሱ ምሎልሃል
አምላኬ እኔን ረስቶኛል
ለምንስ ትላለህ ትቶኛል/3*
',0),(NULL,'ናፍቄአለሁ','MesertB2','ናፍቄአለሁ ላይህ ናፍቄአለሁ/2*
ስለእኔ ስትሞት በመስቀል የተወጋውን ጎንህን
በሚስማር የተበሱትን እጆችና እግሮችህን
ላይህ ናፍቄአለሁና
ኢየሱስ ቶሎ ና ና ና
እላለሁኝ ጠዋት ማታ ኢየሱስ ማራናታ
ማራናታ /5/ ውዴ ቶሎ ና
ማራናታ /5/ ኢየሱስ ቶሎ ና

በሰማይ ያለህን ክብር
አስጥሎ ያስወረደህ ጥልቅ ፍቅር/2*
ሳስበው በጣም ይገርመኛል
እንዳይህ እጅግ ያጓጓኛል /2/*
ዋላ ወደ ውሃ ምንጭ እንደሚናፍቅ
ነፍሴ እንዲሁ አንተን ናፈቀች
ማራናታ /5/ ውዴ ቶሎ ና
ማራናታ /5/ ኢየሱስ ቶሎ ና

አሁን የዚህ ምድር ስቃይ
ሊገለጥ ካለው ክብር ጋር ሲተያይ /2/*
ምንም እንዳይደለ እቆጥራለሁ(አውቃለሁ)
ኢየሱስ አንተን ብቻ እናፍቃለሁ
ዛሬ በድንግዝግዝ በሩቅ
አምላኬ አይሃለሁ በእምነት
ኋላ ግን በክብር ስትመጣ
አይንህን በአይኔ አየዋለሁ የእኔ ጌታ /2/*

',0),(NULL,'የጸና ክንድ አለው','MesertB2','የጸና ክንድ አለው የበረታ
በምንም አይነት ኃይል የማይረታ /2/*
በምስራቅ ያላችሁ በምዕራብያላችሁ
በሰሜን ያላችሁበደቡብ ያላችሁ
ክብር ለኢየሱስ ስጡት ለታላቁ ጌታ
ኤልሻዳይ ለሆነው ሁሉን ለሚረታ /2/

ሰማይና ምድርን የሞላ ጌታ ነው
በኃይል በችሎቱ አንድም ማይታጣው
ከየትኛው ጋራ እስቲ ይመሰላል
የአማልክት አምላክ ኢየሱስ ሁሉን ችሏል
የለም የለም እንደ ኢየሱስ የበረታ ማንም የለም - አሜን
የለም የለም እንደ አምላኬ የበረታ ማንም የለም 
ነግሶ/ከብሮ የሚኖር ዘላለም/2/

ለዚህ አምላክ
ለዚህ ጌታለዚህ ንጉስ /2/
እኔ አልጠግብም /6* 
ሳመሰግነው ውዬ ባድር
ስዘምርለት ውዬ ባድር /2/
እኔ አልጠግብም/6*

ይኸው ገድለነዋል ከምድር በታች ውሏል
እንግዲህ አበቃለት ተደምድሟል ሲባል
መቃብር ፈንቅሎ ኢየሱስ ተነስቷል
ከሙታንም በኩር ሆኖ ትንሳኤን አብስሯል
የለም ....
ወደ ታች ወደ ጥልቅ ሙታኖች ጋ ሄዶ
ወንጌልን አውጆአል ወደ ሲኦል ወርዶ
የአስጨናቂውን ዘንግ የሞት ኃይልን ሰብሯል
ሥልጣናት ኃይላትም ተገዝተውለታል
',0),(NULL,'ስጓዝ በምድረ በዳ','MesertB2','ስጓዝ በምድረ በዳ ሆኜ ለአገሩ ባዳ/እንግዳ/ 2
ሲርበኝ መናን አዝንቦ
ሲጠማኝ ከአለት ውሃ አፍልቆ /2/*
የመራኝን አምላክ እኔም ደግሞ አየሁት/3*
ቃል ሥጋ በመሆን ተገልጦ አየሁት/2*
የሚያየኝን አምላክ እኔም ደግሞ አየሁት /3*
አምላክ ለሰው ልጆች በአምሳሉ ተገልጦ አየሁት

በኮሬብ በእሳት ውስጥ ሆኖ ሲያናግረኝ
ድምጹን ሰማሁ እንጂ በአይኔ አላየሁም መልክ
ዛሬ ግን እግዚአብሔር አማኑኤል ሆኖ
አየሁት ዳሰስኩት በሥጋው ተገልጦ /2/
በሳምራዊነቴ ሳይንቀኝ ቀርቦኛል
ውሃ አጥጭኝ ብሎ ራሱን ገልጦልኛል
ይህን ታላቅ ሚስጥር ላልሰማው ላሰማ
እንስራዬን ጥዬ ሮጥኩ ወደ ከተማ /2/

ሰላሳ ሶስት አመት በምድር ሲመላለስ
ብዙ ዴዌዮችን ሲምርና ሲፈውስ
የሱስ ትሁት ሆኖ በአህያይቱ ላይ
ተቀምጦ አየሁት ሲዞር በአደባባይ /2/

ሕይወት ተገልጦልኝ አይቼዋለሁ
በእጆቼ ዳስሼ አምኜዋለሁ /2/*
ከአይኔ ጋር ቃል ኪዳን ገባሁ/2*
',0),(NULL,'ቀንወጣልኝ','MesertK1','ኢየሱስእሱየኔበመሆኑቀንወጣልኝ
ሁኔታመለዋወጥአያሰጋኝም /2/
የተስፋቃል - አለኝእኔ
አምላኬነው - መድህኔ
ሰማይምድሩ - ሁሉየእርሱ
ልጅእኮነኝ - የንግሱ /2/

ተስፋላድርግየሚታየውን
እንደጎምሆኖሚጠፋውን
የጸናየተስፋቃልአለኝ
በየሱስእታመናለሁኝ
ምታመንበትየማይጥለኝ - እስከሽበትምሚሸከመኝ
የማይዝልክንዱየማያረጅ - ፍጹምአላጣምከየሱስእጅ
ተደላድዬበትእኖርበትአለሁ - ሁሉንባምላኬአሸንፋለሁ
ዙሪያዬሁሉበእሱታጥሮልኝ - በክንዱድጋፍያኖረኛል

ዙሪያዬቢሆንምድረበዳ
ሚታየውቢመስልየሚጎዳ
ምድረበዳንሚያለመልመው
ኢየሱስየኔአባትእኮነው
ኢየሱስ .....

በእውነትም /እኔ/ እድለኛነኝ
ኢየሱስአምላክሆነልኝ
በምድርቢቀያየርምሁኔታ
ከቶአይለወጥየኔጌታ
ምታመንበት ....
ኢየሱስ ....
',0),(NULL,'ታሪክአይደለም','MesertK1','ታሪክአይደለም - የማወራው
እኔራሴውበአይኔ - አይቼዋአለሁ
ቀንበርሲሰብር - ህዝቡንሲፈታ
ነጻሲያወጣ - አንዱጌታአንዱጌታ
አይቼዋለሁ /3/ ምስክርሆኜቆሜአለሁ
አይቼዋለሁ /3/ ማዳኑንእናገራለሁ

ዲዳነበርኩኝአንደበቴንም - ኢየሱስከፍቶ
እንዲህአዘመረኝበሕይወቴላይ - ታምራትሰርቶ
የተጫነብኝቀንበርከላዬ - ተሰብሮወጥቶ
ለክብሩአቆመኝጌታነውየሱስ - ታሪክለውጦ

ያየሁነኝ - ታምራቱን
ልዘምር - ውለታውን
ድንቅነው - የነፍሴጌታ
መንፈሱን - እስራቴንፈታ
ሃያልነው - ሁሉንየሚራታ /2/

ልባቸውሰጥተውጥንትአባቶቼ - ያመለኩትን
ድንቅእየሰራእያሳያቸው - ተአምራትን
ምስክሩነኝአይቸዋለሁ - እኔምበዘመኔ
በልቤበርተዋልይህድንቅጌታ - ከፍብሏልባይኔ
ያየሁ ....
ሁሉንየምትደርስያየተዘረጋ - የምህረትክንዱ
አልተለወጠምየየሱስፍቅር - ሰውንመውደዱ
ዳንኩኝከጥፋትበእርሱበአምላኬ - ተወደድኩና
አቆመኝዛሬውርደቴንበክብር - ለወጠውና
ታሪክ ...
እናገራለሁየአምላኬስራ - አፌንከፍቼ
እኖራለሁኝእንዲህአምሮብኝ - በእርሱረክቼ
ፍጹምአልቆዝምምርቋልከላዬ - ነገርአበሳ
ያቃተውየለምሃያልነውእሱ - የይሁዳአንበሳ
',0),(NULL,'ይመርልህ','MesertK1','ይመርልህ /4/ ህይወቴ ይመርልህ
ይመርልህ /4/ ሃሳቤ ይመርልህ
ልብህ የሱስ - በኔ ላይ ይረፍ
እርምጃዬን - አንተ አትጠየፍ
መንፈስህም ዘወትር ይምራኝ
ክብርህ የሱስ አይጉደልብኝ /2/

የማምረውና - የምዋበው
ሞገስ ካንተ ዘንድ - የማገኘው
ቀና ሲሆን ነው - ፊትህ አካሄዴ
ስታምርልኝ በህይወቴ ውዴክበርብኝ
ይመርልህ ...

ፊትን አታይም - ወይም ቁመትን
መልክን አታይም - ወይ ደም ግባትን
ይመርልኝ በፊትህ ልቤ
የቀና ይሁን አስተሳሰቤ - ይኸው ልቤ

መለኪያህ መልክ አይደለም ቁመት
ኢየሱስ የምትመዝንበት
ልብ ነው ዘልቀህ ምታየው
ሰርተኸው በል አሳምረው /2/

ይረፍብኝ ክብርህ በላዬ
ቅድስናዬ ነው መለያዬ
የሱስ በእኔ እንዲልህ ደስ
በፊትህ ይኸው ልቤ ላፍስሥ - ይበልህ ደስ
ይመርልህ ...

አላጣጥለው - ያንተን ነገር
ልገዛልህ ዛሬም በፍቅር
ተዋጅቻለሁ - በክቡር ደምህ
ፈቅጄ ዛሬ - እራሴን ልስጥ - እራሴን ልስጥ
መለኪያህ ....
',0),(NULL,'ያየኛል','MesertK1','ያየኛል /2/ የሱሴ ያየኛል
በፍቅር አይኖቹ ይመለከተኛል
እጁ ተዘርግቷል ለምህረት ወደኔ
ሁሌም ይወደኛል ኢየሱስ መድህኔ /2/
ኢየሱስ መድህኔ /3/ ይወዳኛል እኔ /2/

ደግነቱ እየበዛ - ፍቅሩ የማይለወጥ
ልጆቹንም ለጠላት - አውጥቶ ፍጹም ማይሰጥ
እንደ አይኖቹ ብሌን - ይጠነቀቅልኛል
የልቤንም ይረዳል - የሱስ ይራርልኛል

ፍቅሩ አይለወጥ የዘለአለም
እንደሱ ያለ አላገኝም
ሁሌ ያየኛል በፍቅር አይኑ
ልቤን ለወጠው ድንቅ ማዳኑ /2/

ተራራ ላይ ብወጣ - ደግሞም ሸሎቆ ብወርድ
ከኔ የማይለይኝ በምሄድበት መንገድ
በጥላው ሊያኖረኝ የሱስ ቃል ገብቶኛል
በድል እራመዳለሁ ታድያ ምን ያሰጋኛል?
ያየኛል ....

አምላኬ እኮ ትልቅ ነው ሁሉንም ነገር ያያል
የልቤን እንቁቁልሽ የሱስ ይፈታዋል
ከእሱ የተሰወረ ወይ ደግሞ ሚያስቸግረው
እንደሌለ አምናለሁ በሁሉ ላይ ጌታ ነው
ፍቅሩ ....
',0),(NULL,'በታላቅ ግርማ','MesertK1','ምስጋና በላይ በሰማይ
ለሚኖር በዙፋኑ ላይ
በክብረ ለነገሰው ለየሱስ ዘምራለሁ /2/

ኦሆ በታላቅ ግርማ ኦሆሆ በብዙ ክብር
ኦሆ ተከቦ ደምቆ ኦሆ አምሮ ለሚኖር
ልቤን ላፍሥስ ልዘምር /2/

የክብር አምላክ የክብር አለቃ
ጽኑ መንግስት የማያበቃ
አለው ብርታት አለው ጉልበት
መላእክት የሚያዜሙለት
በክብሬ እኔ ዛሬም ይነሳ
በገናዬም ልደርድር ላንሳ
በሙሉ ሃይሌ ላሸብሽብለት
ለኢየሱስ ጨርቄ ይውደቅለት
ኦሆ ....


ማንም በማይቀርበው ብርሃንህ
ውስጥ ይኖራል በታላቅ ክብር
ባርያዎቹ ይገዙለታል
ፍጥረታቱ ደግሞ ያመልኩታል
እኔም ልስገድ በፊቱ ዛሬ
ላምልክለት ባዲስ ዝማሬ
ምስጋናዬ ዙፋኑ ይድረስ
ልቆ ይታይ የኔ የሱስ

ምስጋና ምስጋናዬ - ምስጋና ለጌታዬ
አምልኮ አምልኮዬ - አምልኮ ለየሱሴ
 ክብርና ግርማን ለለበሰው - እሰግዳለሁ /2/

ከሰማያት ከፍ ከፍ ያለ
እንደ እርሱ ያለ አረ ማን አለ?
የከበረ በቅድስና - ይገባዋል ብዙ ምስጋና
እጄን ላንሳ ለርሱ ክብር - ታላቅነቱን ልናገር
ልቤን ላፍስስለት በፊቱ - ልቀኝለት ስለምህረቱ

ኦሆ ...
ምስጋና በላይ ...
',0),(NULL,'አንድ ቀን  ','MesertK1','ታማኙ(ኢየሱስ) አይጥለኝም
መንገድ ላይ አይተወኝም
ደግፎ ያደርሰኛል
መንግስቱን ያወርሰኛል

ጉዞዬ ቢከብድ ቢበዛው ተራራ
የሚያሸንፍልኝ አለ ከእኔ ጋራ
ከፊት ከፊት ሆኖ እርሱ እየቀደመ
ሰማይ ያደርሰኛል እየተሸከመ
አይቀርም አንድ ቀን እደርሳለሁ
አይጥለኝም ተማምኜዋለሁ
ቀርፆኛል በእጆቹ መዳፍ
ማንስ ያወጣኛል ከእርሱ እቅፍ
የእኔ ጌታ እርሱ ታማኝ
ላይተወኝ ቃል የገባልኝ
በምህረቱ ተሸክሞኝ
አንድ ቀን ሰማይ እደርሳለሁ
አንድ ቀን ፊቱን አያለሁ /2/

ጀምሬአለሁ ጉዞ ወደ ኋላ ላላይ
ተስፋ ያደረግኩት ነው መንግስተ ሰማይ
ቃልኪዳኑን የሚያከብር ታማኝ አምላክ ነው
ይችላል ሁሉንም እኔ የማመልከው
በፀጋው ሀይል በእርሱ ብርታት
አያለሁ አምላኬን ፊት ለፊት
አይኖቼ ላይ እንባ ይታበሳል
እረፍቴ ይበዛል ደስታ ይሆናል

የእኔጌታ ....

ተስፋ እንደሌላቸው በፍፁም አላዝንም
ፀጋው ብርታቴ ነው እሮጥለሁ አልዝልም
በእምነት እያየሁኝ ያቺን ውብ አገር
እገዛለታለሁ ለአምላኬ በፍቅር
ከዚህ ከድንኳኔ ተለይቼ
አያለሁ እየሱሴን በአይኖቼ
በእጅ ባልተሰራው መኖሪያዬ
እኖራለሁ እየዘመርኩ ለጌታዬ
የታመንኩበት እየሱስ ውዴ
ላይጥል ላይተወኝ ወዶኛል አንዴ
መከለያዬ የእኔ መሸሻ
ያጸናኛል እስከ መጨረሻ /2/

የእኔጌታ ....

',0),(NULL,'ቆሙ እኮ እግሮቼ','MesertK1','እየሱስ የነፍስን ጥፋትአይወድም
ማረፊያ ሆኖኛል ለዘለዓለም/2/
ቆሙ እኮ እግሮቼ በእውነት ወንጌል ላይ
የሞት ጥላን እየሱስገፈፋከኔላይ
የሚያውከኝ የለም የሚያስፈራኝ
በነፃነት ልኖር ነፃ አወጣኝ
ደስታዬን አበዛው ንጉሤን እየሱስ
በልቤ ዙፋን ላይ እርሱ ብቻ ይንገስ

ዘጋልኝ የሲአኦልን አፍ
ሰጥቶኛል ህይወት እስከትርፍ
አመለጥኩ ከእሳት ባህር
ልዘምር ለእርሱ ክብር
ቅዱስ የሆነው መንፈሱን
አፈሰሰልኝ ንጉሡ
ወደደኝ በፍጹም ፍቅር ኃጢያቴን ጣለልኝ
ይቅርታ አድራጊ ተሞልቶ ምህረት
አውርቼ አልጨርስ የእርሱን ደግነት
ነፃ አውጥቶኛል ሰጥቶኝ እረፍት
አሁን የለብኝ የሞት ፍርሃት   /2/

ልቤ ዙፋን ይሁነው
ሰው የሆንኩት በእርሱ ነው
እየሱስ የነፍሴ ጌታ
ሁሉን አሸነፈ ረታ
ቀና አልኩኝ ላልደፋ አንገቴን
አበዛው ሰላም እረፍቴን
ላንሣለት ምስጋና እልልታ
ላክብረው በፍፁም ደስታ
ቆሙ እኮ ...


ታማኝ ወዳጅ አግኝቼአለሁ
ሳልፈራ በእምነት እኖራለሁ
እንደ አይኑ ብሌን ሁሌ
ይጠነቀቃል ለእኔ
ሚስጥሬን ሁሌ የማዋየው
የልብን የሚረዳ አምላክ ነው
እየሱስ የነፍሴ ወዳጅ
በእርሱ ዳንኩ ከጨካኙ እጅ
ይህንን አምላክ ወድጄዋለሁ
በልቤ ሾሜ አነግሠዋለሁ
በህይወቴ ላይ ታምራት የሰራ
እርሱ ነው ጨለማዬን ያበራ
ለልቤ ደስታ ለነፍሴ ሃሴት
እግሮቼ ጸንተው የሚቆሙበት
ቆማለሁ በእርሱ አልነቃነቅ
በእጆቹ ይዞኛል ከቶ እንዳልወድቅ

',0),(NULL,'መልካምነትህን','MesertK1','መልካምነትህን ቀምሻለሁ እየሱስ - ቀምሻለሁ ንግስ
መልካምነትህን በህይወቴ አይቻለሁ - ክብር /2/

ሳጠፋ ስበድል አንተን ሳስቸግርህ
ምህረት ይቅርታ ነው ሁልግዜ ምላሽህ
መልካምነትህን በህይወቴ አይቻለሁ
ስለዚህ ጌታዬን ፈቅጄ አመልክሃለሁ
መልካምነትህን ቀምሻለሁ. . .

ጣፋጭ ነህ እየሱስ እጅግ ታረካለህ
የተራበችን ነፍስ ደግሞ ታጠግባለህ
እኔም ረክቻለሁ አንተን ተጠግቼ
ከልቤ ላመስግንህ እጆቼን ዘርግቼ
ቀምሼ አጣጥሜሃለሁ
መልካም ነህ እየሱሴ
መልካም ነህ እልሃለሁ
በስራህ ሁሌ እየተደነቅኩ
ለክብርህ አዳዲሱን ዝማሬ አመጣለሁ  /2/
መልካምነትህን አሰላስዬ
ፍፁም አልጠግብም እየሱስ ብዬ
በውዱ ፍቅርህ ልቤ ተነክቶ
መልካም አምላክ ነህ የምታስመካ/2

ፍቅርህን ቀምሻለሁ በልቤ ላይ ንገስ
አንተ ብቻ ግዛኝ አምላኬ እየሱስ
መንገዴን ያቀናህ እረፍት የሰጠኸኝ
ምን እልሃለሁ ብቻ ክበርልኝ
ቀምሼ ......
',0),(NULL,'እንደ ዳዊት ','MesertK1','እንደ ዳዊት የሱስ ሃሳብህን ላገልግል
እንደ አብርሃም ስጠኝ ላንተ የጨከነ ልብ  /2/

አብርሃምን የሱስ ልትፈትነው
ይስሃቅን ሰዋልኝ ብለህ አዘዝከው
አብርሃምም  ለአንተ ታዘዘበእምነት
የመስዋዕቱን በግ አዘጋጀህለት

ልቤ ለአንተ ይጨክን ልሁን እንደ ልብህ
የእኔ መኖር የሱስ ይሁን ለክብርህ
እኔም እንደ ዳዊት ልለፍ አስከብሬህ
አምላኬ የአንተን ሃሳብ አገልግዬህ

በልቤ ያለውን አንተ የምትሻውን
ልሰዋልህ እርዳኝ የምትፈልገውን
እኔም እንደ አብርሃም የማላሳፍርህ
ልሁን እየሱሴ ሁሉን የምታዘዝህ
',0),(NULL,'ይልቀቅ ሌላው','MesertK1','መንገስ የሚገባው ይነግሳል
እየሱስ ብዙዎችን ይወርሳል
በቃሉ እንደተፃፈው
ይህ ዘመን የእግዚአብሔር ነው
ጊዜው የእግዚአብሔር ነው
ሌላው ስፍራውን ይልቀቅ
ይገባል እየሱስ ሊነግስ
እርሱ ብቻውን ሊልቅ /2/

በጣዖታት ላይ የሱስ ይፈርዳል
በምድርም ላይ እርሱ ይነግሳል
መንገስ መፈራት የሚገባው
እየሱስ ብቻ እርሱ አምላክ ነው /2/
ይልቀቅ ሌላው ለእርሱ ስፍራውን
ይገባዋል መንገስ ብቻውን
በፈጠረው ፍጥረት ሁሉ ላይ
ከፍ ብሎ ኢየሱስ ይታይ /2/

ከታላቅ ግርማው ከክብሩ ወርዶ
የምህረት አምላክ ምህረትን ወዶ
የሞትን ሀይል በሞቱ ውጧል
የሱስ ብዙዎችን ሊወርስ ይገባል /2/
መንገስየሚገባውይነግሳል
እየሱስብዙዎችንይወርሳል
በቃሉእንደተፃፈው
ይህዘመንየእግዚአብሔርነው
ጊዜው የእግዚአብሔር......

ጨለማውንም ይገላልጣል
የክብሩ ወንገል ብርሃን ይበራል
ሰዎችን ሁሉ በፍቅሩ ማርኮ
ይበዛለታል ክብርና አምልኮ  /2/
',0),(NULL,'ተማመንኩህ','MesertK1','ተማመንኩህ አላፍርም
ተደገፍኩህ አልወድቅም /2/
ፅኑ ዓለት አስተማማኝ
ምታስመካ ምታኮራኝ /2/

አባቶቻችን አንተን ታምነው አለፉ
ሁሉን ድል አድርገው እያሸነፉ
ለእኔም ተስፋዬ አለኝ የምልህ
ምታመንብህ ምኮራብህ
እየሱስ ነህ
እየሱስ/2/ አለህልኝ/4/
ተማመንኩህ . . .

ትላንትን በአንተ አልፌውአለሁ
ነገን አልፈራም ሁሉ በእጅህ ነው
ልዑል መጠጊያዬ አድርጌሃለሁ
በጥላህም ውስጥ ሁሌ እኖራለሁ
ምን እሆናለሁ?
እየሱስ/2/ አለህልኝ/5/
በከበደኝና ባቃተኝም ላይ
የእኔ እየሱስ ነህ እኮ ኤልሻዳይ
ያለቀ ተስፋን ምታለመልም
ሀይልህ የበረታ የማትቀየር
እንደ አንተ ያለ የለም
እየሱስ/2/ አለህልኝ/5/

ተማመንኩህ . . .
ፅኑ ዓለት ....
',0),(NULL,'ተባረክ','Mulugeta1','ተባረክ የእኔ ጌታ ተባረክ/2*
ተመለክ ኢየሱሴ ተመለክ/2*
ተወደስ አምላኬ ሆይ ተወደስ/2*
ከፍ በል መድኃኒቴ ከፍ በል/2* 2*

ኢየሱስ ታላቅ ነህ ከሁሉ በላይ
የሚመስልህ የለም በምድር በሰማይ
ምንም ተስፋ የለኝ ከአንተ የተሻለ
ሁሉን ልታደርገው ሙሉ ሥልጣን አለህ

ያዳንከኝ ጌታዬ ከሞት ፍርሃት
በነፃነት ልኖር ሰጠኸኝ ሕይወት
ላክብርህ ልዘምር የልቤን ምስጋና
ቅኔ ልቀኝለህ ነፍሴ ለአንተ ትቅና

ነፍሴን አድነሃት በሕይወት ያኖርከኝ
በልቤ ደስታ ምስጋናን ሞላኸኝ
ከአመድ ከትቢያ እኔን አነሳኸኝ
ዛሬ እንዳከብርህ ኢየሱስ ረዳኸኝ

ከማይጠፋው ዘርህ ዳግም ወልደኸኛል
ከባርነት ቀንበር ነፃ አውጥተኸኛል
ሁሌ አመልክሃለሁ በሕይወት ዘመኔ
ኢየሱስ አምላኬ ተስፋዬ ነህ ለእኔ
',0),(NULL,'ሰው አለምን ሁሉ','Mulugeta1','ሰው አለምን ሁሉ ቢያተርፍ ከንቱ ነው
ነፍሱን ቢያድን ግን ሕይወት ደስታ ሰላም በረከት ነው
ሕይወቴ ትያዝ ዘመኔ ይቆጠር ከአንተ ጋር
በእቅፍህ ልኑር ለዘለዓለም ጌታዬ ግዛኝ

ከጨለማ አውጥተኸኝ ኢየሱሴ ረዳኸኝ
በምህረትህ አቁመኸኝ ያንተ ልጅ አደረከኝ/ 2*
እኔን ሰው አደረከኝ
በሕይወቴ ዘመን ሁሉ እገዛልሃለሁ/2/
የእኔ ኢየሱስ ወደኸኛል ይህን አውቃለሁ
በፍጹም ፍቅር ወደኸኛል እከተልሃለሁ

ሥጋ ለባሽ ድጋፍ አይሆን ከንቱ ነው
ጥቂት ታይቶ ኋላ እንደሚጠፋ እንፋሎት ነው
በሕይወት ልኑር በማደሪያህ ድንኳንህን
ያዘኝ ኢየሱስ ላገልግለህ እንደ ቃልህ ልሁን

የተጣለ የምታስበው ምትረዳው
የምትራራለት ከወደቀበት ፈጥነህም ታነሳው
አንተን ይዞ ሰው ምንም አይሆን ተስፋው ነህ
በጥላህ ታምኖ የሚያድረውን ትጋርደዋለህ

ውለታህን አልዘነጋም አስታውሰዋለው
ሚዘነጋ ሚረሳ አይደል በልቤ ነው ያለው
በፍጹም ፍቅር ወደኸኛል ይህን አውቃለሁ
ነፍስህን ሰጥተህ ወደኸኛል ይህን አውቃለሁ
',0),(NULL,'በሕይወቴ ዘመን ሁሉ','Mulugeta1','እኔን ተቤዥቷል በደሙ ጌታዬ
በፍቅር ማርኮኛል ድንቅ ነው ለነፍሴ
በእሱ ደስ ይለኛል ጽድቁን አወራለሁ
በኢየሱስ አላፍርም እመካበታለሁ

ሁልጊዜ ማመልከው የማይለየኝ አምላክ አለኝ
ከምለውም በላይ የሆነልኝ የሚረዳኝ
በድካሜ ጊዜ ያጸናኛል ያበረታኛል
ቢከፋም ቢለማ አይተወኝም ይረዳኛል
ክበር እለዋለሁ/2/ እለዋለሁ 2

ከብዙ ክብር ይልቅ የሱስ ይሻለኛል
በመከራ ጊዜ ኃይል ይሆነኛል
በደስታም ቢሆን ክብሬ ነው የሱሴ
በእርሱ ደስ ይላታል ለዘላለም ነፍሴ

በመከራዬ ቀን ማምለጫ አለቴ
መውደዱ ብዙ ነው ይሳሳል ለነፍሴ
ምህረቱ ብዙ ነው ሁል ጊዜ ማለዳ
በፍቅር ፍጹም ነው ከቶ የማይከዳ


የሰላሜ ንጉስ ሰላሜ ሆኖልኝ
ስወጣ ስገባ ፈጥኖ እየረዳኝ
እንደርሱ የሚሆን ከየት አገኛለሁ
በሕይወቴ ዘመን እርሱን አመልካለሁ
',0),(NULL,'በልዑል መጠጊያ የሚኖር','Mulugeta1','ወጥመድ ተዘርግቷል ሥጋት በየሥፍራው
አለምንም ማትረፍ ጊዜያዊ ነገር ነው
ተስፋ ላደረገው እግዚአብሔር ተስፋው ነው
በልዑል መታመን ይህ ነው የሚበጀው


በልዑል መጠጊያ የሚኖር
ሁሉን በሚችል አምላክ ጥላ ይታመናል
እግዚአብሔርን አንተ መታመኛዬ ነህ እለዋለሁ
ኢየሱስን አንተ መደገፊያዬ ነህ እለዋለሁ

ሰላም ነው መኖሪያህ ኑሮ ከአንተ ጋራ
ቀንም ስጋት የለም ሌቱም አያስፈራ
የሕይወት ውሃ ማያልቅ ምንጭ ቢቀዳ ቢቀዳ
ሁሉ አለህ ከእቅፍህ ልዑል ከአንተ ጓዳ

መልካሙ እረኛ ለበጎቹ የሚራራ
በለምለም መስክ በዕረፍት ውሃ መንጋውን ሚያሰማራ
የሚሳንህ የሌለህ ኤልሻዳይ አንተ ነህ
ተስፋዬ ላድርግህ ልኑር በእቅፍህ

በኃጥያት ድንኳኖች ከመኖር በተድላ
በደጃፍህ መጣል ተስፋም አለው ኋላ
ሰው አንተን ዝም ብሎ ተስፋው ቢያደርግህ
ለዘላለም መታመኛ አንተ ተስፋው ነህ
',0),(NULL,'ሰላሜ ነህ ኢየሱስ','Mulugeta1','ሰላም ሰላሜ ነህ ኢየሱስ/2*
ሰላም ሰላሜ ነህ ለእኔ/2*

ሰላምህም በዝቶልኛል
ለነፍሴ ዕረፍት ሆነሃል
ከባርነት አውጥተኸኝ
በነፃነት አኑረኸኝ
ምን እላለሁ ምስጋና አለኝ
ነፍሴን ከሞት ያዳንክልኝ

ውስጤን ሞልቷል ያንተ ሰላም
በምንም ነገር ከቶ አልሰጋም
ምድር ብትነዋወጥም
ሰላሜ አይደፈርስም
አንተን ይዤ ሕይወት አለኝ
ውስጤ ከቶ አይታወክም

በስምህ ተደግፌ
በሰላምህ ላይ አርፌ
እኖራለሁ ደስ እያለኝ
ሰላምህን ተሞልቼ
ለእኔ ልዩ ኢየሱሴ
ሰላሜ ነህ ለሕይወቴ

ደስታዬ በረከቴ
ባንተ ለምልማ ሕይወቴ
ማያቋርጥ ለሁልጊዜ
ሰላሜ ነህ ኢየሱሴ
በእቅፍህ እኖራለሁ
ሰላሜ ነህ አከብርሃለሁ
',0),(NULL,'በሕይወቴ ያረከው','Mulugeta1','በሕይወቴ ያረከው የአንተ ሥራ ብዙ ነው
በሕይወቴ ያኖርከው የአንተ ፍቅር ልዩ ነው
ልቤ በእግዚአብሔር ትደፋ ነፍሴ በአምላኳ ትደፋ
ከእርሱ ሌላ ረዳት የላት/2*
ከእርሱ ሌላ ሰላም የላት/2*/ተስፋ የላት/2*

ድጋፌ ነህ እደገፍሃለሁ
ሁሉን ባንተ ላይ እጥላለሁ
ጌታዬ ነህ እወድሃለሁ
በፍጹም ልቤ አመልክሃለሁ

ተስፋዬ ነህ የምትመራኝ
ሰላሜ ነህ ሕይወት ሆንከኝ
ነፍሴ ባንተ ደስ ብሏታል
በማዳንህ አርክተሃታል

ከትቢያ ላይ አንስቶኛል
የማልጠቅመውን የራሱ አርጎኛል
ቸርነቱን በሕይወቴ በዝቶ
ሰው አርጎኛል ሕይወቱን ሰጥቶ

በአንተ ኃይል እጸናለሁ
በስምህም እታመናለሁ
ፍቅርህ ለእኔ በዝቶልኛል
ካሰብኩት በላይ አድርገህልኛል

ፍጹም መውደድ አይቻለሁ
ክበር ጌታዬ ክበር እልሃለሁ /4/

',0),(NULL,'ባለ ዝናዎች ሲረሱ','Mulugeta1','ባለ ዝናዎች ሲረሱ
ሰማይና ምድር ሲያልፉ
ኢየሱስ ግን ከፍ ከፍ ብለህ
ጸንተህ በዙፋን ትኖራለህ /2/

በሰማያት ላይ ክብርህ ገኖ
ስምህም ከስሞች በላይ ሆኖ
ሳትለወጥ ከፍ ብለህ
ብቻህን በዙፋን ትኖራለህ
ለዘላለም ከፍ ብለህ
ነግሰህ በዙፋን ትኖራለህ

አንተን ጠርተው እስራኤላውያን
ምድረበዳውን ተጉዘዋል
በመንገዳቸው ድል አርገዋል
የአህዛብን ርስት ወርሰዋል/2*

የሰው ልጆች አንተን ትተው
ዕረፍት የለም ለነፍሳቸው
የዘላለም ርስት ማትጠፋ
ሀብት አንተ ነህ ሕይወት ተስፋ/2*

እልፍ አላፋት አሉህ ፊትህ
በምስጋና የሚያከብሩህ
በምስጋና ከፍ ብለሃል
ክብርህ ከሰማያት በላይ ነው/2*
',0),(NULL,'ተመስገን ኢየሱስ','Mulugeta1','ማህተሙን ልትፈታ
የተገባህ ታላቅ ጌታ
ሁሉን በሥልጣን ሰርተሃል
ከስሞች በላይ ስም ይዘሃል

ተመስገን ኢየሱስ ተመስገን/4*

ለድሃ አደግ ለተጣለው
ለምስኪኑ ሞገስ ሆንከው
ድንገት መጥተህ ታጽናናለህ
ከልብ ሐዘን ታርቃለህ

ባሕር መክፈል ትችላለህ
የደረቀውን ታረካለህ
ጠማማውን ታቃናለህ
በሕይወቱ ትከብራለህ

በአንተ እጅግ ደስ ብሎኛል
ማዳንህን አይቻለሁ
ከወደቅኩበት አነሳኸኝ
ምህረት ፍቅርህ አቀመስከኝ

በዘላለሙ ቃል ኪዳንህ
በማይለወጠው ፍቅርህ
በፍቅር ገመድ ስበኸኛል
ልቤን ሰላም ሞልተኸዋል
',0),(NULL,'እናየዋለን','Mulugeta1','ጩኸት ለቅሶ ሐዘን ያኔ ያበቃል
እንባም ሁሉ ከአይን ይታበሳል
ችግር የለም ረሃብ ጥማት የለም
ከጌታ ጋር ኖራለሁ ደስ እያለኝ

ኢየሱስን እናየዋለን/2* በአይናችን
መድኃኒቴን አየዋለሁኝ /2/ በአይኖቼ

ማህተሙን ሊፈታ የተገባው
ታላቅ ተስፋምን ለሱ ለጠብቀው
ለታመነው ታማኝነው ለታገሰው
ታላቅ ግብዣን በሰማይ ላዘጋጀው

ለመንግስቱ ካህናት አደረገን
አገር አለን በሰማይ ዕረፍት አለን
ለከተማይቱ ብርሃን አያሻትም
በጉ ብርሃኗ ይሆናል አትጨልምም

ስቃይ ስደት ራቁትነት በቃ አይሆንም
ክብሩ ያለባት አገራችን ኢየሩሳሌም
ከአምላካችን ጋር ከብረን እንኖራለን
ከዚች ዓለም ውጣ ውረድ እናርፋለን
',0),(NULL,'ምህረት','Mulugeta1','የተናቅኩኝ ላልታሰብ ፍጹም ርቄ ከሰዎች ልብ
የሱሴ ግን አስቦኛል በምህረት አቅርቦኛል
በምህረቱ የሚያድሰኝ እንዳልጠፋ የሚወደኝ
አፌን ልክፈት በምስጋና ምህረቱን ልዘምርለት
ይገባዋልክብር/2*
ይገባዋልምስጋና/2*

ምህረት/2* የጌታዬ ምህረት
ፍቅር/2* የአምላኬ ፍቅር  /2/*

እኔም ዛሬ በተራዬ ክብር ልስጠው በዘመኔ
አንደበቴ ያመስግነው የእርሱን ምህረት ይናገር
ይታገሳል ይቅር ይላል ከቀረቡት ጌታ ይራራል
ያረገልኝ እጅግ በዝቷል ኢየሱሴ ይወደኛል
ይገባዋል ክብር  …

ቅዱሳኑ የሚጠሩት ታላቅ ጌታ ባለምህረት
የምህረቱ ጥልቀት ሰፋት የመውደዱ የፍቅሩ ብዛት
ምህረቱ በዝቶልኛል ፍቅሩ ተትረፍርፎልኛል
ምህረቱ ባይኖረኝ እኔስ ከንቱ ከንቱ ነኝ
በዝቶልኛል ፍቅሩ /ምህረቱ/2*
ይደንቀኛል ፍቅሩ /ምህረቱ/2*

ምህረቱን ከዘነጋን መውደድ ፍቅሩን ከረሳን
እንጠፋለን ከንቱ ሆነን ጥንትም በፍቅሩ ነው የሳበን
ሰው በምህረቱ ደስ ይበለው በኃይሉ ግን አይታመን
በጌታ እየተደገፈ ይድናል ይዞ ምህረቱን
የማያልቅ ነው ምህረቱ/2*
የማያልቅ ነው ፍቅሩ/2*

',0),(NULL,'የምታይበት የለኝም','Mulugeta2','የምታይበት የለኝም ኢየሱስ ነውየእኔ ማንነት
ጉልበቴ የጸናው በእርሱ ነው
ሞገሴ ክብር የእኔ ውበት /2/*
ደካማውን መቼ ትንቃለህ
የተጎዳን መች ችላ ትላለህ
አዛኝ ነህ ከልብ ነው ምትወደው
መንፈስህ ብርቱ መጽናናት ነው/2/
ትልቅ ኢየሱስ በልቤ ትልቅ
ትልቅ ኢየሱስ በሕይወቴ ትልቅ/2/

ይገርመኛል መዳኔ ለአንተ መሆኔ
ለእኔ ማንነት ጉልበት ለመቆሜ /2/*
ለሙታን ሕይወትን ትሰጣለህና
ተገልጦ ያ ክብር ፀጋህ አድኖኛል2
እንዴት ልገምትህ እንደሰው/2
ፍቅርህ ልዩ ነው ግምት የለው/2
አትመዘንም በሰው/2
የአንተ ማንነት አምሳያ የለው/2

አይሆንልህ የነፍሴ የሕይወቴ ጉዳይ
ከወንድም ከእህት ከእናት ከአባት በላይ/2/*
ከሰማሁት በልጠህ ብዙ ሆነህልኛል
ማትረፊያዬን አወኩ መደገፍ በአንተ ላይ/2

የምታይበት የለኝም…
ብዙዎች እያሉ በምድር ታላላቆች
እንዴት አከበርከኝ በአንተ አደባባዮች/2/
ከብዶብኝ ውለታህ ሁሌ እንክብካቤህ
ጽና ትለኛለህ ሆነህ ባጠገቤ/2/
',0),(NULL,'የሁሉ የበላይ ነህ','Mulugeta2','የሁሉ የበላይ ነህ ጌታ የሁሉ የበላይ
ባቃተን ነገር ላይ የበላይ ከምናስበው በላይ
የሁሉ የበላይ ነህ ጌታ የሁሉ የበላይ
ባቃተን ነገር ላይ የበላይ ከአዕምሮአችን በላይ

ምድረ በዳ ስንቱን አልፈን
ደረቁ ምድር ሲያስጨንቀን
ዝናብ የለም ወይም ብርሃን
ተስፋ ሸሸን ሁሉረሳን  /2/*

ስንነዋወጥ ቢመስለን የምንወድቅ
እጅህ ስትረዳን አየን የአንተን ድንቅ
ሁሉ ጸጥ ሲል ተስፋም ስንቆርጥ
በአንተ ግን አየን ምድር ሲለወጥ

ሸክም ከብዶብን ተስፋ ስንቆርጥ
ሰላም ለእናንተ ይሁን ትላለህ
ሕይወት ፈተና ሲሆን ኮረብታ
ከተፍ ትላለህ ሁሉን ልትፈታ
በግርማህ ታላቅነት በስራህ ግሩምነት
ማንም የለም የሚመስልህ/4/

አንተ በዘመናት መሃል ታላቅ ነህ
አንተ በዘመናት መሃል ኃያል ነህ
አንተ በዘመናት መሃል ግሩም ነህ
አንተ በዘመናት መሃል ድንቅ ነህ
የሁሉ የበላይ…
',0),(NULL,'ቃልህን አምነዋለሁ','Mulugeta2','በስምህ የማይሆነዉ የቱ ነው?/3
ለቃልህ የማይቻል ምን አለ? /3/*
ማዕበል ንፋሱ ይታዘዝልናል
ሸለቆ ይሞላል ተራራው ዝቅ ይላል
እናዛለን ሁሉን ግኡዝ ፍጥረትን
በስምህ ስልጣን ረግጠን ጠላትን

ቃልህን አምነዋለሁ
ስምህን አምነዋለሁ
ጉልበትህን አምነዋለሁ
ስልጣንህን አምነዋለሁ /2/*

እነ ጴጥሮስ መረብ ቢጥሉ
እንዳልከው እንደ ቃልህ ቢሉ
ሞላና ተትረፈረፈ 
ከቃልህመቼ አንድ አለፈ/2/*

አምነዋለሁ ቃልህን አምናለሁ
አምነዋለሁ ስምህን አምናለሁ
አምነዋለሁ ጉልበትህን አምናለሁ
አምነዋለሁ ስልጣንህን አምናለሁ /2/*

ለአመታት ደም ሲፈሳት
ለስቃይዋ መፍትሄ የሌላት
ድናለች ወደ አንተ መጥታ
በእምነት ልብስህን ዳሳ  /2/*

ቃልህን አምነዋለሁ ..
አምነዋለሁ ቃልህን……
',0),(NULL,'ፍጥረታት በሙሉ','Mulugeta2','ፍጥረታት በሙሉ ሁሉም የአንተ ናቸው
አንዳች ከእኔ አትፈልግ ሁሉ የእጅህ ነው
አፌን እከፍታለሁ በብዙ ምስጋና
ያለኝ ይሄ ብቻ ለክብርህ የሚገባ

ነግሶአልና በውበቱ በታላቅነቱ
የአውታር ዕቃ ይቀኝለት ለስሙ ክብር/2/*

ባወራው ብዘረዝር ከሚነገር በላይ
ከማመስገን ከዝማሬ ለአንተ የለኝም ሚታይ/2/*
ኢየሱስ ከሁሉ በላይ/3*
አምላኬከሁሉ በላይ/3*

ፍቅርህ ነዷል በልቤ ውስጥ ማርኮኛል ውበትህ
ሕይወት ሆንከኝ አደረከኝ የቃል ኪዳን ልጅህ /2/*
ባወራው ብዘረዝር ከሚነገር በላይ
ከማመስገን ከዝማሬ ለአንተ የለኝም ሚታይ /2/*

የትውልድ ዘመን ያለፈ
በሥራው ግሩም የሆነ
ማንም አይመስለው ሥራውን
የፍጥረት ጌታ ብቻውን/4/

በላይ በማደሪያው ክብር የተገባው
ክብርን እንስጠው ስሙን እናወድሰው
በላይ በማደሪያው ሞገስ የተገባው
ሞገስን እንስጠው ስሙን እናወድሰው
ጊዜ ሲያልፍ ጊዜ ሲተካ
አንተ አታረጅም ጊዜ ሲያልፍ/3/*
',0),(NULL,'ሥራህን አወራዋለሁ','Mulugeta2','አዳዲስ ነገር መስራት የምትወድ
እንደ ሰው ልማድ ከቶ ማታደርግ
አይገረሰስ መንግስትህ የጸና
ዘላለም/በብርሃን የምትኖር ታላቅ ገናና /2/*

ሥራህን አወራዋለሁ
ፍቅርህን እተርካለሁ
እንደአንተ አምላክስ ማን ነው?/3/

ከጥንት ፍጥረት ስለ አንተ አውርቶ
መቼ ተዘጋ ሥራህ አብቅቶ
ሁሌም አዲስ ነህ በሥራህ ግሩም
እንከን የሌለህ ኢየሱስ ፍጹም /2/*

ትውልድ በጊዜ በዕድሜ ሲወሰን
አንድ እንኳ የለም ሚመስልህ አንተን
የዘመን ምስጢር በአንተ ተገልጦ
ሥራህ ይታያል ጨለማን ውጦ /2/*

ፍጥረት ይወቅ ስሙ አዳኝ
ማንም የለም ስፍራው ሚገኝ
ለእነ ሙሴ ለነቢያት ሰርቶ የታየው በዘመናት
ለእነ ሙሴ ለነብያት ሰርቶ የታየው በቀደሙት

የእስራኤል ልጆች የቀደሙት
ከነገራቸው ሚጠብቁት
ማንነትህ ነው አንድነትህ
ለልጅ ልጅ/ለትውልድ/ የሚነገር ቃልህ  /3/ 2
',0),(NULL,'ይመጣል ኢየሱስ','Mulugeta2','በቅዱሳን ክብር ታጅቦ
በመላእክት ግርማው ተውቦ
ይመጣል ይህ ጌታ ሊወስደን
እንባን ከአይናችን ሊያብስልን/2/


ይመጣል ኢየሱስ ይመጣል
እነሆ በደጅ ቀርቧል /2/*
መቅረዝህን ሙላው ዘይት
ነቅተህ ጠብቀው ቀን ሌሊት /2/*

መከራ ችግር ፈተና
አይኖርም ትግል ከራስ ጋራ
ያበቃል ኑሮ የዚህ አለን
ከጌታ ጋር ስንኖር ዘላለም/2/

ነጩን ልብስ ለብሰን በጌታ ፊት
ስንዘምር አብረን ከመላዕክት
የሞተልን ያንን ፈቃር መድህን
ፊትለፊት እናያለን በአይናችን/2/

ያቺ ቀን የተለየች ከቀን
ምናይበት አስደናቂ ክብርን
ኢየሩሳሌም ማረፊያ ውብ አገር
ለቅዱሳን መኖርያ በፍቅር /2/
ወንድሜ ጠብቀው ተስፋህን እንዳትጥለው
እህቴ ጠብቂው ተስፋሽን እንዳትጥይው
የሱስ ግን ይመጣል ሊወስደን/2/ 2

እንግዶች ነን መጻእተኞች
ለዚህ ምድር ያልተገባን
ኢየሱስ ግን ይመጣል ሊወስደን/2/*
',0),(NULL,'በፊትህ አቆምከኝ','Mulugeta2','እጅህ ስለ ያዘኝ በቤትህ ውስጥ አለሁ
ሁሌ ምህረትህን እዘምረዋለሁ
ከክንፎችህ  በታች ተዘልዬ አድራለሁ
ፈቅጄ ከልቤ አንተን አመልካለሁ

አንተን ላምልክህ ኦ ሆ
ልስገድልህ አሃ
ላመስግንህ/2/ አምላኬ ነህ /2/*

በፊትህ አቆምከኝ በብዙ ምስጋና
እንደ ንስር ወጣሁ ኃይሌን አደስክና/2/*

የምትወደኝ ጌታ ነፍሴም የምትወድህ
ፍቅርህ ወረት የለው ድንቅ ነው ምህረትህ
ነፍሴ አንተን ባርካ ፈጽማ አትሰለችም
ውለታህ ብዙ ነው ቢነገር አያልቅም

ከእጆችህ በልቼ አሳድገኸኛል
የራሴ አይደለሁም መንፈስህ ገዝቶኛል
ነፍሴ ተደንቃለች መገረም ተሞላሁ
ከሰማሁት በላይ የሚበልጠውን አየሁ

አይኔ በርቶለታል ማን አዳኝ መሆኑን
ነፍሴ አውቀዋለች አምላክነትህን
ፍቅርህ ማይለወጥ ሁሌ የምትራራ
አንተን መርጫለሁ አልፈልግም ሌላ
',0),(NULL,'ለእኔ መልካም','Mulugeta2','አለሁ ቀና ብዬ በድል በከፍታ
ሁሉን ያረክልኝ አንተ ብቻ ጌታ
ልቤንም ያኖርኩት በአንተ ስለ ሆነ
ድል በእጄ ያዝያስከኝ ቃልህ የታመነ/4/

ለእኔ መልካም ለእኔ መልካም ነህ/3/ 
ለእኔ መልካም /2/*

ሁሉ ሲዘጋጋ ተስፋ እንኳን ሳይኖረኝ
ያመንኩት ሲሰሸኝ ዘመድ ከእኔ ሲርቅ
የያዝኩትን ሳጣ ተስፋ ሲወሰድ
ግራ አይገባኝም አልርቅ ከአንተ መንገድ/3/2

ምንም ባይኖር እንኳን አንተ ስላለኸኝ
ማግኘት ቢሆን ማጣት ከፍቅርህ እንዳይለየኝ
የቱስ ይበጀኛል ከአንተ ሌላው ለእኔ
የምትወደኝ ጌታ በቂ ነህ ለነፍሴ/3/ 2
ሕይወቴን ያስዋብከው
ሁሌ ለእኔ የምታስበው
ኑሮዬ/ጥላዬ/ ማረፍያዬ
ክፉዬን የማትወደው /2/*

አልሄድም ሌላ ጋ ሕይወትን ፍለጋ
ለእኔ መልካም ነህ
ረክቻለሁ በአንተ በሰጥኸኝ ሕይወት
ለእኔ መልካም ነህ
ክብርህን አያለሁ አንተን ተማምኜ
ለእኔ መልካም ነህ
በቤትህ አድራለሁ በጥላህ ሥር ሆኜ
ለእኔ መልካም ነህ
',0),(NULL,'ኃያላን ሲዝሉ','Mulugeta2','ኃያላን ሲዝሉ ድካም ሲውጣቸው
ዛሬ ግን የት አሉ ትናንት ያየናቸው
የአንተ ክብር ብቻ ሁሌም እያበራ
የምትኖር ዘላለም ክንድህ እየሰራ

ስንቱ አርፎ እፎይ ብሏል
በጥላህ ሥር ተከልሏል/3/*

ሌቱ እንኳን ባይነጋ ብርሃን ሲጨልም
ሁሌ በአንተ ዘንድ ጨለማ አይሆንም
በበረታው ክንድህ ትፈታለህ ከእስር
ከሚነደው እሳት ከሞት ተናጥቀህ
ድንቅ ነህ የእኛ ጌታ/ኢየሱስ/ ድንቅ ነህ/2/ 
በዘመናትኃይልህ/ክንድህ የበረታ/4/*

አንተ የዘላለም ሕይወት ነህና/4/

ጽድቅን ታበቅላለህ በድንቅ ችሎትህ
አንተ የዘላለም ሕይወት ነህና/4/
ፍጥረት አለም ሁሉ ይደነቃል በአንተ
አንተ የዘላለም ሕይወት ነህና/4/
ደካሙ ከድካሙ በረታ በአንተ
አንተ የዘላለም ሕይወት ነህና/4/
ጥላ ዕረፍት ላጣ እርካታ ሆንከው
አንተ የዘላለም ሕይወት ነህና/4/
',0),(NULL,'መዳኔ','Mulugeta2','ዛሬ በቤትህ ማደሪያ
ተመችቶኝ የአንተ ጉያ
ከወደኩበት አንስተህ
በደምህ የራስህ አድርገህ

ትምህክቴ ነው መዳኔ መስቀልህም ለእኔ/2/
እባቡን ጊንጡን ብረግጠው ሥልጣን በእኔ መኖሩ ነው
በክብር ሠረገላ ላይ አለሁኝ ከቅዱሳን ጋር
ትምክህቴ ነው መዳኔ መስቀልህም ለእኔ/2/

ሰው ለሚወደው ብጹህ ይሆናል
ለጠላቱ ግን ማን ይሞታል
ኅጥእ ሳለሁ በጨለማ ለእኔ ቆሰልክ ለእኔ ደማህ /2/*

መዳኔ ልዩ ነው መዳኔ/2/
የክብር ዕቃ ለአንተ የተለየሁ ካህን መሆኔ

ፍቅርህን ላውራው እንጂ ሥራህን ልመስክር
በመስቀል የዋልክልኝ ያንን ታላቅ ቁም ነገር
የገፈፍከው ያስወገድከው የመርገም ዕዳዬን
እንዳንተ የሆነልኝን አላገኝም ማንንም
መድህኔ/4*ኢየሱስ መድህኔ /3/


ሰው አረከኝ ለእኔ ሞተህ አንተ የቀራንዮ ሰው
ምንም ተስፋ አልነበረኝ በሰዎች ልብ የተረሳው
ዛሬማ ማመስገን መዘመር ችያለሁ
ሸክሜን ወስደህ በደስታ በነፃነት እኖራለሁ

መድህኔ .....
',0),(NULL,'ማዳንህ በስምህ','Mulugeta2','ጥንት ያልታወቀ ያልተገለጠው
እኔ ነኝ እኔ ለሙሴ ያለው
በአዲስ ኪዳን ቃል ሥጋ ሲሆን
አማኑኤል ታየ ሕዝብን ሲያድን

ማዳንህ/4* በስምህ

ስምህ ነው ኢየሱስ ምታድንበት
ሕዝብህን ከኃጥያት/ከደዌ ምትፈውስበት /2/
ለእኛ ገብቶናል ምስጢሩ በስምህ ያለው ማዳኑ /2/ 2

ለሕዝብ የሚሆን ታላቅ ምስራች
የተሰጠ ስም ከሰማይ በታች
ሌላ አንድም የለም ሚያስር የሚፈታ
ሁሉን የሚያደርግ ነፃ የሚያወጣ

አጋንንት ቢሆን ይንቀጠቀጣል
በሽታ ደዌ መቼ ፊትህ ይቆማል
እባቡን ጊንጡን የረገጥንበት
መህተማችን የምንድንበት

የኃጥያት ሥርየት ንስሐ በስሙ
ሕዝብን ሊያስታርቅ በገዛ ደሙ
ታላቅ የሆነ ከስሞች በላይ
የሚያድን የለም በምድር በሰማይ
ለእኛስ ገብቶናል ምስጥሩ  በስምህ ያለው ማዳኑ/4*

',0),(NULL,'ማደሪያዎችህ','Mulugeta2','ከአእላፋት ይልቅ ከወርቅ ከእንቁ የሚበልጥ
በቤትህ ደጆች መኖር የቃልህን ክብር ማየት
በቤትህ ደጆች መኖር የቃልህን ክብር ማየት/2/ 2*

አንተ የሕይወት ቃል አለህ - ከአንተ ወዴት ይኬሄዳል?
ከአለም ዝና ክብር ደጅህ ይመረጣል /2/

ማደሪያዎችህ ውቦች ናቸው - በቤትህ ያሉ የታደሉ /4/
ፍቅርህን የቀመሰ - ምህረት የገባው
ከደጆችህ አይርቅም - ድምጽህን አይንቅም /2/

የሕይወት ምንጭ ነው - ቃልህ ይፈውሳል
የላላው እንዳይወድቅ - ጉልበትን ያድሳል /2/*

ማደሪያዎችህ ....
ከአእላፋት ....
',0),(NULL,'አቤት እንዴት ድንቅ ነው','MuluKen1','አምላኬ ኤ ኤ ኤ ኢየሱስ ለኔ ያደረገው /2/
ምህረቱ እንዴት ድንቅ ነው  /2/
አቤት እንዴት እንዴት እንዴት ድንቅ ነው 
አቤት እንዴት ድንቅ ነው /2/
አቤት እንዴት እንዴት እንዴት ብዙ ነው 
አቤት እንዴት ብዙ ነው /2/

ከማንነቴ ጋር ምህረቱን ሳስበው
አንዳች እንኳ ለኔ ሚገባኝ አይደለሁ
ግን ታላቅ ምህረቱ በልጦ ከሁሉ በላይ
ይሄው እታያለሁ በክብሩ አደባባይ
ባይገባኝም ይህ ሁሉ ክብር ባይገባኝም
ባይገባኝም ይህ ሁሉ ነገር ባይገባኝም
ባይገባኝም ይህ ሁሉ ደግነት ባይገባኝም
ባይገባኝም ይህ ሁሉ ሞገስ ባይገባኝም /2/

ኃጢአት ሲያሳድደኝ እንደ ቃየል ስዞር
በዱር ምድረ በዳ በጥም ስቅበዘበዝ
መርቶ ያሳረፈኝ በለመለመው መስክ
አቤት እንዴት ድንቅ ነው የጌታዬ ምህረት
አቤት እንዴት ....
የምስጋና ምክንያት በሕይወት ዘመኔ
የኢየሱስ ምህረት ሆኖልኛል ለእኔ
የማያልቅ የማይቆም ከቶ የማይለወጥ
በምድር መስርቷል የዘላለም ምህረት
እዘምራለሁ ስለምህረቱ እዘምራለሁ
አከብረዋለሁ ስለምህረቱ አከብራዋለሁ
እልል እላለሁ ስለምህረቱ እልል እላለሁ
እደነቃለሁ ስለምህረቱ እደነቃለሁ
አምላኬ  .....
እዘምራለሁ.....
',0),(NULL,'ሰላም አገኘሁ','MuluKen1','ሰላም አገኘሁ በኢየሱስ ስም
እርካታ አገኘሁ በኢየሱስ ስም
ሕይወት ተሰጠኝ በኢየሱስ ስም
ጠላት ተገዛልኝ በኢየሱስ ስም /2/ 2

ከሥጋዬ ስለይ ከሞትኩኝ በኋላ
አቤት ወዴት ይሁን የእኔስ መድረሻ
እያልኩ ጠዋት ማታ ስፈራ ስጨነቅ
ሲኦል ድል ተነሳ በስምህ ስጠመቅ /2/
አቤት አቤት ኢየሱስ ስምህ ታላቅነቱ /2/
ከሚያስፈራው ሲኦል አዳነኝ ከጥልቁ ስምህ ታላቅነቱ
ከማይወጣበት ከዘላለም ሲቃይ
አወጣኸኝ ጌታ በስምህ ስልጣን ኃይል

ስምህ የእዳ ጽፌቴን
ስምህ ሁሉ ደመሰሰው ስምህ
ስምህ የዘንዶውን እራስ
ስምህ ውሃ ውስጥ ቀጠቀጠው ስምህ

መልካም በምትባል በቤተመቅደስ ደጅ
ተጥዬ የምለምን ነበርኩ አንካሳ ሰው
የጴጥሮስ አምላክ ስም በጽድቁ ጎበኘኝ
ቁርጭምጭሚቴ ጸና ፍጹም ጤና ሰጠኝ /2/
አቤቱ አቤቱ ኢየሱስ ስምህ ፈዋሽነቱ /2/
ለችግረኞች ሁሉ መፍትሔ አለው በውስጥህ ስምህ ፈዋሽነቱ

የልቤን ስብራት ቁስሌን ለጠገነው
ለገናና ስሙ እምበረከክለሁ
ስሙ እንቅቁልሼን ፈታው
ስሙ ታሪኬን ለወጠው ስሙ
ስሙ ደስታዬን ፈጸመው
ስሙ አረገኝ ሙሉ ሰው ስሙ

እንድንበት ዘንድ ለሰው የተሰጠ
ከስም ሁሉ በላይ ታላቅ ስም እያለ
ከቶ ምን ሊረባኝ ምን ሊጠቅመኝ ብዬ
የሌላ አማልክት ስም የምጠራው ባፌ /2/
ሁሌ የምጠራው በቃልም በስራ
ሕይወቴን ባረከው ጎዶሎዬን ሞላል/
ሙሉ አረገኝ ምንም የማልፈራ
ኢየሱስ ድንቅ መካር ስም
ኢየሱስ ማራኪ ውብ ስም ኢየሱስ
ኢየሱስ ትርጉም የሚሰጥ
ኢየሱስ የሚሰራ ስም ኢየሱስ  /.../
',0),(NULL,'ሠራተኞችን ላክ','MuluKen1','ክቡር ደምህ ለአለም ሁሉ ፈሷል
ለሰው ልጆች ብለህ በመስቀል ውለሃል
በዚህ ታላቅ ፍቅር ጥላ ያላረፉ
እጅግ ብዙ ናቸው የሚንከራተቱ
የምስራቹን ቃል ወንጌል ያላገኙ
እጅግ ብዙ ናቸው ከበረት ያልሆኑ

ጌታ ሰራቶኞችን ላክ
ኢየሱስ ሰራቶኞችን ላክ /2/

ለእንጀራ ሳይሆን ለጽድቅ የሚሮጡ
ዓለሙን ምኞቱን ስጋቸውን የካዱ
አደራ ያልከውን ወንጌል ተሸክመው
ወደ ምድረበዳ የሚሄዱ ደፍረው
ኢየሱስ አስነሳ ሸክም ያላቸውን
የእሳት ነበልባል አገልጋዮችህን
የቃልህን ሰይፍ ይዘው የሚገሰግሱ
የወንጌል አርበኞች ጽኑአን የሆኑ

እረኛ እንደሌላቸው ሕዝብህ ተቅበዘበዙ
የሰላምን አምላክ አንተን መች አወቁ
በየተራራው ላይ ለጣኦት አጠኑ
እንደመሰላቸው በመረጡት ሄዱ
ሳይወራላቸው ከቶ እንዴት ያውቃሉ?
ሳይሰበክላቸው እንዴትስ ያምናሉ?
ለእጃቸው ስራ በፍርሃት ሲሰግዱ
ያስፈልጋል ኢየሱስ የሚል ተመለሱ

መከሩ ብዙ ሰራተኛው አንሰዋል
የመከሩ ጌታ ሰራቶኞችን ላክ
ኃጢአት የሰራች ነፍስ ትሞታለች የሚል
ሕዝቡን መሪን ለቆ የማይሸነጋግል
እንደ ሙሴ ያለ የታመነ አገልጋይ
እግዚአብሔር ሆይ ስጠን የተቀባ ከላይ /2/
',0),(NULL,'ማን አለ ሌላ','MuluKen1','ማን አለ ሌላ ከኢየሱስ በቀር ክብር የሚገባው?
ማን አለ ሌላ ከኢየሱስ በቀር ምስጋና የሚገባው?
ማን አለ በሰማይ ማን አለ?
ማን አለ በምድር ማን አለ? /2/
ሁሉን የሰራ የሚገዛ
የአማልክት አምላክ ባለፀጋ
ኢየሱስ ብቻ
ሰማይን ዙፋኑ ምድርን መረጋጫ
ያደረገ አምላክ የከበረ ጌታ
በፍቅር የታወቀ በጽድቅ የበረታ
አምሳያ የሌለው ዘላለም ብቸኛ

ሁሉም ነገር ከእርሱ በእርሱ ሆኗል
በፈቃዱ ምክር አለማትን ፈጥሯል
እርሱ ብቻ ሊልቅ ሊከብር ይገባዋል
ሁሉን እንደ ወደደ በጥበቡ ሰርቷል
ፍጥረቶቹ ሁሉ ይናገሩለታል
እግዚአብሔር ሰሪያችን ታላቅ ነህ ይሉታል
ታላቅ ታላቅ ታላቅ ሁሉን የፈጠረ በስልጣን ቃል
ሃያል ሃያል ሃያል ማንም ያልቻለውን ማህተም ፈቷል /2/

ወደ ዘላለም ሞት ስንነዳ አይቶ
ሊረዳን የሚችል አንድም ፃድቅ ጠፍቶ
በሥጋ ተገልጦ ማህተሙን የፈታው
ኢየሱስ ብቻ ነው ክብር የሚገባው
ከእርሱ ሌላ አዳኝ አምላክ የለምና
ለሌላ የሚሆን የለንም ምስጋና
ማን አለ…

ፀሐፍት ፈሪሳውያን ብዙ ሲሯሯጡ
ከመቃብር በታች ዝናውን ሊያስቀሩ
መቃብር ፈንቅሎ ኢየሱስ ተነስቷል
መበስበስ አላየም የከበረ ስጋው
እኛ የምናመልከው ከሁሉ በላይ ነው
ለዘመኑ ቁጥር መጨረሻ የለው

ታላቅ ታላቅ ...
ሁሉን የሚሰራ  ...
',0),(NULL,'አዘጋጀን','MuluKen1','ኢየሱስ ስትመጣ በክብር ደመና
በመላዕክት ታጅበህ በሚያስፈራ ግርማ
በዋዘኞች ወንበር ቁጭ ብዬ እንዳልገኝ
ነቅቼ ልጠብቅ ዛሬ አዘጋጀኝ /2/

አዘጋጀኝ /3/ 
አዘጋጀኝ /3/
ዘወትር በማስተዋል 
በመንፈስ አስጉዘኝ /2/*

ሁሉነገርየከንቱከንቱነው
የዘላለምሕይወትከሁሉበላይነው
የጭንቀትቀንሳይደርስየምጥመጀመሪያ
በማስተዋልልጓዝሁሉንልካድእና /2/

ለምድራዊ ኑሮ ሌትተቀን ስባክን
ታላቁ መዳኔን ቸል ብዬ እንዳልጥል
ነፍሴንም ሥጋዬን አንተ ግዛው ጌታ
ለዘላለም እንድኖር በፃድቃን ከተማ /2/
እሩጫዬ ሁሉ እንዳይቀር ከንቱመና /3/
ከፊት ተጠርቼ እንዳልሆን ኋለኛ
ሁሌ ዝግጁ ልሁን /4/
ሁሌ በመንፈስ ልሁን /4/
ሁሌ በፍቅር ልሁን /4/

',0),(NULL,'ምህረትህ ይብዛልኝ ','MuluKen1','ምህረትህ ይብዛልኝ /ኢየሱስ/
ምህረትህ ይብዛልኝ /2/
ከምህረትህ በቀር ለእኔ ህይወት የሚሰጠኝ
ምንም ነገር እኮ የለም በፊትህ የሚያቀርበኝ
ከምህረትህ በቀር ለእኔ ጉልበት የሚሆነኝ
ምንም ነገር እኮ የለም ቅጥሬ የሚያዘልለኝ

 ከሕይወት ይልቅ ምህረት ይሻለኛል
ከአልማዝ ከእንቁ ለኔ ይበልጥብኛል
ከቶ ያለምህረትህ አንዲትም እርምጃ
መራመድ አልችልም እወድቃለሁ ወድያ
ምህረትህ ነው ኢየሱሴ ለኔ መመኪያዬ
ምህረትህ ነው ኢየሱሴ በትሬ ምርኩዜ
በምህረትህ እገባለሁ
በምህረትህ እወጣለሁ
በምህረትህ እቀመጣለሁ
በምህረትህ እነሣለሁ /2/

 ታላቁ ምህረትህ ዙሪያዬን ይክበበኝ
የጠላት ፍላፃ ጦር እንዳያገኘኝ
ምህረትህን ተሻግሮ ሊጎዳኝ የሚችል
ምንም እንደሌለ በዚህ እርግጠኛ ነኝ
ምህረትህ ነው ኢየሱሴ ለኔ ዋስትናዬ
ምህረትህ ነው ኢየሱሴ ለኔ እስትንፋሴ
ምህረትህ ነው የኔ ጋሻ
ምህረትህ ነው ከላላዬ
ምህረትህ ነው የኔ ክብር
ምህረትህ ነው ማምለጫዬ /2/

ቀንበሬን ሰባብሮ ቀና የሚያደርገኝ
ሐዘኔን አጥፍቶ በደስታ የሚሞላኝ
ለፀሎቴ ሞገስ ምላሽ የሚያሰጠኝ
ከምህረትህ በቀር አረ እኔ ምን አለኝ
ምህረትህ ነው ኢየሱሴ ክብርና ምገሴ /2/
ምህረትህ ነው መፅናኛዬ
ምህረትህ ነው ማረፊያዬ
ምህረትህ ነው የኔ ውበት
ምህረትህ ነው ማጽናኛዬ  /2/
ምህረትህ ይብዛልኝ ….
',0),(NULL,'የሱስ ሆይ አንተ','MuluKen1','የሱስ ሆይ አንተ ክብር የሚገባህ አምላክ ነህ
የሱስ ሆይ አንተ ምስጋና የሚገባህ አምላክ ነህ
ክብር በሰማይ ለአንተ ይሁን
ክብር በምድር ላንተ ይሁን
ክብር ክብር ክብር /2/

ታላቁ ክብርህን ጥለህ ምድር የወረድከው
መልክና ውበትህን አጥተህ የተንገላታኸው
ከዘላለም ሞት እዳ ከማያቆም ቅጣት
በእንጨት ላይ ተሰቅለህ ነፃ ያወጣኸን /2/
ኢየሱስ ሆይ አንተ .....
ክብር በአርያም በምድር ይሁን ብለው
መላዕክት ዘመሩ በፍቅርህ ተደንቀው
የአማልክት አምላክ የክብር ሁሉ ጌታ
የሰውን ልጅ ወደህ በበረት ስትተኛ  /2/
ክብር በሰማይ .....

እኛን ባለፀጋ ልታደርግ አንተ ሁሉን አጣህ
አለሙ ያንተ ሆኖ እያለ ተራብህ ተጠማህ
የሰማይ ወፎች ጎጆ ማረፊያ ሲኖራቸው
አንተ ግን መጠጊያ አጥተህ በምድር ተንከራተትህ /2/
የሱስ ሆይ አንተ ....
',0),(NULL,'ስለ እኔ የሚሟገተው','MuluKen1','ስለ እኔ የሚሟገተው እግዚአብሔር ነው
ስለ እኔ የሚዋጋልኝ እግዚአብሔር ነው
እጄን በአፌ እጭናለሁ
እኔ ዝም እላለሁ /2/  2

እኔ ስለራሴ አሃአሃ
አልከራከርም አሃአሃ
እሱ እስከሚመጣ አሃአሃ
ጌታዬን አልቀድምም
ሰይፌን ወደስገባው እከተዋለሁ
ለአንደበቴ ደግሞ ጠባቂ አኖራለሁ
አይኖቼን ሁልጊዜ ወደላይ አቀናለሁ
ታዳጊዬ ኃያል መሆኑን አውቃለሁ /2/
ዝም እላለሁ እጄን ባፌ ጭኜ
ዝም እላለሁ እጠባበቃለሁ
ዝም እላለሁ ጌታ ለዘላለም
ዝም እላለሁ አይጥልም አውቃለሁ
ዝም እላለሁ የሚቆረቆርልኝ
ዝም እላለሁ ስለኔ የሚሰማው
ዝም እላለሁ መልካም አባት አለኝ
ዝም እላለሁ ሲከፋኝ የማይወደው

ስለኢየሩሳሌም አሃአሃ
ዝም አልልም ያለው አሃአሃ
ስለጽዮንም ልጅ አሃአሃ
አሁን እነሣለሁ
ፅድቄን እንደፀዳል መዳኔ እንደፋና
እስከ ሚያበራልኝ ተሟግቶልኝ ጌታ
በእምነት በተስፋ እጠብቀዋለሁ
ስለኔ የሚቆመው እርሱ እግዚአብሔር ነው /2/
እግዚአብሔር እውነተኛ ዳኛ
እግዚአብሔር ፃድቅም ፈራጅ ነው
እግዚአብሔር ከተበደሉ ጎን
እግዚአብሔር የሚቆም አምላክ ነው
እግዚአብሔር የሚታመኑበትን
እግዚአብሔር እርሱ ያውቃልና
እግዚአብሔር ኃይል ይሆንለታል
እግዚአብሔር በእረፍት ፀጥታ
',0),(NULL,'የዘገየ ተስፋ','MuluKen1','አንተ መርዶክዮስ የእግዚአብሔር ባሪያ
ጌታህን የምትጠብቅ በንጉሱ መግብያ
አንድ ቀን አምላክህ በትእዛዙ ይነቃል
ለሕዝብ ሁሉ የሚተርፍ ተአምር በአንተ ይሰራል
ቀን አለው እግዚአብሔር ቀን አለው /3/
ጊዜ አለው እግዚአብሔር ጊዜ አለው /3/
የተጣለውን የሚያነሳበት
የተረሳውን የሚያስብበት
በከፍታ ያስቀምጠው ዘንድ
ምስኪኑን ከትብያ የሚያከብርበት

ሊያ በልጆችዋ ሁሌ ስታስቀናት
ያ መካንነቷ አንገቷን ሲያስደፋት
እግዚአብሔር በጊዜው ራሄልን አሰባት
የተባረከ ልጅ ዮሴፍን ሰጣት
የዘገየ ተስፋ ልብን ቢያሳዝንም
ወንድሜ ልመናህ ሳይመለስ አይቀርም/
እህቴ ጸሎትሽ ሳይመለስ አይቀርም /2/

የታየው ራእይ ሕልሙ እስኪፈጸም
በዘገየ ተስፋ ዮሴፍ ቢፈተን
ጀንበር ሳትጠልቅ አምላኩ ደረሰ
አስራ አንዱ ከዋክብት ለአንዱ ሲሰግድ አየ
የዘገየ ተስፋ ...

ቀን አለው እግዚአብሔር ቀን አለው /3/
ጊዜ አለው እግዚአብሔር ጊዜ አለው /3/
የተጣለውን የሚያነሳበት
የተረሳውን የሚያስብበት
ለምርጦቹ ለሚታገሱት
የብርታቱን ጉልበት የሚያሳይበት /2/
',0),(NULL,'ኦ ሃሌሉያ','MuluKen1','ኦ ሃሌሉያ /3/
በሰማይ የምትኖር ታላቁ ጠበቃ
ይድረስህ ምስጋና
በሰማይ የምትኖር ታላቁ ካህን
ይድረስህ ክብር
ይድረስህ ክብር /4/
ይድረስህ ምስጋና /4/

በግርማህ ክብር በቀኝህ ሆነህ
ምህረትና ጽድቅ ፍቅር ተሞልተህ
የምትሟገት ዘወትር ለእኛ
ይድረስህ ላንተ ክብር ምስጋና /2/
እውነት መንገድ ሕይወት ኢየሱስ
ወደ አንተ የመጣ መድረሻ አለው በእርግጥ /2/

በመጋረጃህ በስጋህ በኩል
ወደ አንተ ልንደርስ ድፍረት አገኘን
በዘላለም መንፈስ የሚፈሰው
ከክፉ ሕሊና የሚያነጻው
ቅዱሱ ደምህ ሰላማችን ነው 
ቅዱስ የእግዚአብሔር በግ ኢየሱስ
ከኃጢአት ያነጻል የከበረው ደምህ /2/
ይድረስህ ክብር ...

ሞት አያግድህ ዘመን እርጅና
አንተ ለዘላለም ካህን ነህ ለእኛ
በድካማችን የምትራራ
ጻድቅ ጠበቃ የማትረታ /2/
የጽድቅ ስራ ስለተገለጠ
አህዛብ በሙሉ ይመጣሉ ወደንተ
የአዲስ ኪዳን መካከለኛ
አማላጃችን አንተ ነህ ለእኛ /2/
ሁሉ በሁሉ አምላክ ኢየሱስ
አንተን የተጠጋ አያፍርም በፍጹም /2/
ኦ ሃሌሉያ /3/
በሰማይ የምትኖር ታላቁ ጠበቃ
ይድረስህ ምስጋና
እውነተኛው አምላክ የጌቶች ጌታ
ይድረስ እልልታ /4/
ይድረስ አምልኮ /4/

',0),(NULL,'ከዚህ በኋላ','MuluKen1','እስራቴን ከፈታኸው ቀንበሬንም ከሰበርከው
እነሆ ታላቅ ምህረትህ ለድህንነት ካደረከው
ለአንተ ክብር መኖር ነው የዘወትር ፍላጎቴ
ከዚህ በኋላ አልፈልግም መኖር በስጋ ምኞቴ
ከዚህ በኋላማ አሃሃ /3/
አንተ ግዛኝ ጌታ
ከዚህ በኋላማ እህህ /3/
ለአንተ ልኑር ጌታ

ሁልጊዜ ለስጋ ለእንጀራ መሮጥ
ኧረ ይበቃኛል ስለራሴ ማሰብ
እልፍ አርገኝ ኢየሱስ ለሌሎች ልጨነቅ
ለሚጠፉት ነፍሳት እለት እለት ላልቅስ
ባጠገቤ አንተን ያላወቀ እያለ ወንድሜ
ባጠገቤ በጠላት ሰንሰለት ተይዛ እኅቴ
ከቶ ምን ይባላል በትንሽ ትልቁ መጨነቅ ለራሴ?
ኧረ ምን ይባላል በትንሽ ትልቁ ማልቀስ ስለራሴ?
ልናገር ልመስክር /2/ የማውቀውን ነገር
ላገልግል ልሩጥ /2/ ዘመኔ ሳያልቅ

እኔን ስታድነኝ ስታወጣኝ ከዓለም
ለአላማህ እንጂ ለከንቱ አይደለም
ደስ የሚያሰኝህን እየመረመርኩኝ
መኖርን እሻለሁ እያገለገልኩኝ
ከዚህ በኋላማ ....

ስለእውነት ወንጌል ብዝዎች ተሰው
አንዳንዶቹ በእሳት አልፈውም ተሰጡ
እኔም የበኩሌን አበርክቼ ልለፍ
የሱስ በመንግስትህ የሚታሰብ ቀም ነገር
ባጠገቤ አንተን ያላወቀ.....
',0),(NULL,'የረዳኝ','MuluKen1','የረዳኝ እግዚአብሔር ነው የረዳኝ
የረዳኝ ጌታ ኢየሱስ ነው የረዳኝ
ከድቅድቅ ጨለማ ወደሚደንቅ ብርሃን ያውጣኝ
በለመለመው መስክ በሕይወት ጎዳና የመራኝ

ከእናቴ ጓዳ ኤሳው ሲያሳድደኝ
ወደማላውቀው ምድር አርቆ ሲሰደኝ
በምድር በዳ ላይ የተገለጠልኝ
እግዚአብሔር አምላክ ነው ብቻውን የረዳኝ
በመከራዬ በሃዘኔ የደረሰልኝ
የጭንቀቴን ድምጽ አድምጦ የመለሰልኝ
እግዚአብሔር አለቴ አምባዬ መድሃኒቴ ነው
የሕይወቴ ሰላም ጋሻዬ እርሱ ረዳቴ ነው
የሕይወቴ መታመኛዋ እሱ ረዳቴ ነው

የበረሃ ወይራ ሲሆን በፍጥረቴ
ከተስፋው ቃል ክብር የምኖር ርቄ
በአዲስ ቃል ኪዳን በደሙ አቀረበኝ
የዘላለም መንግስት ወራሽ አደረገኝ
ከተፈረደበት አለም በፍቅሩ ሳበኝ
ሁሉን የማሸንፍበት መንፈሱን ሰጠኝ
አምላኬ ምህረቱን በእኔ ላይ አጠነከረ
እንደ ንጋት ብርሃን ቸርነቱ ሄደ እየጨመረ /2/
የረዳኝ ......

ከእርሱ ሌላ ረዳት እኔ አምላክ አላውቅም
ጉልበቴን ለሌላ አላንበረከክም
ሁሌ የምሰግድለት እርሱ ረዳቴ ነው
በቀራንዮ መስቀል ስለእኔ የሞተው
ስራዬን ሁሉ የሰራው የፈጸመው
የምስጋናው እዳ በሕይወቴ እጅግ ብዙ ነው
ማልጄ እነሳለሁ ዘወትር ስሙን ልጠራው
እሻለሁ ቀን ሁሉ እንዳያልፈኝ ሳላመሰግነው /2/
ሳላመሰግነው አላልፍም /6/
ምስጋናው ምድርን ሁሉ ይምላው
ምስጋናው ለዓለም ይሰማ /2/
',0),(NULL,'ያም ይቅር','Meselch','ያም ይቅር /3/ ይሄም ይቅር /3/
ለኔ ግን - ጸጋህ ይሻለኛል
ለኔ ግን - ምህረትህ ይሻለኛል
ለኔ ግን - ሰላምህ ይሻለኛል
ለኔ ግን - በስምህ ያለኝ ክብር ይሻለኛል

የሱሴ ለኔስ ውበቴ - አለኝታህ ክብሬ ማእረጌ
ጌታዬ ለኔስ በቂ ነህ - ምንም ከቶ ያልጎደለህ
እኖራለሁ በአንተ ረክቼ - በምህረትህ ተሸሽጌ
አለምን ክብሯን ረስቼ - ጌታዬ ተስፋዬ ብዬ

ከጸጋህ የሚበልጥብኝ - ከፊትህ እኔን ሚያርቀኝ
ከልቤ ውስጥ የማኖረው - ምን አለኝ ውዴ ነው ምለው?
ከንቱ ነው ሁሉም ከንቱ ነው - ያው ይሄም እዚሁ ቀሪ ነው
የሱስን ብል ይሻለኛል - ሰላሙን ብቻ ይበቃኛል

ተስፋ አለኝ ብኖር ከግርህ ስር - ታምኜህ በሃያሉ ስምህ
እያየሁ ጌታዬ እጅህን - ሳልጥል ምህረትህን
ሰላሜ እርካታዬ - የሱሴ ለኔስ መድህኔ
ብቆይ ከግርህ ስር - ጸጋህን እኔስ በቃኝ
',0),(NULL,'ቀን አለው','Meselch','አለው አለው ጊዜ አለው አለው
አለው አለው ቀን አለው አለው /2/
ለመዋረድ ለመክበርም
ሁሉን አልፈን የሱስን/ጌታችንን ለማየት /4/ /2/

የሱስ የማይችለው ኧረ ምን ይገኛል?
ተራራ ኮረብታው ሁሉ ይታዘዘዋል
አስፈሪውን ባህር በሃይሉ ይከፍላል
ሁሉንም በጊዜው ውብ አርጎ ይሰራል

እውሩን ሊያበራ - ጊዜ አለው ኢየሱስ
አንካሳን ሊያዘልል - ጊዜ አለው ኢየሱስ
የተራበን ሊያጠግብ - ጊዜ አለው ኢየሱስ
ሁሉንም ሊሰራው - ጊዜ አለው ኢየሱስ

የሞተን አንስቶ - በህይወት ያኖረዋል
ውርደታችንንም - በክብር ይለውጣል
አፋችንንም ደግሞ - በሳቅ ይሞላዋል
ሁሉንም በጊዜው - ውብ አርጎ ይሰራል

እንጠብቅ በትእግስት - በጊዜው እስክያየን
ጨርሶ አላማውን - እስከሚጎበኘን
በእውነት አይጥለንም - ኢየሱስ ታማኝ ነው
ፍቅሩ የማይለወጥ - እውነተኛ አባት ነው
',0),(NULL,'ሰው ቢችል','Meselch','ሰው ቢችል - ቢኖር እንዳሳብህ
ሰው ቢችል - ቢኖር እንደ ቃልህ
መካሪ - አስተማሪ አምላክ ነህ
በቀናው መንገድ ላይ - ታሰማራውአለህ /2/

ሃሳብህ መልካም ነው ፈቃድህ ተድላ ነው
ሰው በቃልህ ቢኖር ለህይወቱ መልካም ነው
መካሪ ቅን ፈራጅ አምላክ ነህ
እንቅፋቱን ሁሉ ታነሳበታለህ

ባስቀመጥከው ስፍራ ቢችል ቢቀመጥ
ልቡን ቢበርድልህ የራስህን እንድታደርግ
ተራራ ኮረብታው ታፈርስለትለህ
በሚመቸው ስፍራ አንተ ታኖረዋለህ

ታምኖ በቃልህ ከእግርህ ስር ቆይቶ
ኧረ መቼ አየነው ባዶ ተሸምቶ
አዛኝ ነህ የዋህ ነህ ትሁት ነህ
ወደ ህይወት ውሃ ምንጭ የሱስ ትመራለህ

ሰው ቢሻህ የሱስ ኧረ እንዴት መልካም ነው
ለቃልህስ ቢታዘዝ ሰላም በረከት ነው
ይለማል ያፈራል እጅግ ያድጋል
በቤትህ እፎይ ብሎ እረፍትን ያገኛል
',0),(NULL,'ሰው አንተን','Meselch','ሰው አንተን /4/ ብሎህ የህይወት ጌታ
ሰው አንተን /4/ ብሎህ የሱስ የኔ አለኝታ
አላየሁም ሲጣል ሲረሳ ተስፋውን ሲጠፋ
አላየሁም ሲጣል ሲረሳ ተስፋውን ሲጠፋ /2/

የሱስ መንገዴ ማምለጫ አለቴ
መታመኛዬ ውዴ ነህ መሸሻዬ
ተደገፍክቡህ ምቹ ነህ አውቃአለሁ
ጌታዬ ባንተ ሁሉንም ሆኛለሁ /2/

አንተን ሰው አይቶ በሃይልህ ተመክቶ
በቃልህ ኖሮ እግርህ ስር ሰውቆይቶ
ሲለማ አየሁኝ ተስፋውም ሲታደስ
ከተረሳበት በፍቅርህ ሲታሰብ /2/

ዛሬም እኖራለሁ በፊትህ እቆያለሁ
የሱስ አንተነህ አንተን ብቻ እኔ አያለሁ
ታማኝ ነህ ጌታ ይህንን አውቃለሁ
ይኸው ግዛኝ ያንተ ነኝ ወድሃለሁ /2/
',0),(NULL,'ባህሩን','Meselch','ባህሩን የማትሻገረው መስሎ ቢታይህ
መከራህም ከፊትህ ማይሸሸ መስሎ ቢያስፈራህ
የአብረሃም አምላክ ዛሬም ታማኝ ነው
የይሳቅ አምላክ ዛሬም ታማኝ ነው
ባህሩን ከፊትህ እያለፈ ይከፍላል
ሰቆቃህን ሁሉ ካንተ ያርቀዋል /2/

እጅ ወደሱ ሄዶ ባዶውን አይመጣም
ምላስም ጠርቶት አፍሮም አያውቅም
ለጠራው ሁሉ እጁ ሰፊ ነው
ጨክኖም አያውቅ ገራገር ነው

አገልግለኸው ከቶ አይጥልህም
ታመን በስሙ እርሱ አይረሳህም
የለም ተራራ በስሙ ማይፈርስ
የሱስ ሃያል ነው የሁሉ ንጉስ

የአብረሃም አምላክ ሁሉም ቻይ ነው
ምድረ በዳ ላይ መና ሰጪ ነው
ምስጋናን ሰዋ ስገድ ከግሩ ስር
ያኔ ይርቃል መከራ ችግር

ማድጋህ ሁሉ ይሞላል ዘይት
የሱስ ታማኝ ነው ጠብቅ በትእግስት
ከአባትም አባት እርሱ ቸር ነው
በሰቆቃህ ቀን ፈጥኖ ደራሽ ነው
',0),(NULL,'ዛሬ ናት','Meselch','ዛሬ ናት ያንተ ቀን
በጉብዝናህ ወራት ፈጣሪህን አስብ
ጉልበትህ ሳይደክም ቀኑም ሳይጨልም
የአስጨናቂው ቀን ፈጥኖ ሳይደርስብህ /2/
ተነስ ተዘጋጅ አገልግል የሱስን
አትርፍ መክሊትህን

ዛሬ ናት ያንተ ቀን አገልግል የሱስን
ሳትደክም ሳትሰለች አትርፍ መክሊትህን
ለመታሰቢያ እንዲሆን በጭንቀትህ ቀን /2/

ከዚህ አለም መሄጃ መሸኛ እንዲሆንህ
መስፈርህን ሙላው ዋጋ ዲከፈልህ
ለሰራኸው ስራ ብድራትህ እንዲሆን /2/

በአብረሃም እቅፍ ለመኖር በጽዮን
ከዘለአለም ሲቃይ ከገሃነብ ለመዳን
አገልግል የሱስን ዛሬ ናት ያንተ ቀን /2/

መልክና ውበትህ እንደሚያልፍ አትርሳ
ሃይልና ጉልበትህ እንደሚያልፍ አትርሳ
ሞትና ሲኦልም እንዳሉ አትርሳ /2/
',0),(NULL,'አስታውሳለሁ','Meselch','አስታውሳለሁ እንዴት እረሳለሁ
ላምልከው እንጂ እንዴትስ ዝም እላለሁ
የመከራን ባህር ከፍሎ ያሳለፈኝን
በምድረ በዳው ላይ መና የሰጠኝን
የሱስ ውለታውን አስታውሳለሁ
ጌታ ቸርነቱን እናገራለሁ /2/

ምንም በሌለበት በምድረ በዳው ላይ
መናውን እየመገበኝ ከላይ ከሰማይ
ከደረቁ ድንጋይ ውሃ አፍልቆ ሰጠኝ
ከመከራም ሁሉ የሱስ/ውዴ አሳረፈኝ
እንዲህ ተንከባክቦ በቤቱ አኖረኝ /2/

ደራሽ ባጣሁኝ ቀን የሆነኝ ወገኔ
ከወዳጄም ወዳጅ የማይረሳ አባት
በጨነቀኝ ጊዜ ፈጥኖ ደረሰልኝ
እንባዬን ካይኔ ላይ በጁ እያበሰልኝ
ያለ እሱ ማን አለኝ አይቶ የራራልኝ? /2/

ፍጹም የማልረሳው ባለውለታዬ
አዞሽ ባይ አጽናኜ ኢየሱስ ጌታዬ
ሥራው አወራለሁ እጁን አስባለሁ
ታላቅ ቸርነቱን እኔ እናገራለሁ
ለስሙ ለክብሩ ዘምርለታለሁ /2/

ምስጋና ይብዛለት ለዚህ ታላቅ ጌታ
በፊቱ ይትረፍረፍ ዝማሬ እልልታ
እጁ ያለባችሁ አብረን እናመስግን
ለቸሩ እየሱስ/ጌታችን እንበል እልል እልል
ለዚህ ላደረሰን እንበል እልል እልል /2/
',0),(NULL,'ምንም ቢሆን ምን','Meselch','ምንም ቢሆን ምን - ማእበሉ ቢነሳ
ምንም ቢሆን ምን - ተስፋውም ቢጨልም
ፈቃድህ ግን ኢየሱስ - አንተ ያልከው የሱስ
መሆኑ አይቀርም - አይቀርም /2/

ማእበሉ ቢያይል ተስፋ ቢጨልም
ልቤ ምሻቱ እንዳልኩት ባይሆንም
ነገር ባይሞላ ዛሬ እኔ ሳየው
መላው ቢጠፋ መውጫው ቢጠፋ
የሱስ ስታየው ሁሉ ሙሉ ነው
የሚያቅትህ ከቶ ምንድ ነው? /2/
ምንድ ነው ኧረ ምንድ ነው?

በቤትህ ስኖር በቅፍህ ሳድር
እኔ አልሰጋ ከቶም አላፍር
የሱስ ፈቅደኸው አንተ ብለሀው
ሳይሞላ ሳይሆን ቀርቶ ምን ይቅር?
ኤልሻዳይ አምላክ ሃያል ገናና
ልሰዋ እንጂ ላንተ ምስጋና /2/
ላንተ ምስጋና ምስጋና

የታመንኩብህ የአብረሃም አምላክ
ዛሬም ታላቅ ነህ ክንደ ብርቱ ነህ
ማን አፈረብህ ተመልክቶብህ
 ጌታዬ ብሎ አባቴ ብሎ?
በፊትህ የለም ትልቅ ተራራ
አበቃ ሲባል የምትሰራ /2/
የምትሰራ ኢየሱስ
',0),(NULL,'ባህሩን ከፍለኸው','Meselch','የናሱን በር ሰበረው - ያንን ባህር ከፈለው
እኔም መጣሁኝ ተሻግሬ - ለእስራኤል አምላክ እልልታ ይዤ
እኔም መጣሁኝ ተሻግሬ - ለያእቆብ አምላክ አምልኮ ይዤ /2/

ዞር ብዬ ሳይ ከኋላዬ - ለካስ ተቀብሯል ያ ጠላቴ
ቀድሞኝ የለም ወይ መድሃኒቴ - ተዋግቶልኛል ውድ አባቴ /2/

ዛሬ አምልኮ ነው እልልታ ነው - ይዤ የመጣሁ ዝማሬ ነው
ለእስራኤል አምላክ እልልል - እኔም በፊቱ ልዘምር /2/

እንባ ካይኔ ላይ ታብሶልኝ - የሱስ ወዳጄ ታቀፈኝ
የናሱን በር ሰባበረው - ሰቆቃዬንም ከኔ አራቀው /2/

እስቲ አክብሩልኝ ዘሙሩለት - የሱስ ጌታዬን ንገስ በሉት
ቸሩ አምላኬን ከፍ አድርጉት - ክብር ውዳሴም አቅሩቡለት /2/
',0),(NULL,'መሃሪ ነው','Meselch','መሃሪ ነው ይቅር ባይ /2/
አትራቀው የሱስ ቸር ነው
አትለየው ትሁት ነው
ና የሱስ ይሻለሃል ና
ና አንተ ራቅ ከክፉ ና

የሱስ የሞተልህ - አይደለህም ወይ ልጁ
ታድያ ለምንድ ነው - መራቅህ ከእቅፉ?
ድካሙን ከንቱ ከንቱ አታርገው
ይህን የዋህ አምላክ ኧረ ተው አትፍራው

ብቃያው እኮ ነህ - በጁ የተከለህ
ለርስቱ ለይቶ - ለራሱ የመረጠህ
ስላንተ ከማሰብ - መች ዘንግቶ ያውቃል
ከፊቱ ስያጣህ - አንጀቱ ይለወሳል

ኑሮ ይመቻል ወይ - ርቆ ከየሱስ?
ሰላም ይሆናል ወይ - ትቶ መድሃኒትን?
ና ይለሃል የሱስ - እጆቹን ዘርግቶ
ምህረት ቸርነቱን - ፍቅርህን ተሞልቶ
',0),(NULL,'ተፈታሁ ከስራት','Meselch','ተፈታሁ ከእስራት - ወጣሁኝ ከዚያ ማቅ ውስጥ
ልነሳ እስቲ ላክብረው - የሱስን ከፍ ላድርገው
ልነሳ እስቲ ላንግሰው - መድሃኒቴን ላሞጓግሰው /2/

ማን ይቁም በፊቱ ጌታዬ ሲነሳ? - ምስኪኑን ሊፈታ
ሸክሙን አራግፎ የራሱ አድርጎ - ሊያከብረው ሲመጣ
አለሁኝ የሚል ፍጹም የሚያስመካ - ልጆቹን ማይረሳ
ኧረ ማን እንደ እሱ እንደ ጌታ የሱስ - የሚሆን አለኝታ?

ወረደ ከክብሩ አዘነልኝ ውዴ - እኔንን ፍለጋ
ውርደቴን ተዋርዶ ክብሩንን ሊያለብሰኝ - ፍቅሩን ይዞ መጣ
ጨለማዬ በራ አይኔም እሱን አየች - ነፍሴ በሱ ረካች
ዛሬ በእልልታ የሱስን ልታነግስ - ወደ ፊቱ ማጣች

የሱስ ምህረቱን የማያልቀው ፍቅሩን - ይኸው በኔ ታዬ
ከንፈሬ ወደቀ ጌታዬ መንፈሱ - በላዬ ነገሰ
ማቄንም ቀደደው ሃዘኔን አራቀው - ፍቅሩ በሱ ሞላ
እኔም ልጨምር ደግሜ እንደገና - ለስሙ ምስጋና
',0),(NULL,'ዛሬም ባይመስልም','Meselch','ዛሬ ባይመስልም
መንገዱ ሁሉም በእሾህ ቢታጠርም
አንተ ግን ኢየሱስ በኔ ያለው አላማህን
እንደምትፈጽም አውቃለሁ ይሄንን /2/

አልመለስም ገና ወደ ኋላ
ማእበል ወጄቡን እጅግ ቢያስፈራ
የተናገርከኝ ታላቁ ጌታ
አለህልኛና ከፊት ከኋላ

ተጠርቻለሁ በቀራንዮ ደምህ
በማይለወጠው በታላቁ ስምህ
አለህ በውስጤ የሱስ ብርሃኔ
እሳቱን አይቶ አይፈራ ልቤ

እሄዳለሁ ገና እሮጣለሁ
ከፊቴ የሱስ አንተን እያየሁ
በተራራው ላይ ስምህ እጠራለሁ
ቃልህን ተናገር አሸንፋለሁ

እጠብቃለሁ ዛሬም አያለሁ
ቅደመኝ ኢየሱስ እከተላለሁ
ድምጽህን ሰምቶ ማይፈራ ማን ነው?
ቃልህ ይሰራል ዛሬም ህያው ነው
',0),(NULL,'ከየትኛው','Samson1','ከየትኛው ልጀምር ያንተን ምስጋና /2/
አንተን ለማመስገን ምክንያት የሚሆን ሥራህ
እጅግ ብዙ ነውና /2/ 2

ደህንነቴ ጤንነቴ
በሰላም ወጥቼ መግባቴ /2/
ሊያጠፋኝ የሚችል ብዙ ሆኖ እያለ
ባንተ ተጠብቄ ይኸው እኖር የለ
የኖርኩት ባንተ ነው እኔ በምን አቅሜ
ተመስገን ልበልህ ኢየሱስ ደግሜ ደግሜ

ተመስገን - ስለደህንነቴ
ተመስገን - ስለጤንነቴ
ተመስገን - ስለእስትንፋሴ
ተመስገን - ስለዳነች ነፍሴ /2/

ምን አጣሁኝ ምን ጎደለኝ
የሱስ ስላለኸኝ ሁሉ አለኝ /2/

ምስኪን ድሃ ስሆን ነገር ግን ሁሉ አለኝ
የምሞት ስመስል ባንተ ግን ህያው ነኝ
ሐዘንተኛም ስሆን ባንተ ደስ ይለኛል
አንተን ሳመሰግን ኢየሱስ የጠፋው ይገኛል

ተመስገን - ስለጎደለው
ተመስገን - ሞልቶ ስላለው
ተመስገን - ቢኖርም ባይኖርም /ቢሞላም ቢጎድልም/
ተመስገን - ምስጋናህ አይቀርም /2/

ከየትኛው ልጀምር ....

',0),(NULL,'ንገሩት','Samson1','ለኔ ጥፋት ሲተጋ የነበረው ያ ጠላት
ተስፋ ይቁረጥ ንገሩት ከቶ እንደማይሆንለት
ሞተዋል ብሎ ሰያስፈራ በገጠር በከተማ
ይኸው ቁርጡን ይወቀው በሕይወት አለሁ እኔማ /2/

አልሞትኩም አለሁ ገና እኖራለሁ /2/
ለኢየሱስ /ለአምላኬ/ ክብር ዘምራለሁ /4/

ለኔ ጥፋት ብሎ የሞላውን ዋንጫ
ራሱ ተጎነጨው ጠላት የለው ምርጫ
ከሞት ነጻ ወጥቷል ግዛቱ ክልሌ
የድል ዋንጫ ላንሳ ላማረው እድሌ

ሞት የተሻረለት ልክ እንደ እኔ
የሱስን ለማምለክ ይቁም ጎኔ
ለሱ መታሰብያ ለሱ ክብር
ሥራው በዚህ ትውልድ ይዘመር /2/

ሥራው /4/
ከተባለለት በላይ ነው
ከተነገረው በላይ ነው /2/

ድካም የለብኝም ኃይለኛ ሆኛለሁ
ማሸነፍ ነው እንጂ ሽንፈት መች አውቃለሁ
የቃሉን ጦር እቃ ትጥቄን ለባብሼ
ወደ ፊት እሮጣለሁ ምሽጉን አፍርሼ

ኢየሱስ ከፊቴ ቀድሞ ሄዷል
ድንጋጤ በጠላት ላይ ወርዷል
እኔም በምስጋና ልከተለው
ቅዱስ የተፈራህ ነህ ልበለው /2/

ቅዱስ /4/
የጭፍሮች አምላክ ኢየሱስ
የጌቶች ጌታ ኢየሱስ
የአማልክት አምላክ ኢየሱስ
የጭፍሮች አምላክ ኢየሱስ
',0),(NULL,'ይለያል','Samson1','ሁሉን በስልጣን ማድረግ የሚችል
የማይሸነፍ ጉልበቱ የማይዝል
ትናንት ዛሬ ወደ ፊት ኃያል
ሰዎች ከሚሉት የሱስ ይለያል /2/

ይለያል /3/ የሱስ ይለያል /4/

ከምድር አይደለም ከሚጠፋው ዘር
ጠፊና በስባሽ ከሆነው አፈር
በምስሉ ቢገኝ እንደ ሰው ሆኖ
የሱስ ልዩ ነው ከሰው ተፈጥሮ

ከምድር ነገስታት ጠቢባን ጋራ
እኩል አድርገው ቢሰጡት ስፍራ
ይካፈል ቢሉም ምርኮን እንደ ሃያል
ከሰው ልጆች ግን የሱስ ይለያል /2/

እዚም እዛም ከሚጠራው
በምድር ላይ ጌታ ከተባለው /2/

ይለያል /3/ የሱስ ይለያል /4/

ብዙ ኃያላን ተነስተው ነበር
ግን ሊያልፉ አልቻሉም የሞትን ድንበር
ተቀላቅለዋል ከሙታን ሰፈር
ለሞት ተገዝተው ለብሰዋል አፈር

ኃያልነቱን በሞት ላይ ገልጾ
የጥል ግድግዳውን በስጋው አፍርሶ
አንድን አዲስ ሰው መፍጠር የቻለ
ከኢየሱስ በቀር ሌላ ማን አለ /2/

ማን አለ /3/ ሌላ ማን አለ/4/

በፈራሽ ስጋ ሞት በሚውጠው
አይደለም የሱስ የተገለጠው
ሰማያዊ አካል ነው የከበረ
በትንሳኤው ኃይል ሞትን የሻረ

ተቀብሮ አልቀረም ለሞት ተገዝቶ
በክብር አርጓል በድል ተነስቶ
የአዳም ዘር ጥቂት ቢኖረው ኖሮ
በቀረ ነበር የሱስ ተቀብሮ /2/

የማርያም ልጅ ከተባለው
ሰው በራሱ አሳብ ከሚያመልከው
እግዚአብሔር ወልድ ከተባለው
ሰው በራሱ አሳብ ከሚያመልከው
ይለያል...
',0),(NULL,'በኔ ላይ','Samson1','በኔ ላይ ተላልፎ የጥፋት ውሳኔ - የጥፋት ውሳኔ
በጣት የሚቆጠር ሆኖብኝ ዘመኔ - ሆኖብኝ ዘመኔ
ሞት ተበይኖብኝ በግዞት ተጥዬ - በወህኒ ተጥዬ
ተስፋዬ ተሟጦ ሳለሁ ታሴን ጥዬ - ሳለሁ ራሴን ጥዬ
ሲዝት ሲያስፈራራኝ ሞት ከፊቴ ቆሞ - ሞት ከፊቴ ቆሞ
በቄሳር ማህተም በንጉስ ታትሞ - በንጉስ ታትሞ
ሞቴን ስጠባበቅ ከዛሬ ከነገ - ከዛሬ ከነገ
እኔ ያልጠበኩት ድንቅ ተደረገ - ታምር ተደረገ

የወህኒውን ደጆች በስልጣኑ ከፍቶ
አነቃኝ መልአኩ እስራቴን ፈትቶ
የሱስ ወዷልና እንዲያድነኝ ፈጥኖ
ከሞት አመለጥኩኝ መዳን ለኔ ሆኖ

ህልምን የማይእንጂ የእውነት መች መሰለኝ እኔ
ባልጠበኩት ሰአት ድንገት መዳን ሲሆን ለኔ
ያሰረኝ ሰንሰለት ጠብቆ እጅ እግሬን ጠርቆ
ከመሬት ወደቀ ላልቶ እንደ ፈትል ወድቆ
በግራ በቀኜ ወድቆ የከበበኝ ጭፍራ
በሩን አሳለፈኝ እኔን በድል እየመራ
ከቁጥር ላለፈው እጅግ ለበዛው ውለታ
ምስጋና ይድረሰው ዛሬ ለሰራዊት ጌታ
ምስጋና ይድረሰው ለሰራዊት ጌታ /2/
አምልኮ ይድረሰው ለሰራዊት ጌታ /2/

በአለም ከሚኖር ሰው ለየት በማለቴ /2/
የሱስን ሳመልከው ቀንቶብኝ ጠላቴ /2/
ከምድር ሊያጠፋኝ ከነ ዘር ማንዘሬ /2/
ግዳዩ ሊያደርገኝ ሲጎመጅ እንደ አውሬ /2/
በንጉስ ትእዛዝ ደብዳቤው ተጽፎ /2/
ወደኔ እንዲገደል መመሪያ ተላልፎ /2/
የምሞትበትን ስጠባበቅ ቀኔ /2/
እያልኩኝ ስጨነቅ ማን ያድናል እኔ /2/

ትእዛዝ በትእዛዝ አምላኬ ቀይሮ
አንገቱን አስደፋው ሓማን አሳፍሮ
ባስተከለው እንጨት መሰቀያ ለኔ
ጠላት ተሰቀለ እያየሁት ባይኔ

ጠላት ያቀደውን ሳይሆን የሱስ አውቆት ኖሮ
አስቀድሞ ገብቷል ለካስ ከንጉሱ ቢሮ
የሚሆነው ሁሉ የህልም እስኪመስለኝ ድረስ
ትእዛዝ ተላለፈ ፈጥኖ በጋላቢ ፈረስ
ሊሆን የነበረው ቀን የለቅሶዬ የሰቆቃ
ሆኖ ተቀየረ የድል የሳቅ የፍንደቃ
እኔን ለታደገው አምላክ ከጥፋት አደጋ
ምስጋና ብቻ ነው ዛሬ የምከፍለው ዋጋ
ምስጋና ብቻ ነው የምከፍለው ዋጋ /2/
አምልኮ ብቻ ነው የምከፍለው ዋጋ /2/
ምስጋና ብቻ ነው የምከፍለው ዋጋ /2/
',0),(NULL,'ኢየሱስ ካለ','Samson1','አልአዛር ቢሞትም ቀኑን አትቁጠሩ
ያኖራችሁበትን ለኢየሱስ ንገሩ
አራት ቀን ሆኖታል ይሸታል አትበሉ
ሂዱና ድንጋዩን ብቻ አንከባሉ /2/

ቃልን ሲናገር የሱስ መጥቶ
ሙቱም ይነሳል ድምፁ ሰምቶ
ልቀቁት ይሂድ ፍቱትና
እናንተ ቁሙ ለምስጋና /2/

ያለቀ ቢመስል የተዘጋ
ለኢየሱስ የለም የሚያሰጋ
ሲታይ ቢመስል የጎደለ
ኢየሱስ ካለ ሁሉም አለ /2/

ኢየሱስ ካለ ሰላም አለ
ኢየሱስ ካለ ደስታ አለ
ኢየሱስ ካለ እረፍት አለ
ኢየሱስ ካለ እፎይታ አለ
ኢየሱስ ካለ ታምር አለ
ኢየሱስ ካለ ፈውስም አለ
ኢየሱስ ካለ መዳን አለ
ኢየሱስ ካለ ድንቅም አለ

ጎልያድን ለመጣል በሸለቆው ሰልፍ
አያስፈልገኝም የንጉሱ ሰይፍ
ከአንበሳና ከድብ ያስጣለኝ ወዳጄ
አምላኬ ይሰጠኛል ጎልያድን በእጄ /2/

ህያውን አምላክ ቢገዳደር
ይወድቃል በአንዲት ትንሽ ጠጠር
ጠላት ተመቶ ወድቋልና
ምርኮን ሰብስቡ ተነሱና /2/
ያለቀ ....ኢየሱስ ካለ ...
',0),(NULL,'ስሙ','Samson1','አቤት ስምህ የሱስ ስምህ
አቤት ስምህ ድንቅ ስምህ
አቤት ስምህ የሱስ ስምህ
አቤት ስምህ ኃያል ስምህ
የሱስ የሰራልኝ አጥር ስሙ የቀጠረልኝ ቅጥር /2/
በምንም የማይደፈር ለማንም የማይበገር
በእሳት የማይደፈር ለወጀብ የማይበገር
በጎርፍም አይሸረሸር በንፋስ አይገፈተር

ቁርስ ምሳ ያልበላ በጉድጓድ የዋለ የተራበ አንበሳ
ፍራሽ ሆኖኝ አደርኩ ተንተርሼው ተኛሁ ከስሙ የተነሳ
ማለዳ ይምጣና በህይወት መኖሬን ይወቀው ንጉሱ
በአንበሶች መበላት መሰበር አይደለም የፀሎቴ መልሱ

መልሱ ሲመጣማ የጸሎቴ ዋጋ
የተራቡ አንበሶች አፋቸው ተዘጋ
አቅፈው አሳደሩኝ ወዳጅ ሆኑኝ ለኔ
ተመችቶኝ ተኛሁ ተደላድሎ ጎኔ

ለኔ ወዳጅ ሆነው ተርበው ስላደሩ
ክፉ ጠላቶቼን ፈጥነው ሰባበሩ
የንጉሱን ትእዛዝ ጣሰ እንዳልተባለ
እንደ ዳንኤል አምላክ ማን አለ ተባለ
ከፍታ ላይ ወጣሁ ታሪኬም ታደሰ
በከሳሾቼ ላይ ኢየሱስ ነገሰ
ነገሰ ኢየሱስ ነገሰ
ነገሰ አምላኬ ነገሰ /3/

በፈተናው መሃል ምንም ሳልጎዳ በክብር የማልፈው
የሱስ ካጠገቤ አብሮኝ ስላለ ነው ሁሌ የማሸንፈው
ከሳሼ ሲበላ ለኔ ጥፋት ብሎ ባነደደው እሳት
ከፍታ ላይ ወጣሁ እኔ ግን አምልጬ ከጨካኙ ግዛት

ከሳሼ ተጥሏል ዳግም መች ይነሳል
ለሰው በማይታይ ክንድ ተደቁሷል
በአፌ የጠራሁት የኢየሱስ ስም
ሰባብሮ ጥሎታል የጠላቴን ቅስም

ረዳት ለመፈለግ ሰማይ እኔ አልወጣ
ባህር አልሻገር መድሃኒት ላመጣ
ፊቴ የተጋረጠውን ሰባብሮ ለማለፍ
የሱስ ማለት ብቻ በቃኝ ለማሸነፍ /2/
በቃኝ በቃኝ ለማሸነፍ
ኢየሱስ /አምላኬ/ በቃኝ ለማሸነፍ /2/
አቤት ስምህ ...
',0),(NULL,'የት አለ','Samson1','በሐዋርያት በነብያት አምላክ የተጠራ
ቤቱን በአለቱ ላይ አፅንቶ የሰራ
በጉዞው ፈተና ቢጋረጥበትም
ከኢየሱስ ጋር ያለ በጭራሽ አይሞትም

ሞት የት አለ መውጊያው የት አለ
ሲኦል የት አለ መውጊያው የት አለ
እኔ አልሞትም ኢየሱስ እያለ /4/

ሰባት እጥፍ ነዶ የእቶኑ እሳት ቢግም
አምላክ ያልሆነውን አምላክ አላደርግም
አላፈገፍግም እጋፈጠዋለሁ
በእሳቱም መሃል ሆኜ አመልካለሁ
የእቶኑ እሳት ወላፈኑ ገዳይ
አቅም አጣ ምነው በኔ ጉዳይ
ማን ይተርፋል ጉድ የተባለለት
መች ገደለኝ መሃል ገብቼለት
ስላልኖርኩኝ በአማልክቱ ድንኳን
አልነካኝም ሰናፊሴን እንኳን
ደካከመ እሳቱም ደከመ
የሱስ መጣ አጠገቤ ቆመ
ሰባት እጥፍ ቢሆንም ያየለ
እኔ አልሞትም ኢየሱስ እያለ /3/
አንተ አትሞትም ኢየሱስ እያለ /2/

ቆመን ስንራመድ በእሳቱ መሃል
ታምር ነው ተባለ የነዚህስ ይለያል
የአማልክት አምላክ በሰማያት አለ
ሌላው ግን ቆሻሻ ጉድፍ ነው ተባለ

ከእቶኑ እሳት ነጥቆ የሚያድነን
የምናመልከው እኛስ አምላክ አለን
ምንም እንኳ ላይድነን ቢችል
እኛ አንሰግድም ለሰው ሰራሽ ምስል
እንዲህ ብለን ስናስጠነቅቀው
የሱስ ደግሞ ሃይሉን አሳወቀው
ደካከመ እሳቱም ደከመ
የሱስ መጣ ከጎናችን ቆመ
ሰባት እጥፍ ቢሆንም ያየለ
እኛ አንሞትም ኢየሱስ እያለ /4/
',0),(NULL,'የድል ነሺ ድምፅ','Samson1','የድል ነሺ ድምፅ የድል የድል ምስጋና
አደባባይ ላይ ይሰማ ከፍ ይበልና
ያለ የነበር የሚኖር በቅድስናው
ኢየሱስ ይክበር ከፍ ይበል ዛሬም ምስጋናው/2/ 2

ከፍ ይበል ምስጋናው
ከፍ ይበል እልልታው /4/

ሶስት አይበቃም አራትም ቢሆን ያንሳል
ካልደገምከው ጠላትህ ወድቆ ይነሳል
ለማሸነፍ ከፈለክ ጠላትህን
አታሳንስ አምልኮ ምስጋናህን

ሁለቴ ሶስቴ መተህ አትግታው
ፈራርሶ እስኪወድቅ ደጋግመህ ምታው
ድሉ የአንተ እስኪሆን ድረስ
ወደ ኋላ አትበል ስራውን ለመፍረስ

በምስጋና ድምፅ በአምልኮ
ይፈራርሳል ኢያሪኮ
በአምልኮ ጩኸት በምስጋና
ይፈርሳል ግንቡ ገና ገና /2/

ገና ገና የሱስ ሲመለክ
ገና ገና ሲከብር እሱ
ገና ገና በኢያሱ ላይ
ገና ገና ሲወርድ መንፈሱ
ገና ገና የኢያሪኮ ግንብ 
ገና ገና ብዙ ያመካው
ገና ገና ይፈራርሳል
ገና ገና ማንም ሳይነካው
ከፍ ይበል ...
ሸክምህ ከብዶ ወደ ታች የተጫነህ
መውጫ ያጣህ ከቀንበር በታች ሆነህ
ተስፋ ቆርጠህ የቀረህ ወደ ኋላ
ከማመስገን የሚሻል የለም መላ
አይቶ እንዳላየ ሆነህ አትለፍ
ከሚያመልኩት ጋር ናና ተሰለፍ
ማየት ከፈለክ ሸክምህ ተራግፎ
ማጉረምረም ትተህ ፅና በአምልኮ

በምስጋና ድምፅ በአምልኮ
ይፈራርሳል ኢያሪኮ
በአምልኮ ጩኸት በምስጋና
ይፈርሳል ግንቡ ገና ገና

ገና ገና የሱስ ሲመለክ
ገና ገና ሲከብር እሱ
ገና ገና በጊደኦን ላይ
ገና ገና ሲወርድ መንፈሱ
ገና ገና ትንሽ እንቦቻን
ገና ገና ብትሆንም እንኳን
ገና ገና ይፈራርሳል
ገና ገና የጣላት ድንኳን /2/
',0),(NULL,'የልጅነቴ','Samson1','ጅማሬ ፍጻሜም ለኔ ቅያሬ ምትክ የሌለህ
ከእናቴ ማህጸን ያወከኝ የልጅነቴ አምላክ ነህ
ምርጫዬ አንተ ነህ የሱስ ጉዞዬ መንገድክን ሳይለቅ
ካንተ ጋር የተጀመረው ጉዞዬ ካንተ ጋር ይለቅ

ለቁም ነገር የማልበቃ ትንሽ ህጻን ልጅ እያለሁ
ስሜን ጠርተህ ስትፈልገኝ ውብ ድምጽህን ሰምቻለሁ
በከፍታም በዝቅታም ታላቅ ሥራህ ድንቅ እያለሁ
እጄን ይዘህ ስትመራኝ በቤትህ ውስጥ አድጌአለሁ

ነፍሴ በጸጋህ ረክታ የህይወት ውሃን ጠጥቼ
ልቤ በቃልህ ጸንቷል ከእጅህ መናን በልቼ
ዛሬ የአለምን ክብር ብሩን ወርቁን አይቼ
የሱስ የነፍሴን ጌታ አንተን አልሄድም ትቼ

ወድቀህ ስገድ እያለ ጠላት ቢጎተጉተኝ
የዚህ የጠፊ አለም ክብር ቢያስመለክተኝ
ፍጹም ወድቄ አልሰግድም ከአንተ በቀር ለሌላ
ነገ ሁሉም ጠፊ ነው የዚህ የምድር ተድላ

አልፈልግም ካንተ ሌላ በቅተኸኛል አንተ ለኔ
ሌላ ማምለክ አልመኝም በህይወት ሳለሁ በዘመኔ
ያንተ እንድሆን ከመረጥከኝ ከማህጸን ሳልወለድ
ሌላው ለኔ አይጠቅመኝም ይሻለኛል ያንተ መንገድ

ካንተ ምን አጣሁ እና ምንስ ጎደለኝ ብዬ
ለምን ከፊትህ ልራቅ ደስታ ሰላሜን ጥዬ
በአለም ያለውም ክብር ማዕረግ ይቅርብኝ እኔ
የሱስ በቤትህ ይለቅ ቀሪው የምድር ዘመኔ
ወድቀህ ....

',0),(NULL,'አምጡልኝ','Samson1','ክፉው ቢቃወመኝ ቢወረውር ጦሩን
መደርደር አልተውም እኔስ በገናውን
ፍላጻውን ስሎ ጠላት ቢቃወመኝ
የሱስን ከማምለክ ፍጹም አያስቆመኝ /2/

አምጡልኝ በገናዬን ላምልከው መድሃኒቴን /2/
አምጡልኝ መሰንቆዬን ላምልከው መድሃኒቴን /2/
አምጡልኝ እንቢልታውን ልዘምር ውለታውን /2/

ምስጋናው እልልታው ዝማሬው ይቅለጥ
የእግዚአብሔር ክብር በጽዮን ይገለጥ
ማደሪያው ይሞላ በክብሩ ደመና
የሱስ በአምልኮ ደስ ይለዋልና /2/

በምስጋናው ቃል ተደንቆ
ይውረድ ሰማይን ሰንጥቆ
ኢየሱስ ይክበር በእውነት
ይፈር ይጎስቅል ጠላት /2/

እርር /3/ ጠላት እርር ይበል የሱስ ግን ከፍ ይበል
ቅጥል /3/ ጠላት ቅጥል ይበል የሱስ ግን ከፍ ይበል
እፍር /3/ ጠላት እፍር ይበል የሱስ ግን ከፍ ይበል

ከውሃ ከመንፈስ ዳግም መፈጠሬ
ሰይጣንን ላሳፍር ነው በምድር መኖሬ
ዲያብሎስ በትእቢት በተወው ከፍታ
የሱስን ለማምለክ ሆኜ በሱ ቦታ /2/

በቅዱስ ስፍራ በሰማይ
ቆሜ በክብር ቦታ ላይ
ጠላት እያየ እየሰማ
አመልክዋለሁ በዜማ /2/
አምጡልኝ ....

በጠላት ቢከበብ ዙሪያው ቢታጠርም
ሰልፉን ተመልክቼ ቃሌን አልቀይርም
ድብቁን መሳርያ ጦሬን እመዛለሁ
በገናን አንስቼ መዝሙር እዘምራለሁ
ጠላቴ እያየኝ አይኖቹን አፍጥጦ
ምን ሊያደርግ ነው ሲል አንገቱን አንጋጦ
የሱስ አምልኬ አቃጥለዋለሁ
ሳይራራልኝ ለምን እራራለታለሁ

ድል ድሮ ቀረ አልልም
ክብሬን ማእረጌን አልጥልም
አልረሳም ጋሻ ጦሬን
አልተውም መዝሙሬን /2/
እርር ....
አምጥሉኝ ....

',0),(NULL,'ሥጋ ለባሽ','Samson1','ሥጋ ለባሽ እንደ ሸንበቆ ነው
አትደገፍ አትታመነው
ድንገት ተሰብሮ ያቆስልሃል
ሰው ሰውን ሊያድን መች ይችላል /2/

እንደ ኢምንት ነው ችሎታው
የዛሬው ብርቱ ሰው ነገ የለም በቦታው
አለ ሲባል አይኖርም
አሁን ታይቶ ይጠፋል ክንዱ ድጋፍ አይሆንም

በኢየሱስ መታመን
አስተማማኝ ድጋፍ ነው ለሰው በህይወቱ ዘመን
ከቶ አይዝልም ብርታቱ
ደካማውን ያደርጋል በኃይለኛው ላይ ብርቱ

የእርሱ ጉልበት የእርሱ ጽናት
አልደከመም በዘመናት
ዛሬም ሃያል እንደ ጥንቱ
ኢየሱስ ነው ክንደ ብርቱ /2/
ስጋ ለባሽ ....

ለሰው መታመኛው ጉልበቱ
ለክፉ ቀን ሸሽጎ ያስቀመጠው ውድ ሃብቱ
ሊመጣበት ካለው ከቁጣ
ሊታደገው አይችልም አይሆነውም ማምለጫ

የተቀጠቀጠን ሸንበቆ
አይሰብርም ኢየሱስ ይይዛል ተጠንቅቆ
አያጠፋም የሚጤስን ጧፍ
ህይወትን ይቀጥላል አንስቶ ከሞት ደጃፍ

የሟቹን ሞት አይፈልግም
አንዳች ክፉን አያደርግም
በህይወት ኑሩ ይላል እንጂ
አስመልጦ ከሞት ደጂ /2/
',0),(NULL,'ከሰማይ','Samson1','ከሰማይ የሆነ ቸል የማያስብል
ዝገት ማያጠፋው የማይበላው ብል
እጅግ ተጠንቅቄ ልይዘው የሚገባ
መዳን አለኝ እኔ ሰማይ የሚያስገባ /2/

ለኔ ያለኝን የተሰጠኝን
ከላይ ከሰማይ የሆነልኝን
በምድር ካለው ጋር ሳነጻፅረው
ለካስ መዳኔ እጅግ ድንቅ ነው /2/
እጅግ እጅግ ድንቅ ነው
እጅግ በጣም ድንቅ ነው /2/ 2
ብጣእሚ ብጣእሚ እዩ ግርም /2/

አንቱ ተብሎ በሰው ተደንቆ
በምድር ላይ መኖር ከብሮና ታውቆ
ዘላቂ አይደለም ነገ ይሻራል
በሞት ይዋጣል ሁሉም ይቀራል /2/
ቀጣይ የሆነ ከሞት ባሻገር
ዘላለማዊ የሆነው ነገር
የሱስ የሰጠኝ የነፍሴ መዳን
በአለም ካለው እጅግ ይበልጣል
እጅግ እጅግ ይበልጣል
እጅግ በጣም ይበልጣል /2/
ብጣእሚ ይበልጽ እዩ /4/
ለኔ ....
በእውቀት ብዛት በስልጣኔ
ከፍርድ አይዳን ከሞት ኩነኔ
ነገር ግን ጥበብ ጥበብ በዚህ አለ
የቆመበትን ሰው ካስተዋለ /2/
በዳግም ልደት ከውሃ ከመንፈስ
በእምነት የሚገኝ የህይወት መታደስ
የልጅነት መበት ከላይ የመጣ
ከገሃነም ፍርደ ነፃ የሚያወጣ
ነፃ ነፃ የሚያወጣ /3/ 2
   ሓራ ሓራ ዘውጽእ /3/ 2
',0),(NULL,'ልደሰት','Samson1','ልደሰት በኢየሱስ ልደሰት
ልደሰት በአምላኬ ልደሰት /2/
በመብል በመጠጥ በልብስ
በሚታይ ወይ በሚዳሰስ
አይደለም ፍጹም የኔ ደስታ
የሱስ ነው የሰላሜ ጌታ /2/

የምድር ባለጠጎች ሃብትን አከማችተው
በብርና በወርቅ ቤታቸውን ሞልተው
ኑሮ ተደላድሎ ምንም ሳይጎድላቸው
እውነተኛ ሰላም ደስታ ግን የላቸው /2/

እኔ ግን በሰው የተናኩት
በኢየሱስ ግን/ዘንድ የተወደድኩት
በምስኪን በድሃ ጎጆዬ
ደስታና ሰላም ነው ኑሮዬ /2/

በአለም የሚገኘው ሰላም እና ደስታ
ፈጥኖ የሚጠፋ ነው ጠዋት ታይቶ ማታ
በምክንያት ይመጣል በምክንያት ይሄዳል
ሁኔታው ሲለወጥ ሁሉም ይወሰዳል /2/

የሱስ ግን የሚሰጠው ሰላም
ፅኑ ነው መሰረቱ አይላላም
እንደ ወንዝ እንደ ጎርፍ ይፈሳል
በምክንያት መች ይደፈርሳል /2/
በመብል ....

በለሱ ባያብብ ወይኑም ባያፈራ
ዘይቱም ቢጎድል የወይራው ስራ
በጎችም ከበረት ከጋጣ ቢጠፋ
ኑሮ ባይሳካ ቢጓደልም ትርፉ /2/

እኔ ግን በአምላኬ በርትቼ
ኖራለሁ ዘወትር ተደስቼ
ጊዜ አለው ለሁሉም ሰአት
ጎደሎው የሚሞላበት /2/
',0),(NULL,'እርሱ አይረሳም','Sara1','ዛሬም ነገም እንደ ጌታ/ኢየሱስ/ የለም/2*
የለም አሀሀ እንደ ጌታ/ኢየሱስ/አምላኬ/ የለም
የለም ኦሆ እንደ ኢየሱስ የለም

የተጣለውን አይረሳም/2* እርሱ አይረሳም
የወደቀውን አይረሳም/2* ጌታ አይረሳም
የተጣለውን አይረሳም/2* እርሱ አይረሳም
የተተወውን አይረሳም ጌታ አይረሳም

ይልቁን ከጎኑ ይቆምና
ጠላቶቹን ይረጋግጥና
በከፍታ ያረማምደዋል
ከእስር ፈትቶ ንጉስ ያደርገዋል
የሚያቅተው ነገር የለም ኦሆ…
የለም አሃ ከቶ ለጌታ የለም
የማይከናወን የለም ኦሆ…
የለም አሃ ከቶ ለኢየሱስ የለም

ባህሩን ይከፍለዋል
ተራራ ሜዳ ያደርጋል
ለሰዎች ከባዱን ነገር
ያስውባል ያስይዘዋል መስመር

ለችግረኛው ይደርሳል/2*እርሱ ይደርሳል
በመከራውም ይደርሳል/2* ጌታ ይደርሳል
በጭንቅ ሰዓት ይደርሳል/2* እርሱ ይደርሳል
በሐዘንም ላይ ይደርሳል/2* ጌታ ይደርሳል
ለአመታት ጥያቄ የሆነውን
ከሰው ተራ የሚያስገልለውን
ደዌ ሆነ ወይም እርዛት
ያስወግዳል ከታመኑበት

የሚያቅተው ነገር የለም ኦሆ…
የለም አሃ ከቶ ለጌታ የለም
የማይከናወን የለም ኦሆ…
የለም አሃ ከቶ ለኢየሱስ የለም
ባህሩን ይከፍለዋል/2*
ተራራን ሜዳ ያደርጋል/2*
ለሰዎች ከባዱን ነገር/2*
ያስውባል ያስይዟል መስመር/2*
ዛሬም ነገም..
',0),(NULL,'ሁሉን ማሰማመር ትችላለህ','Sara1','አንተ የፈጠርከው ፍጥረት ሁሉ
አቤት ውበቱ ማማሩ
ተራራ ኮረብታው ጋራ ሸንተረሩ
ሕይወት የሰጠኸው እስትንፋስ ያለው ሁሉ
በዚህ ሁሉ ኢየሱስ ክብርህ ይገለጣል
ሁሉን በየመልኩ ውብ አድርገህ ሰርተሃል

ማን ይከለክልሃል የእኔ ጌታ
ማንስ ተው ይልሃል የእኔ ንጉስ
ሁሉን ማሰማመር ትችላለህ
ውብና/በጊዜው/ ድንቅ አርገህ ትሰራለህ/2*

ሁሉን በአላማ ሰርተሃል
የሱሴ ለክብርህ ፈጥረሃል
ከፍጥረት ጀምሮ ግልጽ ሆኖ ይታያል
የአንተ ስም ሊጠራ ልትከብር ይገባሃል
እስትንፋስ ያለው ሁሉ ለክብርህ ተፈጥሮአል
በሰማይ በምድርም ዝናህ ይገለጣል
ባህርን በመዝጊያ የዘጋኸው
አጥቢያ ኮከቦችን የፈጠርከው
በልዑል ነፋስ ውስጥ ኢየሱስ ትገለጣለህ
ሁሉን ታደርግ ዘንድ አቤት አንተ ቻይ ነህ
ሐሳብህን ኢየሱስ ማን ይከለክላል
ሁሉን እንደ ፈቃድህ አንተን ያመልክሃል

ተስፋ የቆረጡ አሣ አጥማጆችን
መረባቸው ማጠብ የጀመሩትን
አንተ ግን ተናግረህ አዎ ታደርጋለህ
ብዙ በረከትን ታትረፈርፋለህ
እርዱኝ ጓደኞቼ ብለው እስኪጠይቁ
ሞላኸው መረቡን አስጥለው ወደ ጥልቁ
',0),(NULL,'ትውስ ሲለኝ','Sara1','ትውስሲለኝያንተውለታ
እነዚህንቃላትልደረድር
አጥግቦኝአርክቶኝሳይሆንጌታ
ይሻላልብዬነውከዝምታ /5/

እሹሩሩእያልክእኔንእያባበልክ
ስደክምስሰለችአቅፈህ እየመከርክ
ወደድንኳንድካምሚስጥረኛ ሆነህ
     እስከዛሬድረስእጄንይዘህ መራህ /2/

አንተመሃሪናትሁትሆነህሳለህ
ይገባህነበርወይእንዲህአይነትስቅለት
እኔደካማዋስጠፋታይቼ
ማንምየማይሆነውንሆንክልኝጌታዬ /2/

ዲያብሎስሲጥለውከአፌየዘጋውን
አክብረኝአንግሰኝክብርየተሰጠውን
የሚያከብረውየለምብሎአስቦይሆን
የተደረገልኝዛሬእኔአለሁኝ /
እኔበዘመኔተነስቼአለሁኝ /2/

ካደረክልኝጋርየሚመጣጠንባጣ
ሊገልጽህሚችልቃልከምድርቢጠፋ
ምንምባያረኩምባሉትተጠቅሜ
ምስጋናንአወራለሁኝበዘመኔሁሌ/
እኔአመልክህአለሁመሰዊያላይሆኜ /2/

',0),(NULL,'ነፍሴ አረፈች','Sara1','ነፍሴ አረፈች በኢየሱሴ ነፍሴ አረፈች
ነፍሴ አረፈች በመድሃኒቴ ነፍሴ አረፈች
የዓለምን መድኃኒት የሕይወትን ቤዛ
የሁሉን ባለቤት ኢየሱስን ይዛ ነፍሴ አረፈች /2/

ኑሮዬ ነበረ የጉስቁልና
ዘመኔን በሙሉ ደጅ ላይ ስጠና
ተመለከተና ከላይ ከአርያም
በእቅፉ ሲያኖረኝ ሆነ ሁሉ ሰላም
ሆነ ሁሉ ሰላም የሞተው ሲነሳ
ሆነ ሁሉ ሰላም በቤቴ ሲገባ
ሆነ ሁሉ ሰላም እንባዬን ሲያብሰው
ሆነ ሁሉ ሰላም ማሳረፍ የሚያውቀው /2/

ከዘላለም ጥፋት ነፍሴን ታደገና
ከጨካኙ አውሬ አላቀቀኝና
ብርሃን ውስጥ ሆኜ ብርሃንን እያየሁ
በተድላ በእፎይታ መኖር ጀምሬአለሁ
ነፍሴ አረፈች በኢየሱስ
ነፍሴ አረፈች በመድሃኒቴ

ዳግም ከማይጠማው ውሃ ስትጠጣ
ውስጧ ሲረሰርስ ሲታወቅ ታሪኳ
ከሰው የተሰወረች በድብቅ የኖረች
ኢየሱስ ሲጠጋት አደባባይ ወጣች
ማሳረፍ ሲያውቅበት ማሳረፍ/2*
ኢየሱስ እፎይ ማሰኘት
ማሸነፍ ሲያውቅበት ማሸነፍ/2*
ኢየሱስ ለእኛ ያቃተንን
',0),(NULL,'ሥራህ ግሩምና ድንቅ ነው','Sara1','አንተ ከገባህ ወዲህ ከቤቴ ጣራ ሥር/2*
ሰላምና ዕረፍት ሆነልኝ በረከት/2*
አቤት እንዳንተ ያለ የለም አቤት/2*

ሥራህ ግሩምና ድንቅ ነው 
እንዴት ብዬ ልተርከው
ሥራህ ግሩምና ድንቅ ነው 
እንዴት ብዬ ልዘርዝረው /2/

ልጄና እኔ ብቻ በልተነው የምንሞተው
ትንሽ እልፍኝ ዱቄት ነበር በቤት ያለው
በአንተ ተጎብኝቼ ተባርኬ እኮ ነው
ጎዶሎዬ ሞልቶ በሕይወት የምኖረው

አቤት እንዳንተ…

አልጋ ላይ ተኝቼ በሕመም ስማቅቅ
ወደ መቅደስ መሄድ ዘወትር ስናፍቅ
አንተ አየኸኝና ፈውስ ሆንከኝ ለሕመሜ
የተሸከመኝን ሄድኩኝ ተሸክሜ

አቤት እንዳንተ …

ሐዘን ጭንቅ መከራ ከፊቴ ራቀና
ያ! ባዶነቴ ጉድለቴ ቀረና
በትንሿ ልቤ አንተ ስትገባ
ተትረፈረፈልኝ ሰላም እንደ ዋዛ /2/

አቤት እንዳንተ…
አንተ ከገባህ…
',0),(NULL,'ዛሬ አርፌአለሁ','Sara1','ዛሬ አርፌአለሁ ኢየሱስ እፎይ ብያለሁ/2*
ተከናወነልኝ ሁሉ ተራግፎ አየሁት
ሸክሜ በአንተ አርፌአለሁ /2/

ያቃተኝ ተራራ ሲናድ/2*
የከበደኝ ሲወርድ ከላዬ/2*
ሁሉ ሲሆን በመንፈስህ ኃይል/2*
ድል ብቻ ሆነ በኑሮዬ ላይ/2 4*

መንፈስህን እፍ ስትለው/2*
ሲመጣ ከነ መዓዛው/2*
ለእኔማ ሆነልኝ ድፍረት/2*
ጌታዬ ስላለህበት/2 4*

የልቤን እንድነግርህ በሚስጥር/2*
ሰጠኸኝ የሰማይን ልሳን/2*
በሕይወቴ ደስታን አፈሰስክ/2*
አምላኬ ዛሬም ተባረክ/2 4*
',0),(NULL,'ማነው ዛሬ ድል ድል የሚሸተው','Sara1','ማነው ዛሬ ድል ድል የሚሸተው
ማሸነፍ/2* መሮጥ የሚያሰኘው/2* /2/

በእስራኤል ሰፈር ሰው አልተወለደምእያለ ሲፎክር
የራሱን ጉብዝና ችሎታ እውቀቱን ለመግለጽ ቢሞክር
የማንም ልብ አይውደቅ እኔ አለሁለት
የሚል ደግሞ አለ ትንሹ ዳዊት

ብትሽሞነሞንም ኤልዛቤል ብትዋብ ምንም ብትጣጣር
እርሷን ተመልክቶ በውበቷ ተስቦ ተማርኮ እንዲቀር
ቆራጥና ጨካኝ የማይስት አላማውን
እዩ ተቀብቷል ሚፈጠፍጥ ከላይ

የጥልቁን መክፈቻ ታላቁን ሰንሰለት በእጁ የያዘው
ከሰማይ ይመጣል ለአንድ ሺ አመት ሊያስር ሰይጣንን
የቀድሞውን እባብ ደግሞም ዲያቢሎስን
ወደ ጥልቅ ይጥላል አስጨናቂውን

ምንም ቢሳቅበት አንተ ይህን ልትሰራ ቢባል ቢሾፍበት
እኔ እያለሁኝ የእስራኤል ቅጥሮች አይፈርስም በእውነት
እንደ ነህምያ ቆራጥ ለአምላኩ ቤት
ማነው በዚህ ዘመን የሚሮጥ ወደፊት?

ይነሳና ይጥራ የአምላኩን ስም
እኔ አለሁኝ ይበል በፈረሰው ቅጥር/2* /4/
',0),(NULL,'ለሌላ እንዳይሆን','Sara1','አምልኮ እልልታ ይከልከል መዝሙር
ለሌላእንዳይሆንካንተበስተቀር
በሠራኸው ሰው ላይ በፈጠርከው ምድር
ኢየሱስ ከአንተ ሌላ ማንም እንዳይከብር/2*

ኤልያስ በቅናት እሳት ይውረድ ያለው
ከአንተሌላ ማንም እንዳይመለክ ነው
ክብርን እንዳይወስድ ክብር የማይገባው
የቀባኸው ባሪያ ወደ አንተ የጮኸው /2/

በመሰዊያው ክብርህ ይገለጥ ስምህ
የተቀደሰ ነው ኢየሱስ በደምህ
ሰውን በአምሳያ በደምህ የፈጠርከው
በከንቱ አይደለም አንተ ልትከብር ነው /2/

የለም ከአንተ በቀር አምባና መጠጊያ
ለዓለም የሞተ የሆነ መመኪያ
የፈጠርክም አንተ የዋጀህ በደምህ
ምስጋናና ስግደት ክብር የሚገባህ /2/

ሁሉ ለአንተ ኢየሱስ ሁሉ ለአንተ ይሁን
ማንም እንዳይመለክ ማንም ጌታ እንዳይሆን
አንተ ብቻ ክበር ውዳሴ ምስጋና
አሜን ይገባሃል ፈጣሪ ነህና /2/
',0),(NULL,'እወራረዳለሁ','Sara1','በጠላት ፊት ለፊት በድንበሩ ቆሜ
እወራረዳለሁ ስለ አንዱ ጌታዬ /2/
ምስጋና ነው ይኸው ይኸው አለኝ
ዝማሬ ነው ይኸው ይኸው አለኝ
አምልኮ ነው ይኸው ይኸው አለኝ
ለጠላቴ ወንጭፍ የሚሆነው /2/

ኃይሉ ላይ ሾሞኛል ከእግሬ ሥር ልረግጠው
ቆይቷል ፈርዖን ውሃ ካሰመጠው
እንደ ቀድሞ መስሎት ኋላ ኋላ ሲሮጥ
አልሰማም መሰለኝ የእኔን መለወጥ
እንደ ተሾምኩበት

እንዲህ የሚወራው ለማን ነው በስፋት?
አምላኬ እያለ ለምን ስለ ጎልያድ
አንገቱን ቆርጬ ታሪክ አጠፋና
በእስራኤል ሰፈር ይሆናል ምስጋና
ይሆናል እልልታ

ጋሻና ጥሩር እኮ ለምኔ ነው
አጋዥ ነገሮችን የምደራርበው?
እኔ ከጠላት ጋር ምገጥመው ፊት ለፊት
ትበቃው የለም ወይ ወንጭፏ ለውድቀት/2*
',0),(NULL,'አትለፈኝ','Sara1','አትለፈኝ አምላኬ
አትለፈኝ ጌታዬ
አንተ ኤልሻዳይ ጌታ ነህ
ምህረትህ አይለየኝ
ምህረትህ የማይለየኝ

እንድቆይ እርዳኝ ከእግርህ ሥር
እንድመለከት መስቀልህን
በነዳፊ እባብ መዳኔ እንዳይጠፋ
ጸንቼ ልቁም እስክትመጣ /2/

በቤትህ ላሉት ምህረት ስትሰጥ
በፍቅርህ ሲያድጉ ወደ ሙላት
በዚህ ውስጥ እኔም ልቀደስ ልለወጥ
አትፈርብኝ ስትመጣ ለፍርድ /2/

ኢየሱስ ስታልፍ በመንደሬ
አትለፈኝ መድኃኒቴ
ይቀየርና የአይኔ መታወር
በመቅደስህ ቆሜ ሥራህን ልናገር  /2/

እያልኩኝ ስጮህ ወደ አምላኬ
ልመናዬን ሰምቶ ጌታዬ
አላለፈኝም መሃሪ ነውና
አይኖቼ አዩ ተከፈቱና  /4/

',0),(NULL,'እንዳንተ ያለ የለም','Sara1','እንዳንተ ያለ የለም እንዳንተ/4
ከእጅህ በልቼ ጠግቤአለሁ
መንፈስህን ጠጥቼ ረክቻለሁ
ተደግፌብህ አላፈርኩም
እንዳንተ ያለ አላየሁም /2/

መማጸኛ አትፈልግ እጅ መንሻ
ከእንግዲህ አትልም መጨረሻ
ሰልችተኸኝ አታውቅ ወይ ጠልተኸኝ
በእቅፍህ አለሁኝ ሰው አርገኸኝ /2/

በአንተ መከራና ግርፋትህ
በራስህ ላይ ፈርደህ ሞቴን ሞተህ
ሳትሸነግለኝ ሳትዋሸኝ
ፍርዱን አቀናኸው ፈረድክልኝ /2/

ለኃጥያቴ ሽቶ በማፍሰሴ
እዛም አላበቃም መከሰሴ
ዳግም በኃጥያቴ እንዳያገኘኝ
ሰጥኸኝ አምላኬ የጸጋ ቃልን /2/

ለምስኪን ሚራራው ደጉ እጅህ
ለእኔም ተዘረጋ በምህረትህ
ከምንጩ ጠጥቼ ረካሁና
ተነሳው ምስጋናህ ላወራ /2/
',0),(NULL,'በበርህ ላይ ቆሞ','Sara1','በበርህ ላይ ቆሞ የሚያንኳኳው
ኢየሱስ ነው/2*
ልጄ ሆይ እባክህ ልግባ የሚለው
ኢየሱስ ነው/2* 2

የክብር ንጉስ ነው የይሁዳ አንበሳ
የበረከት አባት ችግርን የሚያነሳ
ኢየሱስ ከገባ ወደ ልብህ ጓዳ
እንዳንተ አይኖርም የሚኖር በደስታ /2/

ከሰው ሁሉ መርጦ ወደ አንተ ቤት መጥቷል
ከድካምህ ሁሉ ሊያግዝህ ተነስቷል
ሰላምና እረፍት ይሆንልሃል
የተዘጋብህን ይከፍትልሃል /2/

በባህሩ ላይ ተራመድ የሚለው
ማዕበል ወጀቡን ጸጥ የሚያደርገው
ያ! የጥንቱ አምላክ ሁሉን የሚችለው
እሱ ነው ሊገባ በሩን የሚያንኳኳው /2/
',0),(NULL,'ጽዮን ሳትሞላ ምን ዕረፍት አለ','Sara1','ምን ዕረፍት አለ ነፍሳት ሳይድኑ
ምን ዕረፍት አለ ጽዮን ሳትሞላ
ምን ዕረፍት አለ በአምላካችን መንግስት
ምን እረፍት አለ ሳናይ ምስጋና

ብቻውን ያለውን ኢየሱስን ሳያውቁ
ለዓለም የሞተውን ጌታ እየናቁ
ስንቶቹ በሞት በቅስፈት አለቁ
ታድያ ምን እረፍት አለ ይህንን እያዩ
ምን እረፍት አለ…

ወደ ኢየሱስ መንግስት ሕዝቡ እንዳይገባ
ክፉ መንፈስ ይዞ ወደ ራሱ ሊያስገባ
እየታገለ ነው አጥፍቶ ሊጠፋ
ሕዝቡን እናስለቅቅ ከሰይጣን መንጋጋ
ማየት አለብን ኢየሱስ በዓለም ከብሮ
ማየት አለብን ዝናው ተሰምቶ /2/

ፍቅሩን አሳይቶ ራሱን ከሰዋልን
መንፈሱን ጠጥተን ልጆች ከተባልን
የምን ቸልታ ነው አምላክ አለን ብለን
የጌታችንን ስም ማስጠራት አለብን
ምን እረፍት አለ…

በጽዮን አደባባይ እለት እለት ምስጋና
ዘፈን መዝሙር ሆኖ ቀርቦ ባማረ ቃና
የሲኦል በር ተዘግቶ ገነትም ተከፍቶ
ዲያቢሎስ ተቃጥሎ ፍጥረት ሁሉ ድኖ
ማየት አለብን .....
',0),(NULL,'ያይሃል','Sara1','ያላየህ ቢመስልም በዚያ በችግርህ
ያላየህ ቢመስልም በዚያ በመከራህ /2/
ያይሃል ኢየሱስ ያይሃል
ያይሃል በፍቅር ያይሃል
ያይሃል በእውነት ያይሃል
ከተረሳህበት ደርሶ ያነሳሃል /2/

ኢዮብን እንየው ያንን ብርቱ ሰው
ሀብትና ንብረቱን ልጆቹን ያጣው
ሚስቱ በስንፍና ሰድበህ ሙት አለችው
እርሱ ያውቅ ነበር አምላኩ እንደሚያየው /2/

ዝም ሲል ኢየሱስ ረስቶህ አይደለም
እሩህሩህ አባት ነው እርሱ አይጨክንም
ግን እርሱ ይወዳል በባዶ መስራት
አርፍዶ ተነስቶ ቀድሞ መገኘት /2/

በሐዘን በመከራህ ሁሉ በመስቀልህ
በቤቱ ታግሰህ በእምነት ከቆየህ
ሳታስበው ድንገት ፈጥኖ ይደርስና
ያሸህን ፈተና ያደርገዋል መና /2/

አንተ በታገስከው ዝግ ባልከው መጠን
የአምላክህ ጸጋ ይወርዳል በላይህ
የመከራ እርንቋ እዛው ይቀርና
ወለል ብሎ ይወጣል የአምላክህ ሥራ
',0),(NULL,'ያዕቆብ ሆይ','Sol1','ያዕቆብ ሆይ ድንኳኖችህ
እስራኤል ሆይ ማደሪያዎችህ
ምነኛ ያምራሉ /2/
በኃያሉ አምላክ ግርማ ያስፈራሉ

የንጉሱ መቅደስ በመካከልህ ነው
እንዳንተ ያከበረው የመረጠው ማነው
ማነው?

እንደ ሸሎቆዎች ውኃ እንደሞላቸው
በወንዝ ዳር እንዳሉ አትክልቶች
እግዚአብሔር እንደተከለው እሬት
በውሃ ዳር እንዳሉ ዝግባዎች

ከማደጋዎችህ ውኃ እጅግ ይፈሳል
ከነገስታት ይልቅ ንጉስህ ይከብራል
እግዚአብሔር ከግብጽ አውጥቶሃል
ሃይልና ብርታትህ እሱ ሆኖልሃል

እንደ ብርቱ አንበሳ አርፈህ ተኝተሃል
እንደ እንስቲቱ አንበሳም ሆነሃል
የሚመርቅህም የተመረቀ ነው
የሚረግምህ ሁሉ የተረገመ ነው

',0),(NULL,'ሐገሬ ሰማይ ነው','Sol1','ሐገሬ ሰማይ ነው እዚያም እሄዳለሁ
ጌታዬን አምላኬን ፊት ለፊት አያለሁ
አሁን በድንግዝግዝ ጭላንጭል አያለሁ
ያኔ ግን ጌታዬን ፊት ለፊት አያለሁ /2/

በቅድስቲቱ ሀገር በኢየሩሳሌም
በጉ ብርሃን ሆኖ ልኖር ለዘላለም
ከሰማይ የመጣ የጸና ቃል አለኝ
ሁሉን አዲስ አርጎ በሰላም ሊያኖረኝ

በዚያ ሐዘን የለም ሁልጊዜ ደስታ
ጩኸት ወይም ስቃይ የላቸውም ቦታ
በሰላም በፍቅር ጸንቼ እኖራለሁ
ፊት ለፊት አምላኬን ባይኖቼ አየዋለሁ

ጸሐይ ወይ ጨረቃ አያበሩላትም
አማልክት ጣኦታት አይጠሩባትም
አንድ አምላክ ኢየሱስ ከብሮ ለዘላለም
ብርሃን ይሆናል ለዚያች ለውብ ዓለም
',0),(NULL,'አንተን ከተከተልኩ','Sol1','አንተን ከተከተልኩ ሁሉን ነገር ጥዬ
ክብሬን ዝቅ አርጌ ለክብርህ ጌታዬ
አምላኬ ጌታዬ ብዬ ካነገስኩህ
ባርከኝ የኔ ኢየሱስ ክብርህንም ገልጠህ

በፊትህ ሞገስ ያግኝልኝ ልመናዬ /4/

ለሞት እንዳልተኛ አይኖቼን አብራልኝ
በቀንም በሌሊት ከፊትህ አትጣኝ
በፈቃድህ መንገድ እግሮቼን አጽናልኝ
የመድኃኒቴ አምላክ ስምህ ይክበርልኝ

አምላኬ አምላኬ ፊትህን አብራልኝ
ቸርነትህን ልይ በቀኝህ አኑረኝ
በሕይወቴ ዘመን ደስ እንዳሰኝህ
ቅንነት ይክበበኝ በዝቶ ቸርነትህ

ጌታ ዝም አትበለኝ እጄን አንስቻለሁ
በቅዱስ መቅደስህ በፊትህ ቆሜአለሁ
ወዳንተ እጮሃለሁ እለምንሃለሁ
ተስፋዬ ነህና ምህረትን እሻለሁ

',0),(NULL,'በዛን ለመለምን','Sol1','በዛን ለመለምን ምድሪቱን ሞላናት
በየተራሮቿ ከፍታ ቆምንባት
ከሰማይ የሆነ መና እየተመገብን
በጌታ በኢየሱስ ህያው ቃል በረታን

እንደ ጠላታችን ቢሆንማ ኖሮ
በጠፋን ነበረ በሌለን ዘንድሮ
ኃይላችን ከሰማይ /2/ ጽኑ አምባ ነውና /2/
በድል አሻገረን /2/ ዛሬም እንደገና /4/

ሞቱ ስንባል ህያው አደረገን
ጠፉ ስንባል እጅጉን አበዛን
ተበተኑ ሲባል ኢየሱስ ሰበሰበን
የምስጋናን ነዶ ተሸክመን መጣን

በክብር በኃይል በሞገስ በረታን
በመንፈስ ቅዱስም ጸጋ እየተዋብን
ጠላት በፊታችን መቆም ተስኖታል
ከሰማይ የመጣው ኢየሱስ በትኖታል

በምስጋና ዜማ በእልልታ ታጅበን
ለኃያሉ ንጉስ ክብር እንሰጣለን
ገና በዓለም ዙሪያ በኃይል እንቆማለን
ከሰማይ የሆነ ኢየሱስን ይዘን
',0),(NULL,'ነፍሴ ታመስግንህ','Sol1','ነፍሴ ታመስግንህ ጌታዬ
ሌላማ ምን አለኝ በሕይወቴ
የዘላለም ሕይወት ለሰጠኸኝ
ኢየሱስ በዘመኔ ላንተ ቅኔ ልቀኝ /2/

ምን አለኝ ምን ልበል ምን ይከፈልሃል?
ሃሌሉያ ብቻ እጅግ ያንስብሃል
የልመናዬን ቃል ሰምተኸኛልና
ላቅርብልህ ኢየሱስ ከልቤ ምስጋና /2/

በመቅደስህ ዙሪያ ልመላለስበት
ቀና ብዬ ልጓዝ ልኑር በበረከት
አምልኮ ውዳሴ ዝማሬ ላሰማህ
በቤትህ መኖሬ ላንተ ደስ እንዲልህ /2/

አንተ ብርሃኔና መድኃኒቴ ነህ
ብርታቴ ምሽጌ መታመኛዬ ነህ
ላቅርብልህ ከልቤ ልሰዋ ምስጋና
ቃልህ በህይወቴ ድንቅ አድርጓልና /2/
',0),(NULL,'አንተ አምላኬ ነህ','Sol1','አንተ አምላኬ ነህ የኔ ጌታ
አንተ አምላኬ ነህ የኔ ንጉስ /2/
በሰማይ በምድር ቅዱስ ቅዱስ /4/

ሃሌሉያ እላለሁ በመቅደስህ ቆሜ /2/
ሌላማ ምን አለኝ? ይኸው ነው አቅሜ /2/
ሃሌሉያ በዙፋኑ ላይ ለተቀመጠው
ለጌታ ኢየሱስ ክብርን እንስጠው /2/

ሃሌሉያ እላለሁ በመቅደስህ ቆሜ
ላምላኬ ለኢየሱስ ለዘላዓለሜ
ክብርና ምስጋና ላንተ አቀርባለሁ
በእውነት በመንፈስ እባርክሃለሁ

ድምጼን አሰማለሁ በውዳሴ ዜማ
በኢየሩሳሌም በአምላኬ ከተማ
ያንደበቴን ፍሬ እሰዋልሃለሁ
ጌታዬ አምላኬ ከፍ አደርግሃለሁ

ሃሌሉያ በዙፋኑ ላይ ለተቀመጠው
ለጌታ ኢየሱስ ክብርን እንስጠው /.../
',0),(NULL,'የልመናዬን ድምጽ ሰምተህኛልና','Sol1','የልመናዬን ድምጽ ሰምተህኛልና
ላመስግንህ ኢየሱስ ዛሬም እንደገና /2/
ዛሬም እንደገና /4/

አቤቱ ጸሎቴን ሰማሀኝ
ጩኸቴም ወደ መቅደስህ ደረሰ
ጆሮህን ወደኔ አዘነበልክልኝ
በጠራሁህ ቀን ፈጥነህም ሰማሀኝ /2/

መዳሃኒት ሆነልኝ ታደገኝ ጌታዬ
በማዳኑ ደስታ ጎበኘኝ ውድዬ /2/
እልል እልል በሉ ይብዛለት ምስጋና
ባሳዶቼ ፊት ጽድቁን ገልጧልና

የደስታ ዘይት በልቤ አፈሰሰ
በጠላቶቼ ላይ ኢየሱስ ነገሰ 
እልል እልል በሉ ይብዛለት ምስጋና
ባሳዳዶቼ ፊት ክብሩን ገልጧልና /2/ 2

እቀኝልህአለሁ በምስጋና ዜማ
ማልጄ እነሳለሁ ድምጼንም ላሰማ /2/
በአህዛብ መካከል አመሰግንሃለሁ
በወገኖችም ፊት ቆሜ ዘምራለሁ

ላምላኬ ለኢየሱስ እንባዬን ላበስከው
ከልቤ ከውስጤ ምስጋና ሰዋለሁ /2/
ጨለማዬ ጠፋ ብርሃን በራልኝ
ተደላድያለሁ የሱስ ደርሰህልኝ
',0),(NULL,'በዚያች በቀራንዮ','Sol1','በፈጠረው ፍጡር የተገረፈበት
ለኔ ሲል እኮ ነው ሕይወትን ለመስጠት
መንገላታት መቁሰልህ መራመድ ጥማቱ
ለኔ ነው ገብቶኛል ኢየሱስ የናዝሬቱ /2/

በዚያች በቀራንዮ በጎልጎታ
ጌታዬ ለኔ ሲል ሲንገላታ
ኃይል አለው ኃይል አለው
አላማው በኔ ላይ ፍቅር ነው ፍቅር ነው /2/

እኔን ለመስራት ነው ነጻነት ለመስጠት
ከኃጢአት ባርነት ከሞት ወደ ሕይወት
የተወጋው በጦር የተቸነከረው
መከራ ስቃዩ ዋጋ አለው ለኔ ነው /2/

ኃጢአቴን ሊያነጻ ከእስራቴ ፈቶ
በፈጠረው ፍጡር የእሾህ አክሊል ደፍቶ
ትንሳኤና ሕይወት አለኝታ የሚሆነኝ
የፈሰሰው ደሙ ይችላል ሊያድነኝ /2/
',0),(NULL,'ምሥራቅ ከምዕራብ እንደሚርቅ','Sol1','ምሥራቅ ከምዕራብ እንደሚርቅ
ኃጢአታችንን ከእኛ አራቅኸው
አቤት ኢየሱስ ምሕረትህ
ማዳንህ ድንቅ ነው /2/

የኃጢአት እዳ የከበደንን
ሸክም ፍዳ ያጎበጠንን
ከላያችን አወረድክልን
ጌታ ኢየሱስ ስምህ ይክበርልን

አቤት ጌታዬ ምህረትህ
  አቤት የሱሴ በጎነትህ /2/

አንተ አምላኬ ነህ - ኢየሱስ ጌታዬ ነህ
ቀንና ሌሊት የማስብህ - አንተ አምላኬ ነህ
ሕግህ ለእግሬ መብራት
ለመንገዴ ብርሃን ሆኖልኛልና
ላክብርህ ጌታዬ ንገስ በምስጋና

ትዝ ይለኛል በሃዘኔ ደርሰህ ያጽናናኸኝ
ትዝ ይለኛል በህመሜ ቀርበህ የፈወስከኝ
ትዝ ይለኛል ከሸለቆ ፈጥነህ ያወጣኸኝ
አልረሳውም ሁሌም ትዝ ይለኛል
ትዝ ይለኛል በብቼንነቴ ጓደኛ የሆንከኝ
ትዝ ይለኛል ከጨለማ ፈጥነህ ያወጣኸኝ
ትዝ ይለኛል በጥማቴ ያኔ ያረካሀኝ
አልረሳውም ሁሌም ትዝ ይለኛል

ትዝ ይለኛል የኔ ጌታየዋልክልኝ ውለታ
ትዝ ይለኛል የኔ ኢየሱስ
በዘመኔ አንተ ብቻ ንገስ /...
',0),(NULL,'ኃያል ነህ ብርቱ','Sol1','ኃያል ነህ ብርቱ ኃያል
ኃያል ነህ ብርቱ ኢየሱስ /2/
ላንተ የሚያቅትህ ምንድ ነው?
ተራራው ደልዳላ ሜዳ ነው
ላንተ የሚያቅትህ ምንድ ነው?
ዓለቱ የውኃ ምንጭ ነው /2/

እረአብን የቆራረጥክ
ዘንደውንም የወጋኸው
ሕዝብህን ከግብፅ ያወጣኸው
ባህሩንም የብስ ያረከው
ጌታ ሆይ ኃይልህ ብርቱ/ድንቅ ነው /8/

ማን ይመስልሃል ግሩም ጌታ ነህ
አቻና ወደር መሳይ የሌለህ
በግርማ ሞገስ ሕዝብህን ከልለህ
በጸናች ክንድህ ርስትን አወረስህ

እንደ ንሥር በክንፍ ተሸከምከን
በሞገስ በምስጋና ሞላኸን
ከፊት ከኋላችን ቀድመህልን
ዘመናችን በፊትህ አማረልን /.../
',0),(NULL,'እንጨትና ውሃ','Sol1','እንጨትና ውሃ በሌለበት በምድረበዳ
ኃይልህን ክንድህን እንዳይ በማለዳ
ነፍሴ አንተን እጅግ ተጠማች
ሥጋዬ አንተን እንዴት ናፈቀች
ጌታዬ ! አምላኬ !
ወደ አንተ እገሰግሳለሁ /2/

ምህረትህ ከሕይወት ይሻለኛልና
ከንፈሮቼ ያመስግኑሀል
በሕይወቴ ዘመን እባርክሃለሁ
ባንተ ስም እጆቼን ዘውትር አነሳለሁ

ነፍሴ በቅቤና በስብ እንደምትጠግብ
ደስ ይለኛል ባንተ የሱሴ ስምህን ሳስብ
ከንፈሮቼ ስምህን በደስታ ይጠራሉ
ክብርን በመስጠት ያመሰግናሉ

በመኝታዬ ላይ ጌታ አስብሃለሁ
ማለዳ ማዳንህን እመሰክራለሁ
በክንፎችህ ጥላ ሁሌ ደስ ይለኛል
ቀኝህ መድኃኒቴ ጋሻ ሆኖልኛል

',0),(NULL,'እንደ ንጋት ኮከብ','Sol1','እንደ ንጋት ኮከብ በርቶ ይታየኛል
ማለዳ ማለዳ ይቀሰቅሰኛል /2/
ኢየሱስ /4/
አቤት ምህረትህ ምህረትህ
እጅግ በዝቶልኛል /2/

አዘለለኝ ዛሬ አለፈ ለሊቱ
ብርሃን ወጣልኝ ተዋጠ ብርታቱ
ቀድሞ ተከተልኩት ኢየሱስ የናዝሬቱ
ዛሬ ሌላ ሰው ነኝ ያነጻኝ ምህረቱ /2/

ኢየሱስ ምህረትህ ጥበቃህ ድንቅ ነው
ይኸው እስከ ዛሬ ለኔ ያደረከው
በጨለማው ብርሃን በሞትም ላይ ሕይወት
አድርገህልኛል በዝቶልኛል ምህረት /2/

የሰላም የእረፍት አየር ይሸተኛል
ኢየሱስ ባንተ ሥራ አደላድለኸኛል
አልፈራም ከእንግዲህ ምሽጌ ጽኑ ነው
ኢየሱስ በፈሰሰው ደምህ የሰራኸው /2/
',0),(NULL,'የምድር ስበት','Wegene1','የምድር ስበት አያውከኝም
አንተን ከማምለክ አይጎትተኝም
ተስፋዬን ጽዮን ከሩቅ እያየሁ
ለአንተ ክብር ሁሌ እሰጣለሁ  /2/

በረከት ክብር ምስጋና - ኢየሱስ ላንተ ይሁን
ውዳሴ አምልኮ ስግደት - ኢየሱስ ላንተ ይሁን
ከዘለአለም እስከ ዘለአለም - ኢየሱስ ላንተ ይሁን
ለታረድከው በግ - ኢየሱስ ላንተ ይሁን   /2/

ኢየሱስ ላንተ ይሁን /3/ አምላኬ ላንተ ይሁን  /2/

ከኔ ምትሻው ገንዘብ አይደለም
ብርና ወርቅን አትፈልግም
የአፌን ፍሬ ግን እሰጥሃለሁ
ፊትህ ወድቄ እሰግድልሃለሁ - አመልክሃለሁ

የፍጥረት ሁሉ - ገዢ ነህ ጌታ
ትመለካለህ ጥዋትም ማታ
ላንተ መዘመር - እጅግ ጥቅሜ ነው
ስለዚህ ሁሌ እዘምራለሁ - አከብርሃለሁ

ዛሬማ ምስጋና ነው 
ልቤም አፌም የሞላው
ዛሬማ ውዳሴ ነው
ፊትህ እኔ የማቀርበው /2/

ክበር ክበር እያልኩ ክብር እያልኩ - ላንተ እዘምራለሁ
ከሆኩትም በላይ በላይ - ገና እሆናለሁ  /2/

ላንተ ይሁን /4/ 
',0),(NULL,'ምንድ ነው የሚለየኝ ከፍቅርህ','Wegene1','ምንድ ነው የሚለየኝ ከፍቅርህ /4/
ሞት ቢሆን ሕይወት-መላእክት ግዛት
ያለው የሚመጣው ታላላቅ ሃይላት
ከፍታ ዝቅታ ልዩ ፍጥረት
ካንተ ፍቅር እኔን አይለየኝ ከቤትህ
ዘለአለም ከፊትህ ዘለአለም ከቤትህ
ዘለአለም ከፊትህ

ብዙ ነገርን አትርፌአለሁኝ በቤትህ
ክብር ሞገስን አግኝቻለሁኝ ከደጅህ
ታድያ ከፍቅርህ ማን ይለየኛል ኢየሱስ
መኖሪያዬ ነው ዘለአለም ጌታ ደጃፍህ
ምንድ ነው .....

ፍቅርህ በልቤ ዘወትር ይነዳል - ይነዳል
የመስቀል ስራህ ሁሌ ይታየኛል - ይታየኛል
ከዚህ ውለታህ እንዴት እርቃለሁ - እሸሻለሁ
ለልቤ አለህ ታትሞብኛል - ፍጹም ላልፍቀው

ዘለአለም ከቤትህ ዘለአለም ከፊትህ 
ዘለአለም ከቤትህ ዘለአለም ከፊትህ

መከራ ችግር ቢደራርብ - ቢበዛ
ስደት እራቡም እራቆትነት - ቢመጣ
ፍርሀት ሰይፉ በእኔ ላይ - ቢፈራርቅ
ፍቅርህ የሱሴ ይዤዋለሁኝ - መቸም ላልለቅ

ስፋቱ እርዝመቱ ይህ ነው አይባልም
የፍቅርህ ጥልቀቱ ወሰንም የለውም
አልሸሽም አልርቅም ዘለአለም ከእቅፍህ
ከጉያህ የሚያርቀኝ ከእኔ ይራቅ
',0),(NULL,'ይውረድ መንፈስህ ','Wegene1','ያንተ ሰላም ያንተ ደስታ ያንተ እርካታ
ልቤን ይሙላው ውስጤን ይሙላው ቸሩ ጌታ
መንፈስህን በዝቶልኝ ፍሬው ይታይ
ማንነቴ ቀይሮልኝ ያስደንቀኝ

ይውረድ መንፈስህ ይውረድ መንፈስህ /2/
ይቀይር ህይወቴን ይቀይር ህይወቴን /2/
ጉልበት ይዞ ይምጣ ጉልበት ይዞ ይምጣ /2/
እንቅፋቱ ጥሎኝ ወድቄ እንዳልገኝ
ጉልበት ይዞ ይምጣ ይደግፈኝ

በራሴ ሮጥኩ ተፍጨረጨርኩ - ለማምለጥ
ክፉውን ታግዬ ለመርታት
ግን አልቻልኩም ያንተን ሀይል እፈልጋለሁ
ያን ግዜማ እንደ ንስር እበራለሁ

አይደክመኝም - እሮጣለሁ
አልታክትም - እሄዳለሁ
ያንተ ሃይል ብቻ ይምጣ
ሁሉን ባንተ እረታለሁ /2/

ትንሽ ሮጬ አገልግዬ እንዳልደክም
እስከ ሰማይ ላንተ ክብር እንድኖር
ዛሬ ይውረድ እንዲያድሰው ህይወቴን
ለዘለአለም እንዳልጠፋ ከመንግስትህ

ይውረድ መንፈስህ /3/
ይቀይር ኑሮዬን /3/
ይውረድ መንፈስህ /3/
ይቀይር ሕይወቴን /3/
',0),(NULL,'ምኔን ልስጥህ ','Wegene1','የማይገባኝ ነበረ ይሄ መዳን
የማይገባኝ ነበረ ይሄ መዳን
ለዚህ ክብር መመረጤ ይገርመኛል
ለዚህ መዳን መመረጤ ይገርመኛል
ባንተ አይኖች መታየት ያስደንቃል
ባንተ አይኖች መታየት ያስደንቃል

ምኔን ልስጥህ /3/
ህይወቴን በፊትህ ላፍስስልህ - ምኔን
ምኔን ልስጥህ /3/
ባለኝ ሀይል ላንተ ክብር ልዘምር - ምኔን
ምኔን ልስጥህ /3/
ምስጋናዬንም ከልቤ ላቅርብልህ

ብዙ ታላላቆች ብዙ ባላባቶች እያሉ ጠቢባን
እንዴት መታደል ነው እንዴት መታደል ነው መታየት ባንተ አይን
ይሄ ክብር ጭራሽ እንዲያውም በጭራሽ ለኔ አይገባኝም
መዳን የሰጠኸኝ እኔን ያከበርከኝ ክበር ለዘለአለም

ሁሌ የሚተጉ ዘወትር የሚጸሙ እያሉ በምድር
እንዴትስ ታየሁኝ በምን መመዘኛ በምንስ ተዓምር
አዎ ተዓምር ነው ለሰሚውም ትንግርት ግራ የሚያጋባ
የሚሹህ እያሉ ብዙ የሚተጉ መጣህ ደካማውጋ

ምን ይሆን ነበረ ከወዴትስ ------  ህይወት ባላገኝ
የፍቅር አይኖችህ የማዳን ክንዶችህ ፈጥነው ባይረዱኝ
ጠፍቼ ነበር  የምቀረው በምድር ተቅበዝባዥ ሰው ሆኜ
ከሞት አውጥተኸኝ ርስትን አወረስከኝ ክበርብኝ በኔ

ተአምር ነው ተአምር - ባንተ አይኖች መታየት
መታደል ነው መታደል - ለዚህ ክብር መመረጥ
ተአምር ነው ተአምር - ባንተ አይኖች መታየት
መታደል ነው መታደል - ለዚህ ክብር መመረጥ
',0),(NULL,'ምስጋናዬን አላቆምም','Wegene1','በጊዜውም አለጊዜው - ምስጋናዬን አላቆምም
በከፍታም በዝቅታም - ክብርን መስጠት ጌታ አልተውም /2/

ምስጋናዬን አላቆምም ምስጋናዬን አላቆምም
ማመስገኔን አልተውም ማመስገኔን አልተውም

ምንም እንኳን በለስ ባታፈራም
በወይን ሐረግ ፍሬ ባይገኝም
እርሻዎች መብልን ባይሰጡም
ከብቶች በጎች ቢጠፉ ከጋጡም

ጠላቴ ሆይ ስማኝ የከበብከኝ
በሌትና በቀን የምትዞረኝ
እኔን ማግኘት በጣም ይከብድሃል
የሱስ የእሳት ቅጥሬ ሆኖብሃል
እኔን ማግኘት ተስኖሃል
የሱስ የእሳት ቅጥሬ ሆኖብሃል
እኔን ማግኘት ይከብድሀል
የሱስ የእሳት ቅጥሬ ሆኖብሃል

ክብድ ክብድ ቢለኝ ቢያስጨንቀኝ
ያሰብኩት ባይሞላም ባይሆንልኝ
ከኔ በላይ ለኔ ሚጨነቅ
ኢየሱስ አምላኬ ስላለኝ
ከቶ አልፈራም አልሰጋም
ኢየሱስን ይዤ አልወድቅም /2/
',0),(NULL,'አባ አባት የምልበት ','Wegene1','በድግንግዝግዝ በጨለማ ሳለሁኝ
ድምጽ ሰማሁኝ ልጄ ልጄ የሚለኝ
አመንኩና ተከተልኩት ጥሪውን
አበራልኝ የኔ ጌታ ጨለማዬን
በቃ ነጻሁ አይኔ አጥርቶ ማየት ቻልኩኝ
የልጅነት ስልጣን ከእርሱ አገኘሁኝ

አባ አባት የምልበት 
ሰጠኸኝ ኢየሱስ የልጅነት መንፈስ /2/
በባርነት ቀንበር ዳግም አልያዝም
ወጥቼአለሁ አንዴ ፍጹም አልመለስም 
በባርነት ቀንበር ዳግም አልያዝም
ወጥቼአለሁ ተፈትቼ አልመለስም 

ቀድሞ ወገን አልነበርኩም የክርስቶስ
ርቄ ነበር ከመስቀሉ ከእርሱ መቅደስ
አሁን ግን ስልጣን ከእርሱ አገኘሁኝ
የኢየሱስ ልጅ ተባልኩና እኔ አረፍኩኝ

ወዳጄ ነህ እኔም ልጅህ እወድሃለሁ
ከሲኦል ደጅ ስላዳንከኝ አነግስሃለሁ
መኖሪያዬ አንተ እኮ ነህ ለዘለአለም
መሸሸጊያ መጠለያ ዛሬም ሁሌም

አባቴ ብዬ እኔ የምጠራው
ኢየሱስ አለ ሁሌ የማስበው
አባቴ ብዬ እኔ የምጠራው
ልዑል ጌታዬ ከኔ ጋራ ነው /2/
ከኔ ጋራ ነው /4/ 

አልመለስም ወደ ኋላ አልመለስም /4/
',0),(NULL,'ልናገር አስቤ','Wegene1','ልናገር አስቤ ስራህን ላወሳ
የትኛውን አንስቼ የትኛውንስ ልርሳ /2/

ውለታህ ብዙ ነው  ለእኔ ያረከው
የትኛውን አንስቼ የትኛውን ልተወው /2/

የሚጤስ ክር እንኳን ባንተ ዘንድ ተስፋ አለው
የደከመ ሁሉ ይነሳል ስትረዳው
ሰው አይሆንም ብሎ ወድያ የጣለውን
አባ ታነሳለህ አትለፈኝ የሚለውን
ውለታህ ብዙ ነው

የሚረዳኝ ሳጣ አንድም ሰው ከጎኔ
ካንተ ሌላ የሱስ ነበር ወይ ለእኔ
በጭንቀቴ ሰአት ማምለጫ አለቴ
መሸሸግያዬ ነህ ሰላሜ እረፍቴ
ውለታህ ብዙ ነው

ብዙ ነው ብዙ ነው ውለታህን ጌታ ያደረክልኝ
ከታናሽነቴ ጀምሮ በአይኔ ያሳየኸኝ /2/

ከሞት ለማዳንህ እኔ ምስክር ነኝ
ባይኔ ስላየሁኝ ስንቴ ስታድነኝ
ውለታህ በልቤ ውዴ በጣም በዝተዋል
ስራህን ሳስበው ሁሌ ይገርመኛል
ውለታህ ብዙ ነው

ለጻድቅ የሚሞት ምናልባት ይገኛል
ለውለታው ምላሽ የሚሰጥ ይኖራል
ሐጥያተኛን የሚወድ ከወዴት ይመጣል
ያንተ አመራረጥ ከሰዎች ይለያል
ውለታህ ብዙ ነው
',0),(NULL,'ስራው ስራው','Wegene1','ብዙ አርገህልኝ ብዙ ሰርተህልኝ
ከሕይወቴ ውስጥ ክፉን ለቅመህልኝ
ጌታ ምትጠብቀው መልካም ፍሬ ነው
እኔም ምፈልገው ወይን ለማፍራት ነው
ከኔ ማይሆን ሆኖ ኮምጣጤ ባፈራ
ስራው አፈራርሰህ የሕይወቴን ማዛ

ስራው ስራው ስራው የኔን ሕይወት
በጣም የሚማርክ ፍሬ እንዲበዛበት
ስራው ስራው ስራው የኔን መአዛ
እጅግ የሚማርክ ወይኔ እንዲበዛ

ስራው ስራው ስራው የኔን ሕይወት
ስራው ስራው ስራው የኔን ፍሬ

የሱስ መልካም አባት የወይኑ መሰረት
እውነተኛ ግንድ ከፍጥረት የጥንት
ስራው አሳምረው የውስጤን ማንነት
ለኑሮዬ ሁሉ እንድትከብርበት

ዙፋን ትተህ ወርደህ ብዙ ደክመህልኝ
ክብርህንም ጥለህ ለኔ የሞትክልኝ
አልፈልግም ካንተ ተለይቼ መኖር
ሰላሜን አብዝተህ በሕይወቴ ክበር

ሌላ ቃል የለኝም በኔ ላይ ንገስ
በመንፈስህ ቀባኝ እንባዬን አብስ
የዘይትህን ሃይል ጌታ ሰጠኸኝ
አምሬልህ ልታይ ፍሬ በዝቶልኝ
',0),(NULL,'ብወድቅ እነሳለሁ','Wegene1','ጠላቴ በኔ ደስ አይበልህ
ከሳሼ ሞቴን አትጠብቅ
ጠላቴ በኔ ደስ አይበልህ
ከሳሼ ሞቴን አትጠብቅ

ብወድቅ እነሳለሁ
ብዝል እበረታለሁ
ኢየሱስን ይዤ እንዴት እጠፋለሁ
ብወድቅ እነሳለሁ
ብዝል እበረታለሁ
የየሱስ ልጅ ሆኜ መቼ እጠፋለሁ

አቅደህ ነበረ ስበህ ለመጣል
አልሆነልህም ጭራሽ እንዳሰብክ
ሴራህንም ሁሉ የሱስ ገለበጠው
አይኖችህ እያዩ ድካሜን ለወጠው

መች ቀረሁ ወድቄ አንሳኝ ውድዬ
የእስራኤል አምላክ አዳነኝ አምድዬ
አንተማ አላማህ እንድጠፋ ነበር
ኢየሱስ ደርሶልኝ ምሽግህን ሳይሰብር

ከፊቴ ሆነህ መንገዴን ዘግተህ
እኔን ለመጣል ዘብተህ ዝተህ
ስትደክም ስትል ስታስፈራራ
እንደሚያገሳ ብርቱ አንበሳ
መቼ ሆነልህ መቼ ተሳካ
ተረጋገጥክ እንደ መንገድ ጭቃ
አንተ ግን አፈርክህ እቅድህ አበቃ
ተረጋገጥክ እንደ መንገድ ጭቃ

በኔ ላይ የጎበዘ በላይ የበረታ
የሰይጣን ሃሳቡ እቅዱ ተመታ
በኔ ላይ የጨከነ በኔ የበረታ
ጠላቴ ዲያብሎስ በየሱስ ተረታ /2/
',0),(NULL,'ምራን የሱስ','Wegene1','ምራን የሱስ ሆይ ምራን ምራን
ምራን እንደ ቃልህ ምራን
ያንተ እንድንሆን
መንፈስህ ይብዛልን
ያንተ እንድንሆን
መንፈስህ ይብዛልን

በምናየው ነገር ከቶ እንዳንሸበር
ልባችን ሰንፎ ከጽዮን እንዳንቀር
በዚያ በቅዱሱ የሚያረካው መንፈስ
ምራን ኢየሱስ ሆይ ላንተ እንድንቀደስ

የበጎችህ ወዳጅ ነህና ጌታችን
ሁሌ ምታረካን ደርሰህ በጥማችን
እባክህ የሱስ ሆይ ዛሬም ይዘህ ምራን
ከፊት እየቀደምህ ጽዮንን አውርሰን

ምራን ምራን ምራን የሱስ አንተው ምራን
ምራን ምራን ምራን ጌታ አንተው ምራን /2/

ስጋችን ቢያስቸግር ከቃልህ ሊወጣ
ቢያሳዝንህ ዛሬ የሰማዩን ጌታ
በምህረትህ አይተህ በፍቅርህ ደግፈህ
ባርያዎችህ አርገህ በቃልህ ለውጠህ

ምራን ምራን ምራን  /6/

',0),(NULL,'አንዴ ወድቋል','Wegene1','ጉልበት የለኝ ብርታት የለኝ
ውዴ የሱስ ከሸሸኸኝ
እባክህን ጌታዬ ሆይ
ከአጠገቤ ሁን አትለይ  /2/*

አንዴ ወድቋል  ላይነሳ ባንተ ላይ
አምላክ ያዘኝ ተሸከመኝ እስክገባ ሰማይ

አትለየኝ አትለየኝ እጄን ያዘኝ
ሃይሌኮነህ ብርታቴ ምታግዘኝ
አትለየኝ አትለየኝ እኔን እርዳኝ
ባሳዝንህ ብበድልህ በደምህ ውስጥ ተመልከተኝ

ምህረትህ አዲስ ነው ማለዳ ማለዳ
የሱሴ ምሰጠው ሁሌ ለተጠጋህ
በቃ ጨርሻለሁ እኔ አልፈልግህም
ማንንስ ብለሀል ደጋግመህ ስትምር

አቤት ምህረትህ አቤቱ ይቅርታህ
እጅግ በዝቶብኛል የሱሴ ውለታህ 
ልቤ ውስጥ ነህ  /2/*

ምትታወቅበት ሩህሩህ ቸሩ ጌታ
በምህረትህ ነው ጧትና ማታ
አዎ ዛሬም ቀድስ ሕይወቴን ፈውስ
የክፉት ሃሳቤን በቃልህ አፍርስ

የሱስ ፈቅጃለሁ ወደ ልቤ ግባ
ያንተ ያልሆነውን ከውስጤ አስወጣ  
ክበር እንደገና /2/*

በቃ ያንተ ነኝ ፍጹም የሌላ መሆን አልችልም
ክብሬ ጌጤ አንተኮነህ ለዘለአለም
ተጠቀምብኝ የራስህ አርገህ ኑሩብኝ
አሳልፈህ ለጠላት/ለሃሳቤ/ አትስጠኝ   /2/*
',0),(NULL,'አንተን እጠርሃለሁ','Wegene1','አቅሜ ሲደክም ሲደክም ጉልበቴ ሲዝል
ሃይሌን እንደ ንስር እንደ ንስር ምታድስልኝ
የሁሌ ረዳቴ የሁልጊዜ ኢየሱስ እያልኩኝ
 ወዳንተ እጮሃለሁ እጮሃለሁ እስክትጎበኘኝ 

አንተን እጠርሃለሁ አንተን እጠርሃለሁ
ኢየሱስ እልሃለሁ ኢየሱስ እልሃለሁ
አንተን ጠራሃለሁ አንተ ጠራሃለሁ
ማረኝ እልሃለሁ ማረኝ እልሃለሁ

ብቻዬን ስሆን ብቻዬን ሁሉም ርቆኝ
ሚረዳኝ ወዳጅ ሚረዳኝ ሌላ ሳይኖረኝ
ተራራ ሲወጣ ተራራ ሾሎቆም ስወርድ
ማትለየኝን ማትለየኝ ጌታዬን ልጥራህ

እጠርሃለሁ እጠርሃለሁ /2/ 
አትለፈኝ ኢየሱስ እልሃለሁ
እጠርሃለሁ እጠርሃለሁ /2/ 
    እጆቼኝ ያዝ እልሃለሁ     2*

ፈተና ሲከበኝ ሲከበኝ ከአቅሜ በላይ
እርቄህ ሳይሆን እርቄህ ባንተ ፊት ልታይ
ወድቄ የምጮኸው የምጮኸው ወደ መቅደስህ ነው
ካንተ በቀር ሁሉ ካንተ በቀር ጊዚያዊ ነገር ነው

ማረኝ ማረኝ ብዬ ማረኝ ብዬ አሁን እጮሃለሁ
ጌታዬ በጎኔ ኢየሱሴ ስታልፍ ሰምቼአለሁ
አንተም የምስኪኑን የምስኪኑን እምባ ታብሳለህ
ሸክምን በምሉ ሸክምን ሁሉ ቶሎ ታነሳለህ

ዘመኔን ዘመኔን እንደ ቀድሞ አድስልኝ
ዘመኔን ዘመኔን እንደ ጥንቱ አድስልኝ
',0),(NULL,'እንደ ሰማን......አየን ','Tadne1','ሰምተህ የምትመልስ አምላክ አለኽንና
ደስ ይለናል በአንተ ስለሆንክ ከኛ ጋራ /2/
እንደሰማን አየን አየን/ 4*
እኛ ይህ ስንል በዙሪያ ባሉት ዘንድ
ጌታ አደረገላቸው ተባለ/ 4*

እንደ ቸርነትህ እንደ አንተ ስጦታ
ሁሉን አረክልን አስገረምከን ጌታ
መደነቅ ውስጣችን በእጅጉ ሞልቷል
ጥንት የሰማነውን በአይናችን አይተናል

ትችላለህ ሲባል በዝና ሰምተናል
ዛሬ ግን ለእኛ ተከናውኖልናል
አወቅነው ኃይልህን አዎ ትችላለህ
ድንቅ ታምራትን ሠርተህ ታሳያለህ

በዙሪያችን ያሉ የሚያዩት በሙሉ
ምልክትን አረግህ ሁሉ አስተዋሉ
የታወቀ ነገር በግልፅ ስላዩ
አደረገላቸው ጌታ ብለው አሉ

አይተናል ሥራህን ኢየሱስ ተመልክተናል
አውቀናል የአንተን ችሎታ እኛስ ተረድተናል
በዕድሜ ዘመናችን እንጠራሃለን
አንተኑ ተማምነን ሁሉ ሆነልን
ሆኖልናል ምንም አልጎደለን
ተሳካልን ከእኛ ጋር ስላለህ
',0),(NULL,'ላመልከው ቃል ገባሁ','Tadne1','ቅዱስ ቅዱስ የሚሉት
አእላፍ መላዕክት ሚሰግዱለት
የፍጥረት ጌታና መድኃኒት
ኢየሱስ ለኔ ሆነኸኝ እረፍት  /2/

መተኪያ የለው እሱን የሚመስለው
ለዘለአለም ብቻውን አምላክ ነው
አምላካችን ኃይላችን ነው
በእርሱ እንበረታለን አው እናደርጋለን
ላመልከው ቃል ገባሁ ለራሴ
ልገዛለት ልለው ንጉሴ
ለዘላለም ሾምኩት በላዬ
ኢየሱስን ወደደችው ነፍሴ
ነፍሴ ልታመልከው የመረጠችው
የእርሱ ነኝ ብላ የመሰከረችው
ልቤም ሊያነግሰው የፈቀደው
እርሱ ብቻውን የሱስ ነው

ሊነግስ የሚገባው ላመልከው ደግሞ
በልቤ ዙፋን የበላይ ሆኖ
የኔ አምላክ ኢየሱስ ብቻ
በላዬ የማነግሰው አው የምገዛለት
ላመልከው ቃል .....
',0),(NULL,'ምስጋና ለአንተ','Tadne1','በአንተ ኃይል በአንተ እርዳታ
አስጨናቂው ስለተረታ
ያለ ፍርሃት በነፃነት
እንድንኖር ያስቻለን ያንተ ምህረት
እናስባለን ፍቅርህን ዛሬ
ሞገስ የሆነንን ሁሌ

ምስጋና እጥፍ ምስጋና ለአንተ
ኢየሱስ ለአንተ
ቅዱስ ለሆነው ለስምህ
ለታላቅነት ለክብርህ
እንዘምራለን ቅኔ እንቀኛለን /2/

ማዳንህን አይተነዋል /2/
ካንተ መልካም አግኝተናል ብዙ መልካም /2/
በጎ ከሆነው ካንተ ስጦታ
ተቀብለናል እናከብርሃለን ጌታ

እንኖራለን ባንተ ምህረት /2/
ፀጋህ በዝቶ በቸርነት በነፃነት /2/
የአስጨናቂው ዘንግ ተሰብሯልና
ላንተ እንሰዋ ለስምህ ኢየሱስ ምስጋና

ምስጋና እጥፍ ምስጋና .....
',0),(NULL,'ናፈቀችህ ነፍሴ','Tadne1','ነፍሴ የወደደችህ ወዴት ነህ
ድምፅህ ናፈቀኝ ወዴት ነህ /2/

ድምፅህን ልትሰማ የናፈቀች
ቃሎችህንም የተጠማች
ነፍሴ አንተን አለች
ውዴ ዛሬ ወዴት ትመስጋለህ
ውዴ ወዴት አንተ ትውላለህ
ውዴ ከአንተ ጥላ በታች
ነፍሴ ለማረፍ ወደደች
ናፈቀችህ/4/  ነፍሴ አንተን አለች

ፍለጋህን እከተላለሁ
እኔ አንተን ናፍቄህአለሁ /2/
ሳበኝ ሳበኝ ሳበኝ የኔ ጌታ
ያለ አንተ አላገኝም ፍፁም እርካታ /2/

ስለምን እቅበዘበዛለሁ
ከሌላውስ ኋላ ለምን እሮጣለሁ /2/
ንገረኝ ኢየሱሴ የልቤ ናፍቆት
የት ነው መገኛህ የምታርፍበት? /2/
ነፍሴ በውስጤ እያሰበች /2/
ስላንተ ናፍቆት ፈዘዘች /2/
',0),(NULL,'የድልን ዝማሬ','Tadne1','ቸርነቱ አሃ ደግነቱ/2*
ያደረገው ደግሞ ታምራቱ /2*
እኔን ያዘምረኛል/ 8*

ታምራቱ ድንቁ ቢያስገርመኝ /2*
በሕይወቴ በዝቶ ቢያስደንቀኝ/2*
ክበር ኢየሱስ ልለው
ስሙን ከፍ ላድርገው
ልዘምር እኔ ተነሳሁ

የድልን ዝማሬ የድልን ዜማ
ይዤ መጣሁኝ እኔም ላሰማ
ደስ ብሎኛል በዚህ ጌታ ረክቻለሁ/2*
ክብር ለርሱ ይሁን እያልኩ እዘምራለሁ/2*

ጨለማዬን አብርቶ ቢያሳየኝ/2*
ማዕበሉን ሁሉ ቢያሳልፈኝ/2*
ልባርክ ልወድሰው
በሙሉ ኃይሌ ላመልከው
በፊቱ እኔ ቆሜአለሁ

ጠላቴን እርሱ ሲጥልልኝ/2*
አይቼው የምለው ቢጠፋኝ/2*
በአደባባይ እኔ ላከብረው
ክብሬን ጥዬ ላነግሰው
ይኸው ዛሬ መጣሁ
',0),(NULL,'ያያል በዙፋኑ ያለው','Tadne1','ሁሉ ወደብርሃንይመጣል
ጊዜምነገርንይገልጣል
እግዚአብሔርበጽድቅይፈርዳል
ሁሉምወደፍርድይመጣል /2/
ያያልበዙፋኑያለው
ያያልከፍከፍያለው
ከፍካሉትበላይእርሱየበላይየሆነው

ከአፉቃልአንዳችጠብአይልም
ላይፈፅምአይናገርም /2/
ለሁሉእንደሥራውይከፍልዘንድያለው
ዋጋዬከእኔጋርነውብሎየአለው /2/

ለሰውሁሉእንደመንገዱ
ይፈርዳልእንደአካሄዱ /2/
ቸልሳይልጌታበጽድቅይበይናል
ለሁሉመልስአለውበፍርድአያዛባም /2/

ለዚህኛውለዚያኛውሁሉ
ዋጋአለውልክእንደቃሉ /2/
አይፈጥንአይዘገይምትክክሉንያውቃል
ለሁሉጊዜአለውጊዜንይጠብቃል /2/

ያላወቀቢመስልያላየያልሰማ
ኢየሱስግንሕያውነውመችለእርሱይሰወርና
አላየምአትበልአልሰማምአይባል
ግንስለማይቸኩልልብህንአታፅናአትበድል
',0),(NULL,'በምህረት ጥላ ስር','Tadne1','በአንተ የማይቻለው ተችሎ
ምህረትህ በኛ ላይ በዝቶ
እዚህ ደርሰናል ፍቅርህ አይሎ /2/ 2

አቤቱ ስንዝል ሲደክመን
መራመድ ሲያቅተን ሲያዳግተን
ከአንተ ዘንድ የሆነ ትምክትህ አለን
የሚረዳን የሚያግዘን

በምህረትህ ጥላ ሥር መኖርን ለምደናል
ደምህ እያነፃ ህያው ያደርገናል
መንፈስህም ደግሞ ይቀድሰናል ያፀናናል

ሸክማችን ከብዶ ሲጫነን
ዙሪያው ገደል ሆኖ ሲጨንቀን
ተስፋን የሚሰጠን ጉልበታችን
መንፈስህ ነው ኃይላችን

ሁሌእንመካለን በስምህ
ሊያነፃን በሚችል በደምህ
አንፈራም እንታመንሃለን
ትችላለህል ታድነን

በአንተ የማይቻለው ....
በምህረትህ ጥላ ....
',0),(NULL,'ሥራህ አይቻለሁ','Tadne1','ላመሰግንህ ደስአሰኝተኸኛል
አከብርሃለሁ ስራህ አይቻለሁ /2/*

አንተታላቅነህስምህምበኃይል
እጅግታላቅነው
ስራህብዙነውብርታትህፅኑ
ግሩምአምላክነህ

መስራትታውቃለህከፍያለውንነገር
አቤትችሎታህ
ታስደንቃለህአዎየኔጌታ
ምንይሳንሃል

ሥራህንአየሁትእኔበዘመኔ
ተደንቄአለሁ
በአንተበጎነትውስጤተገርሟል
እወድሃለሁ
',0),(NULL,'አቤትእንዴትይገርማል','Tadne1','አቤትእንዴትይገርማል
ሥራህእንዴትይደንቃል /2/
እግዚአብሔርሁሉንችለሃል
ይህንያንብቻህንሠርተሃል
በዘመንቢሆንበአመታት
ሳይሻርየአንተብርታት /2/

ሰማይንምሳየውእኔቀናብዬ
ምድርንስመለከትደግሞጎንበስብዬ
የዱርአራዊቱየሰማይአእዋፋት
ሁሉበቦታቸውሆነውበስርዓት
ድንቅነውእላለሁስምህንእባርካለሁ
በችሎታህይህንሠርተህስለአየሁ  /2/

ባህሩስቃኘውእኔሳስተውለው
ውቅያኖሱንሁሉዳርቻሰጥተኸው
እንስሳትንደግሞአሳምረሃቸው
ጌታበጥበብህተጠበህባቸው
ልቤግሩምይላልኢየሱስያከብርሃል
ይህንቢሆንያንንብቻህንሰርተሃል/2/

ከሁሉአስበልጠህሰውንምፈጠርከው
በአፍንጫውየሕይወትእስትፋስእፍአልከው
ሁሉንእንዲገዛምስልጣንንሰጠኸው
በዚህአላበቃምእስከሞትወደድከው
ደግሞይህንሳየውፍቅርነህእላለሁ
የዘላለምሕይወትአዘጋጀህለሰው  /2/

በዘመናትሁሉየሱስየሰራኸው
በአመታትምብዛትአንተያከናወንከው
ተቆጥሮአያልቅምእንዲህነውተብሎ
ከቃላትምያልፋልአይቻልተዘርዝሮ
እንዲያውበጥቅሉይሻላልማመስገኑ
ድንቅነህግሩምነህትልቅነህእያሉ /2/
',0),(NULL,'የተደረገለት','Tadne1','የተደረገለትእንደኔካለ /3/
ውለታውየበዛለትምህረትያገኘ
ፍቅሩንያዬየተጎበኘ /2/*
ያምልከውከኔጋራ
ኢየሱስንከኔጋራ
ምስጋናናእልልታ
ያብዛለትለዚህጌታ /2/*

ድቅድቁጨለማየበራለት
ከሰማይብርሃንየመጣለት
አይኖቹተከፍተውማየትየቻለ
ያመስግነውክበርእያለ /2/*


ጌታንያገኘየተጎበኘ
በእርሱምህረትየሚኖርካለእንደኔ /2/
ያምልከው ....

ያለፍርሃትየሚኖርበነጻነት
ከኢየሱስባገኘውምምህረት
ያጎበጠውቀንበርየወደቀለት
ብዙምስጋናለእርሱያምጣለት /2/*

ጌታንያገኘ ...
የተደረገለት ....

የጎበኘውኢየሱስበእርሱሰላም
ከገናናውክብሩከአርያም
የሆነለትእጅግፍጹምደስታ
ይሰዋለትውዳሴእልልታ /2/*
ጌታንያገኘ ....
',0),(NULL,'ተማምኜህልኑር','Tadne1','ተማምኜህልኑር/3*/
ኢየሱስበአንተፍቅር /2/
ወረትአያውቅምሁሌየምትወድ
ከሁሉበላይከወዳጅዘመድ
እንከንየሌለውለዘላለም
የትምቢሆንመቼእንደአንተየለም  /2/

አንተብቻ/ 3* ወዳጅነህለኔ
የልቤሰላምየውስጤእርካታ
ኢየሱስብቻየነፍሴጌታ
ሁሌምዘወትርየማትለወጥ
ዘለዓለምየማትሰለች
ኢየሱስነህለኔወዳጅማለት/ 4*

አቻየለህምየሚደርስብህ
ፍቅርህያኖራልበእውነትልዩነህ
ልዩነህአንተትለያለህ
አንተማየፍቅርአምላክነህ
አሳብህመንገድህአላማህ
ቅንነውየፍቅርነው

ወረትበሌለውበማይቀየር
ፍቅርየሚወድ  /2/*
የለምካንተሌላኢየሱስካንተበቀር
አይኖርምዘላለም /2/*
',0),(NULL,'አስችለኝኢየሱስ','Tadne1','አስጉዘኸኛልእስከዛሬ
አንተሆነህልኝሞገስክብሬ
አሁንምአፅናልኝጉልበቴ
ሰጥቼሃለሁሕይወቴ

አስችለኝኢየሱስአስችለኝ
አስችለኝአምላኬአስችለኝ
እንዳልወድቅእኔእንድፀና
ፈቀቅእንዳልልከህይወትጎዳና  /2/*

አንተንበመፍራትዘወትርእንድኖር
በቅድስናበፍፁምፍቅር
አረማመዴይሁንበዝግታ
ድንገትፈጥኜጉዞዬእንዳይገታ

የአንተንፈቃድመርምሬልወቅ
የዘላለሙንየልብህንሃሳብ
ሁሌምላስተውልልኑርበት
መንፈስህያግዘኝይምጣልኝምሪት

እስከመጨረሻበትዕግስትእንድጓዝ
ታላቅተስፋዬንአጥብቄእንድይዝ
የሚያፀናኃይልህየሚያስችለውፀጋህ
ይብዛይደግፈኝጉልበትይሁንልኝ

መቻልንየምትሰጥጉልበትምየምትሆን
አምላኬአንተውነህአደራህን /2/*

',0),(NULL,'በእኔ ላይ ያረከው','Tewlde1','እኔስ በልቤ የአማሁህ ፍጹም ትተኸኛል ብዬ
ቃልህን ተጠራጠርኩት ስጋ ነኝ እና አባዬ
አንተ ግን እንደ እኔ ድካም አልፈለክም
በምህረትህ ደጋግፈህ አለፍኩት ሁሉንም

በእኔ ላይ ያረከው ቸርነትህ በዝቷል
ምህረትህ ኃጥያቴን ፍጹም ደምስሶታል
የሱሴ ሆይ ላንተ ያንሰሃል ምስጋና
አይበዛም ፈጽሞ ድንቅ አምላክ ነህና
እስትንፋሴ ታመስግንህ በማደሪያህ ታሸብሽብልህ
በአንተ ታይቻለሁና ልክፈልህ ምስጋና /2/

ሁሉን ቻይ እንደሆንክ አውቄአለሁ
ከቀድሙትም አፍ ሰምቼአለሁ
ማዳን ምህረትህን አይቻለሁ
ታላቁን ፍቅርህን ቀምሼያለሁ
በድካሜ ጊዜ ብጠራጠርህም
ቃልክን ከመፈጸም ወደኋላ አላልክም

ሰው በእምነት መጽናት ቢችልም
ጠብቆ መዛሉም አይቀርም
አንተ ነህ ኢየሱስ ተስፋዬ
የሕይወቴ ዋልታ አለኝታዬ
ስለዚህ ምህረትህ ፍጹም አይለየኝ
በመንግስተ-ሰማይ አብሬህ እንድገኝ
',0),(NULL,'በከፍታም ይሁን በዝቅታ','Tewlde1','በልኡል መጠግያ የሚኖር ሁሉን ችሎ ይራመዳል
የሚያጋጠመውን ሁሉ በአምላኩ ብርታት ይወጣል
ስለዚህ በሃዘን ያለህ አጽናኝ ያጣህ አይምሰልህ
እስቲ አንዴ አመስግንና በድል ያቁምህ እንደገና

በከፍታም ይሁን በዝቅታ በመክብርም ይሁን በውርደት
ይሻላል ጌታ ማለት መሰዋት ለእሱ ምስጋና
ያኔ ነው ሰላም ያለው ሰይጣን አፍሮ የሚሄደው

ውጥን አልሳካም ብሎ ያሰብከው ሁሉ ሲገታ
የተገላቢጦሽ ሆኖ ከውስጥህ ሲጠፋ ፋታ
ልብህን ለሥጋ አትስጠው በጌታ አምላክህ ተጽናና
ሃሳብክን ሁሉ ሰብስበህ ለኢየሱስ ሰዋ ምስጋና

የምስጋና መንፈስ ያለው ያከብረኛል ብሏልና
ማዳኔን አሳየዋለሁ በመረጥኩለት ጎዳና
ይህ የከበረ ቃልኪዳን ከኢየሱስ ለኛ ተስጥቷል
ምስጋናን ለእሱ እሰዋና እንጠብቀው ድል አለና

ኢዮሳፍጥን ተመልከተው ምስጋና ድል እንደሰጠው
እግዚአብሔር ድብቅ ጦር ልኮ አሸናፊ እንዳደረገው
እንግዲህ የጌታ ልጅ ሆይ ውድ ወንድሜ ልምከርህ
በል አሁን በርታ በልና ለኢየሱስ ስጠው ምስጋና
',0),(NULL,'ጠላቴ ሆይ አትጓደድ','Tewlde1','ጠላቴ ሆይ አትጓደድ
እንደተ ሁሌ አልቀርም /2/
የአምላኬን በቀል አያለሁ
የስሙን ማዳን አያለሁ /2/

በምድረ በዳ ወድቄ
ጉልበቴ አልቆ ደቅቄ
በእምነት የሱሴን ጠርቼ
በእግሮቼ ያቆመኝ ታማኝ ነው

ሰው ሁሉ አበቃ ቢለኝም
ያውቁኝ ሁሉ ቢረሱኝም
በአምላኬ እንዳለሁ አውቃለሁ
በጊዜው ከፍ ከፍ እላለሁ

የሚወዳቸውን ይቀጣል
ለበጎ ሁሉን ያደርጋል
በሕይወት ሸሎቆ የሚያስኬደኝ
የክብሩን ዕቃ ሊያደርገኝ

እንደ ወርቅ በእሳት አልፋለሁ
ችግር መናቅን እቀምሳለሁ
ብድራቶቼን አያለሁ
ጣፋጭ ፍሬም እሆናለሁ
',0),(NULL,'4 ከባርያህ ጋር ወደ ፍርድ አትግባ','Tewlde1','የሱስ የልቤን ድምጽ አንተ ትሰማለህ
እንደ ሰዎችዬ ብቻ መች ታያለህ
የሃይልህ ፍርድ ዘንግ እያለ በእጅህ
በትዕግስትህ ምህረት ሁሌ ታየኛለህ 2

ከባሪያህ ጋር ወደ ፍርድ አትግባ
በቸርነትህ እየኝ ሌሊቱ ሲጠባ /2/

እታመናለሁና በምህረትህ
የሱስ ሆይ በፍቅርህ ነፍሴን ጎብኛት
በመከራ ጊዜ ድረስላት 
ጌታ ሆይ በፍቅርህ ነፍሴን ጎብኛት
በችግሯ ጊዜ አለሁ በላት

ማሳደድ የያዘው እግዚአብሔር ትቶታል
በኃጢያቱ ብዛት ሞገስን ነጥቆታል
ነፍሴን ሊናጠቋት ጋልበው ቢደርሱብኝ
ምህረትህን ሳስብ ከአይኔ ፊት ጠፉብኝ 2

ከክፉ ሰዎች አፍ ከአስጨናቂዎች እጅ
በሰልፍ በበረቱ ካሉ በክፋት
ስምህ ሰውሮኛል ባንተ ረትቻለሁ
መሰናክሎቼን ሁሉ አልፈያለሁ 2

እራሴንም ሳየው አፈር ትቢያ ነኝ
ለጽድቅ የማልበቃ ያልሆንኩኝ ታማኝ
ግን እኔ የማውቀው የምተማመነው
ዘላለም ነዋሪውን ምህረትህን ብቻ ነው2
',0),(NULL,'ከጨለማ አለም ባንተ ወጣሁኝ','Tewlde1','ከጨለማ ዓለም አሃ አሃሃ ባንተ ወጣሁኝ አሃ አሃሃ
ድንቅና ታላቅ አሃ አሃሃ ብርሃን አየሁኝ አሃ አሃሃ
ወገን አልነበርኩ አሃ አሃሃ ዛሬ ግን ሆንኩኝ አሃ አሃሃ
በጎነትህን አሃ አሃሃ ኢየሱሴ በመንገር ላይ ነኝ አሃ አሃሃ /2/

ባንተ መዋረድ በመስቀል ስቃይ አሃ አሃሃ
አገኘሁኝ ክብር ወጣሁ ወደ ላይ አሃ አሃሃ
እኔም ልዋረድ ሌላው ከፍ እንዲል አሃ አሃሃ
አንተን መስዬ እንዳገኝ አክሊል /2/

የስጋ ክብር የሳር አበባ አሃ አሃሃ
ረጋፊ ጠፊ እንደ ገለባ አሃ አሃሃ
ዋጋ ለሌለው ከእንግዲህ አልለፋም አሃ አሃሃ
ለምድር እርካታ አልጨነቅም /2/

ፍጹም አይበቃም ታሪክህን ማውራት አሃ አሃሃ
በመስቀል ሞትህ ኢየሱስ ማለት አሃ አሃሃ
መንገድም እውነትም ሕይወት ነህና አሃ አሃሃ
ልምሰልህ እኔም በፍቅር ፋና /2/

ባርያህ አመስግኗል አንተን መምሰሉን አሃ አሃሃ
ያለነቀፋ ወንጌል መዝራቱን አሃ አሃሃ
የምድር ዘመኑ እስከሚያበቃ አሃ አሃ
አልተበገረም ለክብር በቃ /2/
',0),(NULL,'ምስጋና ዘወትር','Tewlde1','ምስጋና ዘወትር መዳንን ለሰጠኝ
ለጌታ ለኢየሱስ ነፍሴ ቅኔን ትቀኝ
ይገባዋልና ምስጋና የሱሴ
ይገባዋልና ምስጋና ይገባዋልና ምስጋና

ከመቅበዝበዝ ህይወት ፈልጎ ያገኘኝ
ለገዛ መንግስቱ ወራሽ ያደረገኝ
ስለሆነ ኢየሱስ የመዳኔ ጌታ
ልዘምር ለክብሩ አለብኝ ውለታ

የነጠረች እውነት ሃይማኖት የሰጠኝ
በሐዋርያት መንገድ አቅሞ ላጸናኝ
በስሙ ላተመኝ በመንፈስ ለሞላኝ
በዘመኔ ሁሉ አሜን ተመስገን ስለው ልገኝ

እልል ልበልለት ልቤ ይቅለጥለት
በቅዱስ ማደሪያው እኔ ልስገድለት
ሲያንስበት እንጂ መቼ ይበዛበታል
ብቻ በምስጋና አሜን ብጠራው ይሻላል

እናንተም እንደኔ ውለታ ያለባችሁ
የየሱስ ብድራት ብዙ የሆንባችሁ
ባንድነት ከኔ ጋር በታላቅ ደስታ
ምስጋናን እንስዋ እንዲሆነው ሽታ
',0),(NULL,'እንደ አንተ ያለ አባት','Tewlde1','ከዙፋንህ ወርደህ ጎስቋላ ፍለጋ
በሰው ለተናቀው ልብህን ሳትዘጋ
ጠጋ ታደርግና ትደባብሳለህ
በሞገስህ ዘይት ታባብሰዋለህ

እንዳንተ ያለ አባት ምስኪን ፈቃር ረዳት
ትካዜ ሃዘንን መካፈል የምትወድ
ክብርህን ለሌላ ከቶ አትሰጥምና
የችግር ደራሼ ላንተው ነው ምስጋና

እኔን ሰው ለማድረግ ብዙ የደከምከው
በጨካኞች ጅራፍ ቆስለህ የተገረፍከው
ብቻህን ለነፍሴ ተሟግተሃልና
ለሰው ክብር ሳይሆን ላንተ ይሁን ምስጋና

አንተ ሳታገኘኝ የጣሉኝ በሙሉ
ይሄ ሰው አይሆንም ብለው የተማማሉ
ዛሬ ግን በዘይትህ ወዝቼ ስላዩኝ
ለግርማቸዉ ዝና ለምክር ፈለጉኝ

አልለዋውጥም ስፍራዬን አልስትም
ባንተ ሰው መሆኔን ፍጹም አልዘነጋም
እንደ መጀመሪያው ጥንት እንዳገኘኸኝ
ኢየሱስ ተመስገን ለዘላለም ባይ ነኝ
',0),(NULL,'ሰዎች እርሱን አይተው','Tewlde1','በሰዎች ተንቆ በአለም ፊት ወራዳ
ስድብ የጠገበ በሁሉ የተከዳ
ግን አንተን በተስፋ ሆኖ ሚጠብቀውን
የገበኘኸውን እለት ቀደህ ጨርቁን ማቁን

ሰዎች እሱን አይተው ያመሰግኑሃል
ጻድቅ ቅን ፈራጅ ነህ ብለው ይጠሩሃል /2/

በድግፎች ገብቶ ተመልካች ያጣውን
ግን እልፍኙን ዘግቶ ወደ አንተ ያነባውን
የስዉር ለቅሶውን ሰምተህ ውዱ ጌታ
በአደባባይ በግልጽ የከፈልከው ለታ

በዕውቀት ጥበባቸው ግንበኞች ተማክረው
ምክንያት በመደርደር ከውስጥ ቅንአታቸው
አንተ አትበጅም ብለው የወረወሩትን
የሱስ ግን አንስተህ ስታለብሰው ክብርን

የምድር ፈራጆችን በዕብደት ስትመታ
ከታመኑት ሰዎች ቋንቋ ያራክ ለታ
ታግሶ የኖረውን ክንድህን ስትሰነዝር
የላዩን ታች አርገህ በታቹ ስትከብር
',0),(NULL,'ምስራቅ ከምዕራብ ይርቃል','Tewlde1','ምስራቅ ከምዕራብ ይርቃል ግን መጠኑ አይታወቅም
እንዲሁ የጌታን ምህረት ቆጥረን አንጨርሰውም /2/*
ከብላቴንነት አንስቶ እስከ አሁን ተሸክሞናል
በዝማሬ እናመስግነው ሌላ ምን ይከፈለዋል?

ከተስፋው ቃል የራቅነውን በውድ ልጁ አቀረበን
ወገን ያልነበርነውን የንጉስ ክህነትን ሰጠን
ድካም እያየለብን ታጥበን ጭቃ ስንሆን
ደግሞ በደሙ ያጥበናል ምህረቱን እያበዛልን

ሳይነቅፈን ለተቀበለን ሃጥያታችንን ደምስሶ
እስራኤላውያን ላረገን የጥልን ግድግዳ አፍርሶ
የተስፋው ቃል ወራሾች የአብርሃም የያዕቆብ ዘር
አድርጎ የቆጠረን ኢየሱስ ዘላለም ይክበር

አባ አባት የሚያሰኝ የልጅነት መንፈስ ሰጠን
ሻካራውን መንገድ ሁሉ በጀልባ አዞ አሻገረን
ታማኝነቱን ጠብቆ ሁልጊዜ ላልተለየን
እስኪ እንነሳ እና እንስጠው ክብር ውዳሴን
',0),(NULL,'ምን አለ ኢየሱስ','Tewlde1','እስራኤልን ከግብጽ ለማዉጣት ለላከው
ለባሪያህ ለሙሴ ሞገስ የሰጠኸው
ለፈርኦን ውርደት ምክንያቱ የሆንከው
ኢየሱስ አንተው ነህ ተዋግተህ የረታኸው

ምን አለ ኢየሱስ ያልተዋጋህለት
ለቀባኸው ባሪያህ ያልተሟጋህለት
ኤልሻዳይነትህን ቀናተኛነህትን ታስመሰክራለህ

ሳኦል ያንተን ዳዊት ለማጥፋት ሲያሳድድ
በክፋት ተሞልቶ በቅናት ሲነድ
ከተወረወረው ጦር እጅ ያመለጠው
ባንተ ላይ ተማምኖ የሱስ ስለታዘዘህ ነው

አንተ ተዋጊ ነህ ተስፋ ላደረገህ
ከታሰረበት ወጥመድ ሰብረህ ታወጣለህ
የሰዎችን ሃሳብ ከንቱ ታደርጋለህ
ፈቃድህን በምድር ጌታ ታከናውናለህ

በዙፋን ያለውን ምድር ታወርዳለህ
ለሰው ልታይ ባዩን ታሳፍረለህ
ዓይንህን ወደ ትብያ ታንከባልላለህ
ሰው የረገጠውን አንተ ከፍ ከፍ ታደርጋለህ /2/
',0),(NULL,'ባንተ ሁሉን ችዬ','Tewlde1','ባንተ ሁሉን ችዬ - ያልክበት ደርሳለሁ
በኔ ብርታት ሳይሆን - በቃልህ አምናለሁ
የሱስ - አንተ ታላቅ አምላክ ነህ
በብዙ አሳልፈህ ለድል ታበቃለህ /2/

ቃልህ ያሻግራል- ተራራ ገደሉን
የሕይወትን ዕንቅፋት - ማዕበል ሞገዱን
ባይመስለኝም ለኔ - ድቅድቁን የማልፈው
ተናግረሃልና - መድረሴ የማይቀር ነው

ማንም በሌለበት - በምድረ በዳ ላይ
ቀርበህ ተናገርከኝ ብሩህ ቀን እንደማይ
ተስፋ አስቆራጭ መጥቶ ይህ አይሆንም ቢለኝም
እኔ ግን አምናለሁ - ቃልህ እንደሚያደርሰኝ

እንደ ጠል ደመና - በማደሪያህ ሆነህ
እርምጃዬን ሁሉ ትመለከታለህ
በደከመኝ ጊዜ - አይዞህ ትለኝና
ታራምደኛለህ - በእምነት ጎዳና

ሁሉን እችላለሁ - ሃይልን በምትሰጠኝ
በማስቻልህ ጸጋ - ስለምትመራኝ
ስለዚህ እስካለሁ - ልደገፍህና
ባንተ ሁሉን ችዬ - ልቁም እንደገና
',0),(NULL,'ዘላለም አይጥልም','Tewlde1','ዘላለም አይጥልም - ሲባል እንደሰማን
ዛሬ በአይን አይተን ምስክሮች ሆንን
ሰው ተስፋ ቢቆርጥም - የሱስ አይታክትም
ከእርሱ የሆኑትን - ለክፋት አይሰጥም

እንደማይለወጠው እንደ ሜዶንና ፋርስ ሕግ የተወሰነውን
አበቃለት ተብሎ የተጣለውን
እግዚአብሔር ግን ሁሉን ችሎ የወደቀን ያነሳዋል
በምህረት /3/ አክብሮ

ተቀበረ በቃ ዳግመኛ አይኖርም
እግዚአብሔር ትቶታል ፈላጊ የለውም
ሰው ብሎ የጣለውን ኢየሱስ ያነሳዋል
አዲስ ሰው አድርጎ ይጠቀምበታል

ለምትባዝን ሕይወት ላለች ከሱርቃ
በኩብለላ መንገድ በዓለም ክፉ ሲቃ
እንደማይመቻት የሱስ በፊት ያውቃል
በወሰነው ጊዜ በክብር ይጠራታል

ሰምቶም ዝም አይልም – በምህረት ይክሳል
ኩብለላ እንደማይመቸው አክብሮ ያሳየዋል
ዳግመኛ እንዳይሸሸው - መሻቱን ያደርጋል
ባደባባዩ ላይ - ከፍ ከፍ ያደርገዋል
',0),(NULL,'የድል ሽታ','Tewlde1','የድል ሽታ - መዓዛ ከሰልፉ ቦታ
የመንፈስ ቅዱስ ንፋስ - እያነፈሰ አመጣልኝ
አመጣልኝ /2/ 2

እኔስ ተስፋ ቆርጬ - በህይወት
እግዚአብሔር የተናገረውን ረስቷል ብዬ
ተቆራምቼ በጓዳዬ
የመንፈስ ቅዱስህ ንፋስ የድል ነገር ሽው አለልኝ
ጌታዬ ተመስገን - ኢየሱስ ተባረክ
ሃያል ሆይ ተወደስ - ዘለዓለም/ አሜን ተባረክ

የጣሉኝ ሰምሮላቸዋል አልኩኝ
እንግዲህ መነሳት አልችልም
ፍጻሜዬን ስጠባበቅ

ወጣ ገባውን - በሱ አለፍኩ
በረገጡኝም ፊት ከበርኩ
ለጌታዬም ለውለታው
እኔም በአደባባይ ይኸው
ከልቤ ምስጋናን ልስጠው
ልሰዋለት ላቅርብለት
ከልቤ ምስጋናን ልስጠው

ምስጋናን ተቀበል - በረከትን ተቀበል
ለከበረው ስምህ - ስግደቴ ይድረስህ


አስተማሪነትህን አወቅኩ
ለበጎ ማድረግህን ተረዳሁ
በምክርህም ተጠቅሜአለሁ
ስለዚህ ስርአትክን - ልጠብቅ
ከክፍዎች ምክር ልራቅ-
ጌታዬ ልራቅ ኢየሱስ ልራቅ
ከክፍዎች ምክር ልራቅ
- ዘላለም ያንተው ነኝ
ሁልጊዜ አስተምረኝ-
ከእጆችህ እንድቀበል
የሕይወትን አክሊል
የድል ሽታ...
',0),(NULL,'ስምህ የሱስ','Teru1','ስምህ የሱስ የጸና ግንብ ነው ለኔ
የተሻገርኩበት ከመከራዬ
የቆምኩበት ብርቱ አለቴ /2/

ዛሬ ልናገር የስሙን ዝና
አውሎ ንፋሱን ጸጥ አርጓልና
ወጀብ ማእበሉን አቁሟልና
ልሂድ ልናገር ስሙን ላሰማ
ስምህ መታመኛዬ - ስምህ መደገፊያዬ
ስምህ አለኝታዬ ነው - ስምህ ማምለጫ አለቴ

ልቤ ተይዞ ተጨንቄ እያለሁኝ
ስምህን ጠርቼ አየሁ ድንቅህን
በስምህ ሕይወት እንዳገኘሁኝ
ለልቤም ደግሞ ተአምራት ሆነኝ
ስምህ መታመኛዬ .....

ከቶ አልናወጥም ስምህ ይዘናል
የጸና ግንብና መጠጊያ ሆኖናል
እስራታችን ፈትቶ ናጻ ያወጣን ስምህ ነው
ዛሬም እንጠራዋለን መታመኛችን ነው

ባህር ሞልቶብኝ ከፊቴ ------
ጠላት ደርሶብኝ ከኃላዬ ሲሮጥ
ስምህን ጠርቼ አልፌዋለሁ
ከፈርኦን እጅ ያኔ አምልጫለሁ
ከቶ አንናወጥም ስምህን ይዘናል
የጸና ግንብና መጠጊያ ሆኖናል
እስራታችን ፈትቶ ናጻ ያወጣን ስምህ ነው
ዛሬም እንጠራዋለን መታመኛችን ነው /4/
',0),(NULL,'ና ኢየሱስ','Teru1','ና ኢየሱስ የልቤን ሰገነት ያዘው እንደገና
ይሁን ማደሪያህ የኔ ገናና
ይሁን መገልገያህ የኔ ጌታ /2/

አንተ የሕይወት ቃል ወዴት እሄዳለሁ?
የደምህ ውጤት ነኝ እኔ አውቃለሁ
ስለ ምህረትህ አመስግንህአለሁ
በዘመኔ ሁሉ ለአንተ እኖራለሁ

ዋሴ ነህ ኢየሱስ አንተን እጠራለሁ
እባብና ጊንጡን በስምህ ረግጫለሁ
ስለተረከብከኝ ባንተ ደስ ይለኛል
ሕይወቴን ስትመራት እጅግ ያረካኛል

ያለፈውን ሕይወቴን እኔ ስመረምር
ያስጨንቀኝ ነበር ለምን እንደምኖር
ዛሬ ግን በየሱስ ሁሉን አግኝቻለሁ
መውጣቴን መግባቴን አስረክቤዋለሁ

አንተ ስትከብር እኔ እደሰታለሁ
አንተ ስትነግስ እኔ እመካለሁ
ትምክህቴ ድጋፌ ኑሮዬ አንተ ነህ
ምድር ላይ በመኖር በሌላ በምንም አልረካሁ?
',0),(NULL,'ቀን ለቀን','Teru1','ቀን ለቀን ነገርም ታወጣለች
ሌሊት ለሌሊት እውነትን ትናገራለች /2/

ነገርን አይሰማም መናገርም የለም
ወጀቡም ንፋሱም ሁሉም ጸጥ ብሏል
እግዚአብሔር ሃሳቡን መቼ ለውጦ ያውቃል
ሁሉንም በጊዜው ኢየሱስ ያደርጓል

ሰላሳ ስምንት አመት ባልጋ ላይ ተኝቷል
አስራ ሁለት አመት ደም ሲፋሳት ኖሯል
ተስፋ የለው የላት ተብለው ተጥለው
በቀን አዳናቸው ኢየሱስ ድንቅ ነው

ቀናቶችም አልፈው ቀናቶች ተተኩ
እሱ እንደሆነ ህያው ነው የተባለለትን
ሁሉምም አይተው አይተው ምን ይሁን ያለውን
ቀን ትገልጠዋለች በገሃድ ሚስጥሩን

ፍርሃት ጥርጥር ልብ የደበቀውን
ቀን ታወጣዋለች የእግዚአብሔርን ፍቃድ
ልታልፈው አትችልም ያንን የሱን
በኃይሉ በክንዱ ሰለሚሰራባት
',0),(NULL,'እናትና አባቴ','Teru1','እናትና አባቴ እኔን ትተውኛል
እግዚአብሔር አስቦ ይኸው ተቀብሎኛል /2/

ዛሬ ከመቅበዝበዝ አስቦ ምሮኛል
በማላውቀው ስፍራ ይንከባከበኛል
እናት ትረሳለች ከማህጸንዋ የወጣ
ኢየሱስ ግን አይረሳም ከቶ አይልም ችላ

እውነት በእጁ መዳፍ ቀርጾኛል ኢየሱስ
አይተኛ አያንቀላፍም እኔኑ ሲጠብቅ
በደሌን አይቆጥር ሰው እንደሚያይ አያይ
ልቤን ኩላሊቴን ፈጥኖ ነው የሚያውቅ

አለም ሳይፈጠር አስቦ የቀደሰኝ
እስከ ሞት በሚወድ ፍቅር የታደገኝ
ከፍ ባለው ዙፋን ላይ ተቀምጦ የሚያየኝ
ይመጣል ኢየሱስ አንድ ቀን ሊወስደኝ

ዘወትር ላቅርብለት ክብርና ምስጋና
ከኔ የሚፈልገው ይህንን ነው እና
የምድር እንስሳት የእጁ ስራ ናቸው
ሌላ ምንን ላቅርብ ተመስገን ልበለው
',0),(NULL,'ጆሮ እንደ ሰማች','Teru1','ጆሮ እንደሰማች አልበየነም
አይኑም እንዳየች አልፈረደም
የተቀጠቀጠን ሻንበቆንም አልሰበረም
ኢየሱስ አለምን ሊያድን መጣ እንጂ
ለአለም ሊፈርድ አልመጣም

የእግዚአብሔር ፍቃድ በእሱ ተከናውኗል
ከነፍሱ ድካም ብርሃንን አይቷል
ጻድቅ ነው ኢየሱስ ብዙዎችን አጽድቋል
ከሃያላን ጋራ ምርኮን ይካፈላል /2/

እውነተኛው ብርሃን ወደ አለም መጣ
የታመመን ዳሶ የሞተን አስነሳ
ቀራጭ ሃጢአተኛ ሳይል ሰበሰበ
የሱስ መድሃኒት ነው የሁሉም መልስ ሆነ /2/

ደዌ የነበረውን የጥሉን ግድግዳ
በስጋው አፈረሰው አማኑኤል ሆነና
የእግዚአብሔር ቅናት ይህንን አደረገ
ህጻን ተወለደ ወንድ ልጅ ተሰጠ /2/

በሃጥያት ተይዘው የመጡትን ምረዋል
ለሁሉም በእውነትና በጽድቅም ይፈርዳል
በትህትና እና በትእግስት ያስተምራል
ለምድር የዋሆች በቅን ይበይናል /2/

',0),(NULL,'ማንም አክሊልህን','Teru1','ማንም አክሊልህን እንዳይወስድብህ
ያለህን አጽንተህ ያዝ /3/ 2

በረጅሙ ጉዞ እንዳትሰናከል
እለት እለት አስብ የበጉን መሰዋት
ይህንን ካደረክ የሱስ ያስብሃል
በቀናውም መንገድም ዘወትር ይመረሃል

መዳንህን እወቀው ወንድሜ ተረዳ
የተቀደሰ ነህ አለብህ እና እዳ
ኢየሱስ ባደረገው ከቶ አይጸጸትም
አንተ ግን በትጋት መዳንህን አጽና

ባሻገር ያለውን ብድራትህን አይተህ
የየሱስን ክብር ዝናውን አውጀህ
ቅድስናህንም በጸጋው ጠብቀህ
ጽዮን እንገናኝ ሩጫህን ጨርሰህ
',0),(NULL,'አሁንም ያእቆብ ሆይ','Teru1','አሁንም ያእቆብ ሆይ
የሰራህ እግዚአብሔር እንዲህ ይላል
ተበዢቼህ አለሁና አትፍራ
በስምህ ጠርቸህአለሁና - አንተ የኔ ነህ

አህዛብን ለርስትህ አደርግልህአለሁ
ከሩቅ ያሉትንም ሰብስቤ አመጣለሁ
በፊታቸው ሞገስ እኔ እሰጥህአለሁ
ሂድ ወደ ምልህም አብሬህ እሄዳለሁ

በውሃ ውስጥ ባለፍክ ጊዜ አያሰምጥህም
በእሳትም ውስጥ ብትሄድ ነበልባል አይፈጅህም
እኔ ካንተ ጋር ነኝ እና አድንህአለሁ
በጠላቶችህ ፊት አንተን አከብራለሁ

አትፍራ ያእቆብ ሆይ እባርክህአለሁ
በምድረ በዳ ላይ ደስ አሰኝህአለሁ
የቃል ኪዳን ልጄ እወድህምአለሁ
አንተን ልተው ስል እንዴት እችላለሁ?

በሸሎቆም ቢሆን ወይም በተራራ
ካንተ ጋር እሆናለሁ በምልክህ ስፍራ
በቤተ መቅደሴም ደስ አሰኝህአለሁ
በዘለአለም ቃል ኪዳን አንተን ወድጃለሁ
',0),(NULL,'የታሰብኩበት ፍቅር','Teru1','በምን እንዴት ባለ ዘመን እንዳሰብከኝ ባላውቅም
የታሰብኩበት ፍቅር ግን ለኔ ልዩ ነው /2/

በሰዎች ትምህርት ባዝኜ ነበርኩኝ
ታሰብኩ በምህረትህ አይኖቼህንም አዩኝ
ዘሬ ከአህዘብ ዘር ሁሉ ያነሰውን
በዘመን ፍጻሜ የሱሴ አዳንከኝ

ነብያት መርምረው ያልደረሱበትን
በራእዪ እያዩት የተሳለሙትን
መላእክት ሊሰሙ ሁሌ ሚመኙትን
ለኔ ትልቅ መዳን የሱስ ያደረገውን

አብረሃም በግርዘት ተስፋ ያረገውን
ሙሴ በከነአን ምሳሌ ያዬውን
ያንን የእምነት ጥላ ሁሉም ያላዩትን
የሱስ ለኔ ያረገው አየሁት ምህረቱን

በዘላለም መንፈስ በሚፈሰው ደምህ
በሕይወት እያለሁ አጠብከኝ እድፈቴን
ከኔ ሳይሆን ካንተ እርዳታ ሆነልኝ
እንዴት ባለ ዘመን አሰብካት ሕይወቴን
',0),(NULL,'አማኑኤል','Teru1','መባና መስዋእትን ለራሱ አልወሰደም
ስጋን አዘጋጅቶ ኢየሱስ አማኑኤል /2/
እግዚአብሔር ከኛ ጋር ሆነልን /2/

ያሻውን ያደርጋል - በሰማይ በምድር
ማንንም ሳይጠይቅ - እንደ ራሱ ምክር
በዙሪያው ያሉት - መላእክት ስለ እሱ
ቅዱስ ቅዱስ ቅዱስ - ይሉታል ሳይታክቱ

እርሱ ፊተኛ ነው - ከአብረሃም በፊት
እርሱም ኋለኛ ነው - በሚመጣው መንግስት
ከእርሱ ሌላ የለም - ሁሉንም ይገዛል
ስልጣናት ሃይላት ሁሉ - ተገዝተውለታል

ሰማይ ዙፋኑ ነው - ምድር የእግሩ መርገጫ
እንደ እርሱ የሆነ - እስቲ ይምጣ ይጥራ
የሱስ እርሱ አምላክ ነው - ብቻውን ይኖራል
ምርኮንም ለራሱ - መሰብሰብን ያውቃል

የዘለአለም መንግስት - በእጁ ላይ ነው ያለው
የሁሉ ፈጣሪ - በኩሩ እርሱ ነው
እጆቹን ለመምረጥ - ስለተዘረጉ
ዛሬም እንምጣና - እንሁን በእቅፉ
',0),(NULL,'ቃሉን ስጋ አድርጎ','Teru1','ቃሉን ስጋ አድርጎ ወደ ምድር መጥቷል
የማይታይ ባህሪውን እንዲታይ አድርጓል
ፍቅር ግድ ብሎት መከራን ታግሷል
ያለና የሚኖር ጆሆቫ አማኑኤል ሆኗል

የሰላሙ ወንጌል እግሮቼ ተጫምተው
ወደዚህ ቤት መጣሁ ሰላም ለዚህ ቤት
የክርስቶስ ሰላም አሁን ይድረሳችሁ

ህጻን ተወለደ በቤቴሌሄም በረት
የእግዚአብሔር ሃይል የሞላበት ምህረት
የሰላም አለቃ የዘላለም አባት
እወቀው ተረዳው እርሱ ነው /2/ አንድ አምላክ

እኛን ከፍ ለማድረግ ራሱን አዋረደ
ብዙዎችን ለማዳን እርሱ ተሰቀለ
መከራችንንም እርሱ ተሸከመ
በግርፋት ቁስሉ ለዘለአለም እኛ ተፈወስን

ስለዚህ ይሄ ቤት የሱስ እንዳውቀው
ንስሃ በመግባት ራሱን ይለውጠው
በስሙም ይጠመቅ ለሃጥያቱ ስርየት
በመንፈስ ተሞልቶ ይዘጋጅ ለሰማዩ መንግስት

',0),(NULL,'አመሰግንሃለሁ','Yemserach1','አመሰግንሃለሁ/8*
ቀንበሬንም ሰባበርከው
ሸክሜንም ወዲያ ጣልከው
ከእስራቴ ተፈታሁኝ
ላመልክህም ይኸው አለሁ/2/

ለውለታህ ምላሽ - ለአንተ የምሰጠው
ምስጋና ነው ያለኝ - አቅሜ ይኸው ነው
አይበዛም ምስጋና - ብጨምር ብጨምር
ከቶ አይገልጸውም - ኢየሱስ የአንተን ክብር

ሸክም የለበትም - ባዶ ነው ጫንቃዬ
ዕዳ የለብኝም - ተከፍሏል እዳዬ
ተፈትቻለሁኝ - ለቆኛል እስራት
ተመስገን ተባረክ - የበረከት አባት

የማማረር ኑሮ - የሐዘኔ አበሳ
አሁን እዚህ የለም - ያ ሁሉ ተረሳ
የምስጋና ቅኔ - በቦታው ተተካ
ኢየሱስ አንደበቴን - ለውጦታል ለካ

ከላይ ከአርያም - ሰውን ተመልክተህ
የአንተ ልታደርገው - እጅህን ዘርግተህ
ኢየሱስ መልሰኸው - ወደ እቅፍህ ህጉያ
ታሳምረዋለህ - አሜን ሃሌሉያ
',0),(NULL,'ሰውነቴንበፊትህ','Yemserach1','ሰውነቴን በፊትህ/2
ሕያው ቅዱስ መስዋዕት አድርጌ
በፊትህ አቀርባለሁ ጉልበቴን/2
ተቀበለው ኢየሱስ ሕይወቴን /2/*

ሰውነቴን በመንፈስ ዘይት ቅባው
ይሁን ሕያው መልካም መዓዛ ያለው
ሰላምህ የማያቋርጥ ወንዝ
በመንገድህ እንድሄድ የሚያግዝ
እያልኩ ቅድስና ለእግዚአብሔር
ምስክርህ ሆኜ እንድገኝ/እንድኖር  /2/

እንዳገኝ የከበረ ዋጋ 
አብዛልኝ የእምነትን ፀጋ
በእውነተኛ በረከት ባርከኝ 
ዘወትር ለክብርህ አቁመኝ
ይሄ ነው ኢየሱስ መሻቴ
ንገስ ለዘላለም በሕይወቴ/2/

ከአንተ ጋር ከሆንኩ ድል የኔ ነው
ሥራዬን በእምነት እሰራለሁ
በደስታ እወጣለሁ እገባለሁ
እራሴን ለአንተ ሰጥቻለሁ
ኃያል ነህ ኃይልህን አይቻለሁ
በአንተ ከአሸናፊዎች እበልጣለሁ /2/

በሙሉ ኃይሌ ልገዛልህ 
በልቤ ፈቃድ ልሰዋልህ
አምላኬ ለኔ ጉልበቴ ነህ 
በዘመኔምላገልግልህ
አይቼ መልካም ስጦታህን
እንድወርስ ከብሮ የሚበልጠውን /2/
',0),(NULL,'የማያልቅየማይደርቅ','Yemserach1','በማይቆጠር ኃጥአት ልቤ ሲፈርድብኝ
ሰላም አሳጥቶ ጠላቴ ሲከሰኝ
ወደ ጸጋህ ዙፋን እንበረከካለሁ
የማያልቅ ምህረትህ ጌታ አስተውያለሁ

የማያልቅ የማይደርቅ 
የምህረት ምንጭ አለህ ኢየሱስ/2/
የማያልቅ የማይጎድል 
የምህረት ምንጭ አለህ ኢየሱስ/2/

ምንም እንኳን ራሱን ለክፋት የሸጠ
በምድር ባይገኝ እንደ አክዓብ ያለ
እራሱን አዋርዶ ቅስስ ብሎ ሲሄድ
ልመናውን ሰማኸው ምህረት አረክለት

እስከ ሰማይ ደርሶ የነነዌ ኃጥያት
አጠፋለሁ ብለህ እንደገና ራራህ
ምህረትህ የበዛ ከቁጣ የዘገየህ
አምላካችን የሱስ እንዳንተ ማን አለ?

በላይ የደፋኸው የምህረት ኪዳንህ
በዘላለም መንፈስ የሚፈሰው ደምህ
ዘወትር ኃጥያቴን ባዶ እያደረገ
ሰማይ ያደርሰኛል ያሳየኛል አንተን
',0),(NULL,'ለክብርህካልሆነመኖሬ','Yemserach1','ለክብርህ ካልሆነ መኖሬለክብርህ ካልሆነ /2/
ምን ያደርግልኛል ኢየሱስ በሕይወቴ ካልታየ
ክርስቲያን ተብዬ መኖሬ ለእርሱ ካልተለየሁ/2/*

በምድር ላይ እስካለሁ አንተን እንዳከብር
አምላኬ ሆይ እርዳኝ ለክብርህ እንድኖር
ኃላፊውን ነገር ከንቱን ሁሉ ንቄ
ፊት ለፊት እንዳይህ ጌታ አንተን አውቄ

በሥራዬም ሁሉ ከአለም ተለይቼ
መጓዝን ካልቻልኩኝ ኢየሱስን አይቼ
ምን ያደርግልኛል ክርስቲያን መባሉ
ከአህዛብ ተለይቼ ካልሆንኩ እንደቃሉ

የሱስ እንዲሠራኝ ካልተመኘሁኝ
ሕይወቴን በሙሉ ካልለወጠልኝ
መዳኔ ካልታየኝ ካላስደነቀኝ
ለሌላ ሰጥቼካላካፈልኩኝ

የነፍሴ እርካታ የኑሮ ትርጉሙ
ጣዕም የሚኖረው ደስታና ሰላሙ
ጌታ ኢየሱስ ሲከብር በመላ እኔነቴ
ያን ጊዜ ሙሉ ነው ክርስቲያንነቴ
',0),(NULL,'ሁሉንልታደርግቻይእንደሆንክ','Yemserach1','ሁሉን ልታደርግ ቻይ እንደሆንክ
ሐሳብህ እንደማይከለከል
መስማት በጆሮዬ ሰምቼ ነበር/2*
አሁን ግን አይኔ አየችህ/2*

ተስፋ የለውም እኔ ያልኩትን ጌታ ድንቅ አድርገህ ስትሰራ
ስታለመልም ስትለውጠው ሜዳ ስታደርግ ያን ተራራ
አይቻለሁኝ በዘመኔ ስትለመነኝ ስለስምህ
ስታደርግልኝ ስታስደንቀኝ እጄን በአፌ ላይ አስጭነህ/2*

በጠራሁህ ቀን ቀርበህ ወደኔ አትፍሪ ልጄ ብለኸኝ
ስለ እኔም ቆመህ ተሟግተህ ከከሳሼ እጅ አድነኸኝ
ጭንቀቴን አይተህ ፍርዴን ፈርደሃል ረዳቴ ሆነህልኝ
መልካም በሆነው በሩህሩህ እጅህ ጌታ ኢየሱስ ይዘኸኝ/2*

ማለዳ ማለዳ አዲስ በሆነው በማያልቀው ምህረትህ
ተሸፍኛለሁ ተከልያለሁ ከቶ ምን አለ ሚያገኘኝ?
ሁሉን ልታደርግ ኢየሱስ ቻይ ነህ እራሴን ለአንተ ሰጥቻለሁ
ሐሳብህንም የሚመስለው እንደሌለ አውቄአለሁ/2*

ልቤን ከእጄ ጋር አነሳለሁ በሰማያት ወዳለኸው
ለዘላለም ወደ ማትጥል እሩህሩህ ጌታ ወደ ሆንከው
ተስፋ አድርጎ ለሚጠብቅህ የማታሳፍር አምላክ ነህ
የሚታመኑህ የሚመኩብህ የሚደገፉህ ንጉስ ነህ/2*
',0),(NULL,'የትአለየትአለ','Yemserach1','የት አለ የት አለ እንደ ኢየሱስ ያለ
የት አለ የት አለ እንደ አምላኬ ያለ /2/*
በኃይል በችሎታው የት አለ
እርሱን የመሰለ የት አለ
እስቲ ይነሳና የት አለ
እንየው በሥራው /በፍቅሩ/ የት አለ  /2/*

ከባርነት ቀንበር ሕዝቡን ያላቀቀ
ባህር የከፈለ ውሃን ያደረቀ
ሕዝቡን ያሻገረ ጠላት ያሳፈረ
የትኛው አምላክ ነው እንደ ኢየሱስ ያለ
በክብር ከፍ ያለ ሕዝቡን ያስዘመረ
ዕረፍትን የሰጠ እርሱ የተከበረ

በምድረበዳ ላይ መምራትን የሚያውቅ
መራራውን ውሃ ጣፋጭ የሚያደርግ
እንጀራን ከሰማይ መስጠት የተቻለው
ከኢየሱስ በቀር የትኛው አምላክ ነው
አለትን ሰንጥቆ ውሃን ያፈለቀ
ጌታ ኢየሱስ ብቻ እርሱ የተደነቀ

ሰባራውን ጠጋኝ ቁስልን ፈዋሽ
የወደቀን አንሺ ዕንባንም አባሽ
ለምስኪን ሚራራ ፈጥኖ የሚደርስ
ከኢየሱስ በቀር ልብ የሚያሳርፍ
ኧረ የት ይገኛል እንደ እርሱ ፍቅር
በሐዘን በደስታ አብሮ የሚኖር

በአዲስ ኪዳን ዘመን በሥጋ ተገልጦ
ብዙ ተአምራትን በምድር ላይ አርጎ
ወደ ነበረበት በክብር ያረገው
እውነተኛው አምላክ ደግሞም የሚመጣው
ኢየሱስ ነው እርሱ ያለ የሚኖር
የሚመስለው የለም በሞገስ በክብር
',0),(NULL,'ሥራውግሩምናድንቅነው','Yemserach1','ነፍሴን ደስ አሰኝቷልና
ምኞቴን ከበረከቱ አጥግቧልና
ሰዋለሁ ለኢየሱስ ምስጋና/3/ 2

ሥራው ግሩምና ድንቅ ነው/2*
ከሰው ልብ አዕምሮ ሆሆሆ
ከግምት በላይ ነው
ሥራው ግሩምና ድንቅ ነው

ጠዋት ታይቶ ማታ ከቶ የማይጠፋ
ኢየሱስ ልቤን ሞላው በእውነተኛው ደስታ
የተመኘችውን ነፍሴ አግኝታለች
በለመለመው መስክ በጥላው አርፋለች
ሥራህ ግሩም ነው ኢየሱስ/2*
ሥራህ ድንቅ ነው ትላለች/2*

ከልቦናዬ ሐሳብ ግምት አስበልጦ
ጸሎቴን መለሰ ባረከኝ አትርፎ
በዘመኔ ሁሉ እሰግድለታለሁ
ሥራህ ግሩምና ድንቅ ነው እላለሁ
ሥራህ ግሩም ነው ኢየሱስ/2*
ሥራህ ድንቅ ነው እላለሁ/2*

የእስራኤል አምላክ ባህሩን የከፈለው
የኢያሱ አምላክ ጸሐይን ያቆመው
ግሩም ድንቅ ስራህን ዛሬም መቼ ተወው
እኛም በዚህ ዘመን ይኸው እያየን ነው
ሥራህ ግሩም ነው ኢየሱስ/2*
ሥራህ ድንቅ ነው እንበለው/2*

',0),(NULL,'ሁልጊዜበምህረት','Yemserach1','ሁል ጊዜ በምህረት አይንህ የምታየኝ
እንደ ኃጥያቴ እንደ በደሌ የማትከፍለኝ
እንደገና እንደገና እየማርክ በቤትህ ያቆምከኝ
ለጠላቴ ፈቃድ አሜን መሻት ያልሰጠኸኝ
የምህረት አምላክ ኢየሱስ ተመስገን
የርህራሄ አባት ኢየሱስ ተመስገን/2/

አቤቱ ምህረትህ ለእኔ እንዴት ብዙ ነው
ከቁጥር  ከግምት ከስፍርበላይ ነው
በቅዱስ ማደሪያህ በሕይወት ያኖረኝ
ጌታ ምህረትህ እንጂ እኔማ ደካማ ነኝ/2*

ሥጋዬ በኃጥያት ዘወትር ሲያደክመኝ
በክፉ መሻቱ ጠላቴ ሲያስተኝ
የምህረት አይኖችህ በርህራሄ ያዩኛል
የፍቅር እጆችህ አቅፈው ያነሱኛል/2*

የሱስ ስለምህረትህ አመስግኜ አልጠግብም
ምህረትህን ሳስብ ዝም ማለት አልችልም
ልቤ በደስታ ከውስጤ ይዘላል
አሁንም ምስጋና ምስጋና ይለኛል/2*

ለዘላለም መንግስት ዋስትና የሆነኝ
ጌታ አንተን ፊት ለፊት በክብር የሚያሳየኝ
አለኝ የምለው ጽድቄ ድፍረት የሚሆነኝ
ለታላቅ ምህረትህ ብዙ ምስጋና አለኝ/2*
',0),(NULL,'የጣኦታትንስም','Yemserach1','የጣኦታትን ስም ከምድር ያጠፋል
ምሽግን ያፈርሳል ምርኮን ይመልሳል
እግዚአብሔር ተዋጊ ነው ዛሬም ያሸንፋል
ዛሬም ድልን ያደርጋል  /2/*

አሸናፊ ነው አሸናፊ ነው
እግዚአብሔር ተዋጊ ነው /2/*

በነቢያት በሐዋሪያት ዘመን እንደሰራው
እኛም እናያለን እርሱን ጊዜ አይሽረው
የአማልክትን ስም ከምድር ያጠፋል
ኃያሉ እግዚአብሔር ከፍ ከፍ ከፍ ይላል

ኃይል አለው እየሱስ የሆነ ሁሉን ቻይ
ስሙ የከበረ ከስም ሁሉ በላይ
የሚመስለው ማነው በምድር በሰማይ
ይሰራል እየሱስ ከቶ ማን ነው ከልካይ

ቃል ኪዳኑ የጸና አምላክ ነው ዘላለም
ሰማይ ምድር ቢያልፍም ቃሉ ግን አያልፍም
በወደደን በእርሱ ድል እናገኛለን
እኛም ከአሸናፊዎች ሁሉ እንበልጣለን

በዲያቢሎስ ወጥመድ የታሰሩ ሁሉ
በጣኦት አምልኮ ነፍሳቸው የዛሉ
በኃይሉ ተፈተው ወደ እርሱ ይመጣሉ
በአንድነት የሱስን ብቻ ያመልካሉ

',0),(NULL,'ጽዮን ሆይ ','Yemserach1','ጽዮን ሆይ ኢየሩሳሌም ሆይ
አልረሳሽም/2*
ብርሃንሽ ለሕይወቴ ብርሃን ነው
በአንቺ ጠላቶቼን አድቅቄአለሁ
ዛሬ ግን ብረሳሽ ቀኜ ትርሳኝ
ባላስብሽ ባላስታውስሽ
ጠብቼ ማደጌን ከማጽናናት ጡትሽ

በጉያ ሸሽገሽ ከክፉ ከለልሽኝ
በብርሃንሽም ቀን አደረግሽልኝ
ጨለማው ሕይወቴ በውስጥሽተገልጦ
ሰው ሆኜልሻለሁ ታሪክ ተለውጦ/2*

ዘመኔ ታደሰ ባንቺ ተወለድኩኝ
የአምላኬን ምህረት ሁሉ አገኘሁኝ
የጌታዬን ማዳን ትዕዛዝ ሰማሁብሽ
አልረሳሽም እኔ ጽዮን እናቴ ነሽ/2*

መሰማሪያዬ ነሽ የነፃነት ቤቴ
በቅጥርሽ ይሰማ እልልታ ዝማሬዬ
የሱስ በተራራው በበገና ይክበር
በውስጥሽ ከአምላኬ ጋር ዘላለም ልኑር 
አሜን ልኑር
',0),(NULL,'አስረግጦኛል','Yemserach2','አስረግጦኛል የጠላቴን እራስ
እቀጠቅጣለሁ የዘንዶውን አናት
በየሱስ ስም
 በየሱስ ስም አሸንፈአለሁ
ዛሬ በምስጋና በድልህ ቆሜለሁ /2/

ዘመን ቢለዋወጥ እርሱ አይለወጥም
የጸና አምላክ ነው የሱስ ለዘላለም
ሃያላን ሃይላቸው ዝሎ ተሸንፈዋል
ኢየሱስ ግን ዛሬ በስልጣን ይገዛል /2/

ቀንበር በጫንቃዬ ያከበደብኝን
ሰባብሮ ጣለለኝ ያስጎነበሰኝን
ዛሬ ቀና ብዬ በእረፍት እጓዛለሁ
ሸክም የሆነብኝን ጥዬ ረግቻለሁ /2/

የእስራቴን ገመድ ፈትቶ ድልን ሰጠኝ
ወጥመዱን ሰባብሮ ቅጥሩን አዘለለኝ
ያነባሁባቸው ዘመናት አልፈዋል
የደስታዬ ወራት አሁን መጥቶልኛል /2/

የማመልከው አምላክ ክንደ ብርቱ ነው
በሃይል በችሎታው የለም የሚመስለው
ከከበቡኝ ሁሉ አርነት አወጣኝ
አስጨናቂዎቼ ከእግሬ ስር ጣለለኝ /2/
',0)